{
  "start_entry_id": "scene_1_boarding_e001",
  "entries": {
    "scene_1_boarding_e001": {
      "entry_id": "scene_1_boarding_e001",
      "content": "I settle into seat 22A, the faux-leather cool against my legs. The plane, a generic 737-800, smells faintly of disinfectant and jet fuel. Outside the oval window, the blurred landscape of the airport slowly trundles past. A pre-flight announcement crackles over the intercom, a loop already beginning: \"...ensure your seatbelt is correctly fastened... ensure your seatbelt is correctly fastened...\" \n\nTo my right, in 22B, a man sits motionless. Grey suit, blue tie slightly askew. He hasn't moved since I boarded. His eyes are fixed straight ahead, unblinking. I can't help but stare. The announcement repeats again, a little too loud this time. \"...ensure your seatbelt is correctly fastened...\"\n",
      "choices": [
        {
          "content": "Take a look out of the window.",
          "entry_id": "scene_1_boarding_e002"
        },
        {
          "content": "Fiddle with the entertainment system.",
          "entry_id": "scene_1_boarding_e003"
        },
        {
          "content": "Clock the strange guy next to me.",
          "entry_id": "scene_1_boarding_e004"
        }
      ],
      "end": null
    },
    "scene_1_boarding_e002": {
      "entry_id": "scene_1_boarding_e002",
      "content": "Looking out the window, I notice the ground crew. One of them is directing a baggage cart to repeat its route over and over. Another is frozen mid-gesture, like a broken animatronic. The sky outside the window is an unnaturally flat blue, like a painted backdrop in a theater. I blink, and for a moment, it seems to ripple.",
      "choices": [
        {
          "content": "Try to make sense of the strange things I'm seeing outside.",
          "entry_id": "scene_2_unease_e001"
        },
        {
          "content": "I've seen enough. Time to turn back to the cabin.",
          "entry_id": "scene_1_boarding_e005"
        }
      ],
      "end": null
    },
    "scene_2_unease_e001": {
      "entry_id": "scene_2_unease_e001",
      "content": "We're in the air. The cabin lights are doing a funny dance, flickering like a dying firefly. That announcement about seatbelts? It's back, for what feels like the tenth time. The guy in 22B hasn't flinched. It's like he's been replaced with a mannequin. And… is the aisle longer? It feels like I'm looking down a tunnel.",
      "choices": [
        {
          "content": "Time for a trip to the lavatory. Maybe splashing some water on my face will help.",
          "entry_id": "scene_2_unease_e002"
        },
        {
          "content": "Flag down a flight attendant. They must have noticed something is up.",
          "entry_id": "scene_2_unease_e003"
        },
        {
          "content": "Try to ignore the weirdness and hope it goes away. Deep breaths.",
          "entry_id": "scene_2_unease_e004"
        }
      ],
      "end": null
    },
    "scene_2_unease_e002": {
      "entry_id": "scene_2_unease_e002",
      "content": "My brain is screaming for something normal. The lavatory. Yes. Sterile, predictable, a tiny box of sanity at the front of this madhouse on wings. A brief escape is worth it. I remember it's on the left, near the front.",
      "choices": [
        {
          "content": "Head for the lavatory.",
          "entry_id": "scene_3_bathroom_e301"
        },
        {
          "content": "Nah, maybe it's best to just sit tight for now.",
          "entry_id": "scene_2_unease_e005"
        }
      ],
      "end": null
    },
    "scene_3_bathroom_e301": {
      "entry_id": "scene_3_bathroom_e301",
      "content": "I push open the lavatory door. It’s… bigger than I remember. The walls seem further apart, the space elongated. My reflection in the mirror is blurry, indistinct. And there’s this prickling sensation, like eyes on the back of my neck.",
      "choices": [
        {
          "content": "Check the mirror for anything strange.",
          "entry_id": "scene_3_bathroom_e302"
        },
        {
          "content": "Inspect the walls for cracks or seams that might explain the size.",
          "entry_id": "scene_3_bathroom_e303"
        },
        {
          "content": "Concentrate and listen closely to any sounds from outside the lavatory.",
          "entry_id": "scene_3_bathroom_e304"
        }
      ],
      "end": null
    },
    "scene_3_bathroom_e302": {
      "entry_id": "scene_3_bathroom_e302",
      "content": "Looking at the mirror, my reflection seems\ndifferent. My movements are a beat behind, like a badly dubbed movie. And the reflection itself seems to stretch back further than the actual space of the lavatory would allow. It's like looking into another room entirely.",
      "choices": [
        {
          "content": "Touch the mirror. Go on, you know you want to.",
          "entry_id": "scene_3_bathroom_e305"
        },
        {
          "content": "Look away, scan the room, anything but that mirror.",
          "entry_id": "scene_3_bathroom_e306"
        }
      ],
      "end": null
    },
    "scene_1_boarding_e003": {
      "entry_id": "scene_1_boarding_e003",
      "content": "The in-flight entertainment screen sputters to life. The airline's 'Sky High' logo, a stylized bird in flight, appears, then blurs into a pixelated mess. A menu flickers momentarily \">– 'Movies', 'TV', 'Games' \">– before the logo returns. Beneath it, the repeating announcement about seatbelts drones on, a digital echo chamber. I tap the screen impatiently, but nothing happens.",
      "choices": [
        {
          "content": "I stab furiously at the 'Movies' option, hoping something will load.",
          "entry_id": "scene_2_unease_e001"
        },
        {
          "content": "I give up on the entertainment system and look around the cabin instead.",
          "entry_id": "scene_1_boarding_e005"
        }
      ],
      "end": null
    },
    "scene_2_unease_e003": {
      "entry_id": "scene_2_unease_e003",
      "content": "Brenda, the flight attendant with the tightly wound bun and nametag, finally responds to my insistent waving. She stops beside my seat, her expression conveying a weariness that seems beyond her years. \"Yes?\" she says, the word clipped and efficient. Before I can fully launch into my concerns about the flickering lights and the endless seatbelt announcement, she cuts me off slightly, tilting her head expectantly.",
      "choices": [
        {
          "content": "Try and get her attention.",
          "entry_id": "scene_4_crew_e401"
        },
        {
          "content": "I bottle it for now and remain seated, fidgeting anxiously.",
          "entry_id": "scene_2_unease_e005"
        }
      ],
      "end": null
    },
    "scene_4_crew_e402": {
      "entry_id": "scene_4_crew_e402",
      "content": "Brenda's smile doesn't quite reach her eyes. \"Sir/Madam,\" she begins, her voice a carefully controlled monotone, \"is there a problem?\" Before I can answer, the 'ensure your seatbelt is correctly fastened' announcement blares again, slightly louder this time, cutting off my reply. She flinches almost imperceptibly.",
      "choices": [
        {
          "content": "I insist, pointing out the repeating announcements and the dancing cabin lights.",
          "entry_id": "scene_4_crew_e405"
        },
        {
          "content": "I demand a straight answer: 'Is everything normal on this flight?'",
          "entry_id": "scene_4_crew_e405"
        }
      ],
      "end": null
    },
    "scene_4_crew_e405": {
      "entry_id": "scene_4_crew_e405",
      "content": "Brenda's gone, leaving me to stew in my confusion. The 'Sky High' magazine in the seat pocket stares back at me, its cover model beaming a disturbingly perfect smile. I could write this off as travel stress, or admit something is deeply wrong.",
      "choices": [
        {
          "content": "I try to rationalise it away.",
          "entry_id": "scene_5_escalating_e001"
        },
        {
          "content": "I accept that something isn't right, and that I need to get to the bottom of it.",
          "entry_id": "scene_4_crew_e406"
        }
      ],
      "end": null
    },
    "scene_1_boarding_e004": {
      "entry_id": "scene_1_boarding_e004",
      "content": "The passenger in 22B is a statue. Grey suit, lifeless eyes staring straight ahead. He hasn't blinked once since boarding. The overhead announcement repeats again: \"...ensure your seatbelt is correctly fastened...\" It grates, amplified by the unnerving stillness beside me. I feel an urge to get his attention.",
      "choices": [
        {
          "content": "Poke the passenger in seat 22B.",
          "entry_id": "scene_2_unease_e001"
        },
        {
          "content": "Ignore 'Mr. Stares-a-lot' and take in my surroundings instead.",
          "entry_id": "scene_1_boarding_e005"
        }
      ],
      "end": null
    },
    "scene_2_unease_e004": {
      "entry_id": "scene_2_unease_e004",
      "content": "I try to tell myself it's just a bit of turbulence, air conditioning, bad coffee. But the repeating announcement burrows into my skull, a broken record in the sky. Closing my eyes makes it worse, the drone somehow louder. The guy next to me hasn't stirred once since we took off.",
      "choices": [
        {
          "content": "Close my eyes and try to sleep.",
          "entry_id": "scene_5_escalating_e001"
        },
        {
          "content": "Keep my eyes open and watch, see what develops.",
          "entry_id": "scene_2_unease_e006"
        }
      ],
      "end": null
    },
    "scene_5_escalating_e001": {
      "entry_id": "scene_5_escalating_e001",
      "content": "The cabin stretches. It's subtle at first, like looking through a fisheye lens, then more obvious. The aisle's a bowling alley. The walls breathe like lungs, or maybe it's just my imagination. I look out the window, clouds repeating in identical formations like a bad screensaver.",
      "choices": [
        {
          "content": "Focus on the aisle and its growing length.",
          "entry_id": "scene_5_escalating_e002"
        },
        {
          "content": "Focus on the window, see what's out there in the sky.",
          "entry_id": "scene_5_escalating_e003"
        },
        {
          "content": "Focus on the cabin walls and their wobbly appearance.",
          "entry_id": "scene_5_escalating_e004"
        }
      ],
      "end": null
    },
    "scene_5_escalating_e002": {
      "entry_id": "scene_5_escalating_e002",
      "content": "It's not just long; it's impossibly long, bending and twisting. I stare ahead and the seats shrink into tiny boxes. The carpet pattern blurs into an endless stream of blue and grey. The end of the plane should be there, but it isn't. It just goes on.",
      "choices": [
        {
          "content": "Walk further down the aisle.",
          "entry_id": "scene_5_escalating_e005"
        },
        {
          "content": "Check the passenger in 22B for any reaction, and see if they also notice the stretching aisle.",
          "entry_id": "scene_5_escalating_e006"
        },
        {
          "content": "Try to find a way off the plane.",
          "entry_id": "scene_6_expanding_e600"
        }
      ],
      "end": null
    },
    "scene_5_escalating_e005": {
      "entry_id": "scene_5_escalating_e005",
      "content": "I walk, and walk, and walk. The aisle stretches, unspooling like thread from a never-ending spool. I pass rows and rows of empty seats. The air is thick with a low, humming sound, and the smell of disinfectant is overwhelming. The end of the plane remains elusive, forever receding.",
      "choices": [
        {
          "content": "Keep walking further into the plane.",
          "entry_id": "scene_6_expanding_e600"
        }
      ],
      "end": null
    },
    "scene_1_boarding_e005": {
      "entry_id": "scene_1_boarding_e005",
      "content": "A growing sense of unease settles in. Whether it's the unsettling view from the window, the malfunctioning entertainment, or the unnerving stillness of the passenger beside me, something feels wrong. I decide to take in my surroundings more closely.\n\nThe carpet is a standard airline design of interweaving blues and greys, but now the pattern seems to subtly shift and repeat, like an M.C. Escher drawing laid out on the floor. A metallic creaking sound emanates from the overhead bins, a noise like they are being twisted, even though the plane is still on the ground. The repeating announcement continues intermittently, the same line about seatbelts echoing in my ears. It's getting louder.",
      "choices": [
        {
          "content": "Study my surroundings more closely.",
          "entry_id": "scene_2_unease_e001"
        },
        {
          "content": "Reach for the airline magazine 'Sky High' in the seat pocket. I need some kind of distraction.",
          "entry_id": "scene_2_unease_e001"
        }
      ],
      "end": null
    },
    "scene_3_bathroom_e303": {
      "entry_id": "scene_3_bathroom_e303",
      "content": "Examining the walls reveals impossible angles where panels meet. The metal is thin, easily marked, and painted a pale, antiseptic shade of white. Seams run in directions that don't make sense, and the curvature of the walls feels wrong for the plane's fuselage. The sense of the space being 'off' is undeniable. It feels like this small room is becoming a trap.",
      "choices": [
        {
          "content": "Follow a seam along the wall, observing its strange angles. Maybe it will lead me somewhere?",
          "entry_id": "scene_3_bathroom_e305"
        },
        {
          "content": "Knock lightly on the wall, testing its solidity.",
          "entry_id": "scene_3_bathroom_e306"
        }
      ],
      "end": null
    },
    "scene_3_bathroom_e305": {
      "entry_id": "scene_3_bathroom_e305",
      "content": "Looking at the mirror, my reflection seems\\_off. My movements are a beat behind, like watching a badly dubbed movie. And the reflection itself seems to stretch back further than the actual space of the lavatory would allow.",
      "choices": [
        {
          "content": "Take a picture of the anomaly with my phone and venture further into the plane's impossible spaces. I need proof.",
          "entry_id": "scene_6_expanding_e600"
        },
        {
          "content": "Run back to my seat to observe if the cabin is also affected by the spatial distortions.",
          "entry_id": "scene_5_escalating_e001"
        }
      ],
      "end": null
    },
    "scene_6_expanding_e600": {
      "entry_id": "scene_6_expanding_e600",
      "content": "I'm now exploring the impossibly large plane. Corridors stretch out much further than they should. Doorways appear where walls should be. The layout shifts every time I blink. A sense of unreality is setting in. I can't tell if I'm walking in circles. The air feels thin, and the repeating announcement echoes from far away: \"...ensure your seatbelt is correctly fastened...\"",
      "choices": [
        {
          "content": "Venture further down the seemingly endless corridor.",
          "entry_id": "scene_6_expanding_e601"
        },
        {
          "content": "Step into the unexpectedly appearing room to my left.",
          "entry_id": "scene_6_expanding_e602"
        },
        {
          "content": "Try to find my seat. Familiarity might be reassuring.",
          "entry_id": "scene_6_expanding_e603"
        },
        {
          "content": "Consider trying to find the cockpit for answers. Someone must know what's happening.",
          "entry_id": "scene_6_expanding_e608"
        }
      ],
      "end": null
    },
    "scene_6_expanding_e601": {
      "entry_id": "scene_6_expanding_e601",
      "content": "I'm walking down a corridor that seems to extend far beyond the physical limits of a plane. The carpet pattern, that endless interweaving of blue and grey, repeats endlessly. The walls are featureless and sterile, a pale, antiseptic white. The sense of space is wrong; it's both vast and claustrophobic. I can hear a faint humming, like a refrigerator, but much louder.",
      "choices": [
        {
          "content": "Attempt to open one of the many unmarked doors lining the corridor.",
          "entry_id": "scene_6_expanding_e604"
        },
        {
          "content": "Continue walking down the corridor, observing its impossible length. Maybe I'll reach the end eventually?",
          "entry_id": "scene_6_expanding_e605"
        }
      ],
      "end": null
    },
    "scene_2_unease_e005": {
      "entry_id": "scene_2_unease_e005",
      "content": "Remaining in my seat only amplifies the unease. The cabin lights flicker again, longer this time, almost plunging the cabin into darkness. The emergency lights cast long, eerie shadows. That announcement voice repeats, now slightly faster, the phrase about seatbelts becoming distorted and garbled, merging into a single, incomprehensible word. I feel a growing sense of something physically wrong with the plane, a subtle vibration that wasn't there before, now a definite tremor running through the frame. I glance down the aisle; it seems to stretch further than it did a moment ago, the rows of seats receding into a vanishing point. The passenger in 22B remains still as a statue, but I could swear his head is tilted at a slightly unnatural angle.",
      "choices": [
        {
          "content": "Check the safety card again, searching for a rational explanation.",
          "entry_id": "scene_2_unease_e007"
        },
        {
          "content": "Go to the lavatory.",
          "entry_id": "scene_2_unease_e008"
        }
      ],
      "end": null
    },
    "scene_2_unease_e007": {
      "entry_id": "scene_2_unease_e007",
      "content": "The safety card depicts an airplane, but the number of windows is wrong; there appear to be too many, and they're too close together. The emergency exits seem to shift position with each glance, doors appearing and disappearing as I blink. The illustrations of the passengers are all smiling, their faces frozen in identical, unnerving grins. This is not right. Not at all.",
      "choices": [
        {
          "content": "Go to the lavatory. I need to get away from this.",
          "entry_id": "scene_3_bathroom_e301"
        },
        {
          "content": "Flag down a flight attendant. I need answers, or at least some acknowledgement that this is happening.",
          "entry_id": "scene_4_crew_e401"
        },
        {
          "content": "Try to close my eyes and sleep, hoping it's a bad dream.",
          "entry_id": "scene_5_escalating_e001"
        }
      ],
      "end": null
    },
    "scene_5_escalating_e003": {
      "entry_id": "scene_5_escalating_e003",
      "content": "The clouds outside the window are no longer natural formations. They repeat in a disconcerting pattern, like a badly tiled texture in a video game. The sky beyond seems too uniform, too blue, almost like a painted canvas rather than the open expanse of the atmosphere. The illusion is ruined and the whole thing is clearly fake.",
      "choices": [
        {
          "content": "Look more closely at the window, trying to understand the repeating patterns. Perhaps there's a clue hidden within the artificiality.",
          "entry_id": "scene_5_escalating_e007"
        },
        {
          "content": "Turn away, focusing inwards. This is all too much to process.",
          "entry_id": "scene_8_distorted_e801"
        }
      ],
      "end": null
    },
    "scene_5_escalating_e007": {
      "entry_id": "scene_5_escalating_e007",
      "content": "Looking closer at the window only intensifies the unsettling feeling. The repeating patterns become more complex, like a fractal design unfolding in the sky. The more I stare, the more I lose a sense of scale; are those clouds, or something much, much larger? I feel a growing unease, a dizziness threatening to overwhelm me, and I decide to look away.",
      "choices": [
        {
          "content": "Focus inwards, succumbing to the impossible environment.",
          "entry_id": "scene_8_distorted_e801"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e801": {
      "entry_id": "scene_8_distorted_e801",
      "content": "Reality breaks down completely. The environment becomes intensely personalized, morphing to reflect my deepest anxieties. Objects shift and change in impossible ways; the seat fabric feels like skin, the overhead bins resemble teeth. The plane seems to react to my thoughts and emotions, amplifying my fear and confusion.",
      "choices": [
        {
          "content": "Focus on the familiar and personal element of seat 22A, clinging to it as an anchor in this chaos.",
          "entry_id": "scene_8_distorted_e802"
        },
        {
          "content": "Test the limits of this new reality by exploring the aisle, venturing into the unknown depths of the distorted plane.",
          "entry_id": "scene_8_distorted_e803"
        },
        {
          "content": "Turn inwards and close my eyes, trying to find some internal stability. Maybe, just maybe, I can control this from within.",
          "entry_id": "scene_8_distorted_e804"
        }
      ],
      "end": null
    },
    "scene_2_unease_e006": {
      "entry_id": "scene_2_unease_e006",
      "content": "You look out the window. The clouds are arranged in precise rows, like cotton balls glued to a vast, blue canvas. There's no depth, no variation, just an unnerving repetition that stretches to the horizon and beyond. It's the kind of thing you might see in a child's drawing, not the real world. It messes with your head, this feeling that something fundamental is broken.",
      "choices": [
        {
          "content": "Examine the window shade more closely, looking for a clue.",
          "entry_id": "scene_2_unease_e009"
        },
        {
          "content": "Call a flight attendant about the bizarre clouds.",
          "entry_id": "scene_2_unease_e008"
        }
      ],
      "end": null
    },
    "scene_2_unease_e009": {
      "entry_id": "scene_2_unease_e009",
      "content": "The shade feels oddly resistant. It's as if it's glued in place. With a sharp tug, it finally relents, accompanied by a high-pitched whine, almost inaudible but definitely there. The clouds outside seem to flicker, like a broken TV screen, the repeating pattern momentarily dissolving into static before snapping back into its unsettling order. The air is thick with anticipation.",
      "choices": [
        {
          "content": "Go to the lavatory.",
          "entry_id": "scene_3_bathroom_e301"
        },
        {
          "content": "Flag down a flight attendant.",
          "entry_id": "scene_4_crew_e401"
        },
        {
          "content": "Try to sleep.",
          "entry_id": "scene_5_escalating_e001"
        }
      ],
      "end": null
    },
    "scene_5_escalating_e004": {
      "entry_id": "scene_5_escalating_e004",
      "content": "The cabin walls have a pulse, a subtle, organic undulation that's almost imperceptible at first. The metal seems to breathe, expanding and contracting in slow motion. The light catches the curves in odd ways, distorting your perception. It's not a steady rhythm, more like a hiccup, a shudder, a sign of something deeply wrong.",
      "choices": [
        {
          "content": "Reach out and touch the cabin wall to see if it really is shifting.",
          "entry_id": "scene_5_escalating_e008"
        },
        {
          "content": "Observe my seatmate to see if they react to the shifting walls, or notice the strange pulsing.",
          "entry_id": "scene_5_escalating_e006"
        },
        {
          "content": "Explore further into the plane.",
          "entry_id": "scene_6_expanding_e600"
        }
      ],
      "end": null
    },
    "scene_5_escalating_e006": {
      "entry_id": "scene_5_escalating_e006",
      "content": "You turn your attention fully to your seatmate. He's a statue, a grey-suited monument to indifference. His eyes are locked straight ahead, unblinking, his expression blank. He hasn't acknowledged you, the announcement, or the world outside. He's like a prop, an extra in a play that's gone off the rails.",
      "choices": [
        {
          "content": "Speak to my seatmate directly, asking if they see anything strange.",
          "entry_id": "scene_7_passenger_e701"
        }
      ],
      "end": null
    },
    "scene_7_passenger_e701": {
      "entry_id": "scene_7_passenger_e701",
      "content": "You notice a passenger a few rows ahead, in seat 7A. He's trying to look nonchalant, but his leg is bouncing, and his eyes dart around nervously. His expensive suit is slightly rumpled, as if he's been sleeping in it. He catches your eye for a split second, then quickly looks away, a flicker of recognition (or is it complicity?) in his gaze.",
      "choices": [
        {
          "content": "Engage with the passenger directly, ask if they are experiencing anything strange.",
          "entry_id": "scene_7_passenger_e702"
        },
        {
          "content": "Observe the passenger discreetly, trying to gauge their reaction to the unsettling atmosphere.",
          "entry_id": "scene_7_passenger_e703"
        }
      ],
      "end": null
    },
    "scene_2_unease_e008": {
      "entry_id": "scene_2_unease_e008",
      "content": "The plane rattles. It feels like something important is breaking down. The seatbelt announcement is almost constant now, a broken record in the sky. My skin prickles, and I need to move, *do* something. This can't be right.",
      "choices": [
        {
          "content": "Go to the lavatory. Maybe the familiar smallness of the space will calm me.",
          "entry_id": "scene_3_bathroom_e301"
        },
        {
          "content": "Call a flight attendant. Surely they'll have an explanation, even if it's a bad one.",
          "entry_id": "scene_4_crew_e401"
        },
        {
          "content": "Try to close my eyes and sleep. Wishful thinking, but maybe unconsciousness is better than this.",
          "entry_id": "scene_5_escalating_e001"
        }
      ],
      "end": null
    },
    "scene_4_crew_e403": {
      "entry_id": "scene_4_crew_e403",
      "content": "Sam, the flight attendant with the unsettling smile, glides over, their movements a little too smooth, a little too practiced. Their name tag gleams: 'Sam'. 'Is everything to your liking?' they ask, their voice soft, yet somehow amplified in my ears. The question feels loaded, like a test. I decide to voice my unease, describing the glitches, the lengthening aisle, the wrongness of the clouds. Sam listens, their smile never faltering, a disturbing stillness in their gaze, a predatory calm.",
      "choices": [
        {
          "content": "Ask what's really happening on this flight, pressing them for honesty.",
          "entry_id": "scene_4_crew_e406"
        },
        {
          "content": "Say nothing further and just return to my seat, unnerved by their strange calmness. Pretend this never happened.",
          "entry_id": "scene_4_crew_e405"
        }
      ],
      "end": null
    },
    "scene_4_crew_e406": {
      "entry_id": "scene_4_crew_e406",
      "content": "I feel like I'm being drawn towards the heart of the problem. Call it a hunch, call it panic, call it morbid curiosity \">– whatever it is, I can't ignore it. Every distortion, every glitch, is a breadcrumb, and I have to follow the trail, no matter how absurd it gets.",
      "choices": [
        {
          "content": "Yield to the compulsion and begin exploring.",
          "entry_id": "scene_6_expanding_e600"
        }
      ],
      "end": null
    },
    "scene_6_expanding_e602": {
      "entry_id": "scene_6_expanding_e602",
      "content": "I step into the room, the doorway swallowing me. It's vaguely like a waiting room, but everything is subtly wrong. The proportions are off \n\nThe furniture is oddly placed, bolted down, and slightly too large, like a set built for giants. The air is still and heavy, like a humid summer afternoon before a storm. A dull ache starts behind my eyes.",
      "choices": [
        {
          "content": "Examine the contents of the room more closely. Maybe there's something here that makes sense of this.",
          "entry_id": "scene_6_expanding_e606"
        },
        {
          "content": "Leave the room, returning to the corridor.",
          "entry_id": "scene_6_expanding_e601"
        }
      ],
      "end": null
    },
    "scene_6_expanding_e606": {
      "entry_id": "scene_6_expanding_e606",
      "content": "I examine the waiting room more closely. There are no windows, just blank, pale walls. The only furniture is a row of oversized, bolted-down chairs and a coffee table with nothing on it. There's a faint, almost imperceptible hum in the air, like the electricity is struggling to keep up. The room feels symbolically significant, like a stage set for a play I don't understand, but its meaning is elusive, just beyond my grasp. A feeling of dread washes over me.",
      "choices": [
        {
          "content": "Look for anything in the room that might offer a clue about what is happening. It's time to confront the source of this riddle.",
          "entry_id": "scene_9_confrontation_e901"
        },
        {
          "content": "Take a moment to rest in the strangely proportioned room, trying to collect my thoughts. Maybe a moment of clarity will strike.",
          "entry_id": "scene_6_expanding_e602"
        }
      ],
      "end": null
    },
    "scene_3_bathroom_e304": {
      "entry_id": "scene_3_bathroom_e304",
      "content": "The sounds from the cabin are muted and warped, as if filtered through thick cotton. The familiar drone of the engines has become a low, resonant hum. It feels like the plane has grown around me, creating an echoing distance where there should be none. I still feel like something is watching me from beyond the mirror.",
      "choices": [
        {
          "content": "Enter the lavatory.",
          "entry_id": "scene_3_bathroom_e305"
        },
        {
          "content": "Concentrate on the lavatory.",
          "entry_id": "scene_3_bathroom_e306"
        }
      ],
      "end": null
    },
    "scene_6_expanding_e603": {
      "entry_id": "scene_6_expanding_e603",
      "content": "I attempt to return to my seat, 22A, but it's gone. The neat rows of seats have become a jumbled mess, the seat numbers changing randomly as I walk. I pass a 21C, then a 24B, then another 21C. The carpet pattern seems to swirl and shift under my feet. It feels less like a plane, more like a fever dream. The feeling of being utterly lost is overwhelming.",
      "choices": [
        {
          "content": "Ignore the layout and press on, looking for the familiar fabric of 22A.",
          "entry_id": "scene_6_expanding_e609"
        },
        {
          "content": "Give up looking and head towards the cockpit.",
          "entry_id": "scene_9_confrontation_e901"
        }
      ],
      "end": null
    },
    "scene_6_expanding_e609": {
      "entry_id": "scene_6_expanding_e609",
      "content": "I push on, determined to find my seat, but the plane seems to be actively working against me. Corridors twist into Escher-like impossibilities. A row of seats suddenly becomes a staircase. 22A is a phantom, a memory fading with each step. The air hums with a malevolent energy.",
      "choices": [
        {
          "content": "Accept defeat and change my course for the cockpit.",
          "entry_id": "scene_9_confrontation_e901"
        },
        {
          "content": "Refuse to give up and keep searching for seat 22A.",
          "entry_id": "scene_6_expanding_e603"
        }
      ],
      "end": null
    },
    "scene_9_confrontation_e901": {
      "entry_id": "scene_9_confrontation_e901",
      "content": "I'm committed now. I have to confront whatever is causing this. It feels like the moment of truth has arrived. I just hope I'm ready.",
      "choices": [
        {
          "content": "Go directly to the cockpit, convinced the pilots are behind this.",
          "entry_id": "scene_9_confrontation_e902"
        },
        {
          "content": "Think about what the plane is, and what it means.",
          "entry_id": "scene_9_confrontation_e904"
        }
      ],
      "end": null
    },
    "scene_9_confrontation_e902": {
      "entry_id": "scene_9_confrontation_e902",
      "content": "I battle against the uncooperative geometry of the aisle, heading towards the cockpit door. The air crackles with static, and the repeating announcement has sped up, a frantic mantra: \"...ensure your seatbelt is correctly fastenedensure your seatbelt is correctly fastenedensure...\" My stomach churns.",
      "choices": [
        {
          "content": "Keep pushing towards the cockpit, no matter what.",
          "entry_id": "scene_9_confrontation_e903"
        },
        {
          "content": "Ditch the cockpit and try escaping through a distorted panel.",
          "entry_id": "scene_9_confrontation_e908"
        }
      ],
      "end": null
    },
    "scene_3_bathroom_e306": {
      "entry_id": "scene_3_bathroom_e306",
      "content": "Even if I try to dismiss what I've seen, the unsettling feeling in the lavatory persists. The dimensions feel wrong, the sounds are distorted, and the sense of being watched is palpable. I can't shake the feeling that something is deeply amiss with this space. Despite my attempts to focus on specific details or ignore the strangeness, the overall anomaly is impossible to deny. What do I do next?",
      "choices": [
        {
          "content": "Take another look in the mirror.",
          "entry_id": "scene_3_bathroom_e302"
        },
        {
          "content": "Run my hands along the walls again, hoping to find something I missed, and examine them more closely.",
          "entry_id": "scene_3_bathroom_e303"
        },
        {
          "content": "Enough of this. Head back to my seat and see what's happening in the cabin.",
          "entry_id": "scene_5_escalating_e001"
        }
      ],
      "end": null
    },
    "scene_4_crew_e404": {
      "entry_id": "scene_4_crew_e404",
      "content": "Michael, the unaware flight attendant, arrives, his brow furrowed with genuine concern. \"Yes, how can I help?\" he asks, his eyes scanning me for signs of distress. I start to explain about the repeating announcement, the way the aisle seems to be getting longer. Michael nods, his expression earnest, but as I describe the flat, painted look of the sky outside the window, his brow furrows further. He glances around the cabin, a puzzled look on his face. \"I'm not sure I follow,\" he says, finally, \"Everything seems normal to me.\"",
      "choices": [
        {
          "content": "Insist that they look out of the window, describing the repeating cloud patterns in detail.",
          "entry_id": "scene_4_crew_e405"
        },
        {
          "content": "Let it go and apologise, saying maybe you were just being silly. Blame it on the altitude.",
          "entry_id": "scene_4_crew_e405"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e802": {
      "entry_id": "scene_8_distorted_e802",
      "content": "The fabric of seat 22A ripples, the familiar blue morphing into the floral pattern of my grandmother's old couch. It's unsettlingly vivid. Then, it shifts again, this time becoming rough and scratchy, like burlap. The in-flight magazine is still there, but the cover now features a shadowy figure that resembles me, but with eyes that glow unnaturally. My personal space is definitely not feeling so personal anymore.",
      "choices": [
        {
          "content": "Open the magazine and flick through, see what horrors await within.",
          "entry_id": "scene_8_distorted_e808"
        },
        {
          "content": "Run my hand over the morphing fabric of the seat, see what it feels like.",
          "entry_id": "scene_8_distorted_e809"
        },
        {
          "content": "Ignore the seat and turn to the man in the grey suit in 22B, he's been quiet too long.",
          "entry_id": "scene_8_distorted_e810"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e808": {
      "entry_id": "scene_8_distorted_e808",
      "content": "I open the magazine. The cover image of 'me' leers, its distorted eyes seeming to follow my every move. Inside, the articles are all about my failures: a missed opportunity at work, a long-forgotten argument with a friend, each one exaggerated and twisted to maximise the sting. One page shows a photograph of my childhood home, but the windows are all black, and the door is slightly ajar as if waiting for me. It's unbearable.",
      "choices": [
        {
          "content": "Tear the magazine into tiny pieces, scatter it across the aisle in defiance.",
          "entry_id": "scene_8_distorted_e817"
        },
        {
          "content": "Persist with reading it, try to understand it.",
          "entry_id": "scene_8_distorted_e816"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e817": {
      "entry_id": "scene_8_distorted_e817",
      "content": "I rip the magazine to shreds, the glossy paper tearing easily in my hands. As the pieces flutter to the floor, the plane lurches violently. The lights flicker ominously, plunging the cabin into near darkness. When they flicker back on, the repeating announcement blares: \"...there is no escape...there is no escape...there is no escape...\" It feels like the plane is actively fighting me now. But the sound of the announcement feels different now, and as I try to work out where it's coming from, I get the distinct impression that it's daring me to find it.",
      "choices": [
        {
          "content": "Hunt down the source of the announcement and end this torment.",
          "entry_id": "scene_9_confrontation_e901"
        }
      ],
      "end": null
    },
    "scene_9_confrontation_e904": {
      "entry_id": "scene_9_confrontation_e904",
      "content": "Instead of fighting, I try to understand. Maybe this isn't about escaping, but about accepting... something. Is this plane a prison, or a reflection? Do I argue with the architecture, or attempt to decode its intentions?",
      "choices": [
        {
          "content": "Start talking to the plane, out loud, like it's a person... thing... whatever.",
          "entry_id": "scene_9_confrontation_e906"
        },
        {
          "content": "Close my eyes, go internal, and try to understand what this plane means to *me*.",
          "entry_id": "scene_9_confrontation_e907"
        }
      ],
      "end": null
    },
    "scene_5_escalating_e008": {
      "entry_id": "scene_5_escalating_e008",
      "content": "The spot I touched feels strangely organic, like warm skin stretched over a metal frame. The breathing intensifies, the wall subtly throbbing beneath my fingertips. I press harder, and the metal yields slightly, like pushing into putty. A wave of nausea washes over me, a primal revulsion at the merging of flesh and machine. The plane's impossible nature is undeniable. Whether the walls are breathing, the aisle stretching, or the clouds repeating, reality is breaking down, and the plane is transforming into something alien.",
      "choices": [
        {
          "content": "Focus inwards, succumbing to the impossible environment.",
          "entry_id": "scene_8_distorted_e801"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e803": {
      "entry_id": "scene_8_distorted_e803",
      "content": "I step into the aisle. It now feels like wading through treacle. Each step forward meets resistance, the carpet a shifting morass of blues and greys. The passengers, if that's what they are, have become elongated figures, their faces stretched into grotesque masks. The gentle hum has turned into a guttural groan, emanating not from the plane, but from something within it. The air shimmers with heat, distorting the light and blurring the edges of reality. With each step, the plane seems to mock my attempt to traverse it.",
      "choices": [
        {
          "content": "Attempt to force the aisle back to normal, focusing your will on a single point ahead.",
          "entry_id": "scene_8_distorted_e811"
        },
        {
          "content": "Continue walking further down the impossibly long aisle, seeking to reach the end.",
          "entry_id": "scene_8_distorted_e812"
        },
        {
          "content": "Focus on the details of the carpet, trying to understand the logic of its shifting pattern.",
          "entry_id": "scene_8_distorted_e813"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e811": {
      "entry_id": "scene_8_distorted_e811",
      "content": "I grit my teeth and focus, trying to compress the aisle back to its original dimensions. The carpet writhes under my gaze, the patterns morphing into disturbing faces. The overhead lights flicker violently, casting long, distorted shadows. The air crackles with energy, and I feel a sharp pain in my temples. The aisle seems to actively resist my will, growing longer and more twisted with each passing moment. The more I focus, the more violently it resists.",
      "choices": [
        {
          "content": "Increase my effort.",
          "entry_id": "scene_8_distorted_e817"
        },
        {
          "content": "Relinquish my effort, letting the aisle distort.",
          "entry_id": "scene_8_distorted_e815"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e815": {
      "entry_id": "scene_8_distorted_e815",
      "content": "The air hangs thick and still. My seatmate is gone. Vanished. The window is no longer a portal to the sky, but a murky mirror reflecting a distorted version of myself. Even the 'Sky High' magazine has disappeared from the pouch in front. The overhead bin isn't filled with luggage, but with bundles of wires and blinking lights. There is nothing I recognise any more.",
      "choices": [
        {
          "content": "Try to find another passenger to confirm what I see.",
          "entry_id": "scene_8_distorted_e817"
        },
        {
          "content": "Accept the changing reality.",
          "entry_id": "scene_8_distorted_e816"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e816": {
      "entry_id": "scene_8_distorted_e816",
      "content": "As I accept the distortions, the noise seems to fade, and patterns begin to appear in the chaos. The seat fabric now displays an intricate mosaic, each tile a fragment of memory. The vortex outside the window is not random, but a carefully constructed story. Even the overhead bin feels less threatening, like a puzzle box waiting to be opened. By accepting the unreality, I am beginning to understand its underlying logic.",
      "choices": [
        {
          "content": "Embrace the revelation and stand at the edge of understanding.",
          "entry_id": "scene_10_revelation_e1001"
        }
      ],
      "end": null
    },
    "scene_6_expanding_e604": {
      "entry_id": "scene_6_expanding_e604",
      "content": "I approach one of the unmarked doors. It's a plain, metal door, much like the lavatory door, but without a handle, just a slight indent to pull it open. Embossed on the surface are a series of interlocking triangles, like a simplified circuit diagram. A faint vibration emanates from the door, almost imperceptible. I feel a pull, as if the space behind it is eager to consume me.",
      "choices": [
        {
          "content": "Open the door and step through, succumbing to the impossible environment.",
          "entry_id": "scene_8_distorted_e801"
        },
        {
          "content": "Decide against opening the door and return to the corridor.",
          "entry_id": "scene_6_expanding_e601"
        }
      ],
      "end": null
    },
    "scene_6_expanding_e605": {
      "entry_id": "scene_6_expanding_e605",
      "content": "I continue down the seemingly infinite corridor, the humming growing louder, resonating in my teeth. The air shimmers, like heat rising off asphalt. It\ndoesn\\'t feel like a physical place. The plane feels like it\\'s responding to something internal, as if the very structure is listening.",
      "choices": [
        {
          "content": "Focus intently on the feeling of wrongness in the space, trying to understand it. Wrestle with the mystery.",
          "entry_id": "scene_6_expanding_e607"
        },
        {
          "content": "Try one of the doors, hoping it might lead somewhere.",
          "entry_id": "scene_6_expanding_e604"
        }
      ],
      "end": null
    },
    "scene_6_expanding_e607": {
      "entry_id": "scene_6_expanding_e607",
      "content": "I focus on the feeling of spatial distortion. The plane seems to be reacting to my perception, almost molding itself to my expectations of impossible space. The sense of dreamlike unreality intensifies, blurring the line between inside and outside, real and imagined. I feel myself becoming part of the plane, and it becoming part of me.",
      "choices": [
        {
          "content": "Let go of trying to understand and simply embrace the impossible nature of the plane. Surrender to the madness.",
          "entry_id": "scene_8_distorted_e801"
        },
        {
          "content": "Continue down the seemingly infinite corridor.",
          "entry_id": "scene_6_expanding_e605"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e804": {
      "entry_id": "scene_8_distorted_e804",
      "content": "I close my eyes, seeking refuge within myself. But the darkness is no escape. Fragmented memories flash: a childhood home with impossible geometry, faces of loved ones with shifting features, echoes of past conversations that now loop and distort. I can hear a faint, childlike melody, the melody of 'Twinkle Twinkle Little Star', but played on a detuned piano. It feels as though the plane is invading my thoughts, blurring the line between internal and external.",
      "choices": [
        {
          "content": "Try to impose order on the internal chaos, focusing on a single, calming memory. A pure thought.",
          "entry_id": "scene_8_distorted_e814"
        },
        {
          "content": "Open my eyes and confront the distorted reality, seeking a point of reference. It can't be as bad as *that*.",
          "entry_id": "scene_8_distorted_e815"
        },
        {
          "content": "Succumb to the overwhelming sensory input and let the plane's influence wash over me. I am no longer resisting.",
          "entry_id": "scene_8_distorted_e805"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e814": {
      "entry_id": "scene_8_distorted_e814",
      "content": "I focus on a calming memory - a peaceful day at the beach, the warmth of the sun on my skin, the sound of waves lapping against the shore. But the memory distorts, the sun turning into a malevolent eye, the waves morphing into grasping hands, and the sand becoming a shifting, sucking quagmire. Even my safe memories are no longer safe. It is as if they are bait.",
      "choices": [
        {
          "content": "Fight to hold onto the original memory.",
          "entry_id": "scene_8_distorted_e817"
        },
        {
          "content": "Let go of the memory and embrace the plane's distorted version. I am not strong enough to resist.",
          "entry_id": "scene_8_distorted_e805"
        }
      ],
      "end": null
    },
    "scene_6_expanding_e608": {
      "entry_id": "scene_6_expanding_e608",
      "content": "The idea of finding the cockpit, or some source of answers, has taken root. It seems a ludicrous plan, given the state of the plane, but anything is better than wandering aimlessly. The thought of confronting... something... is also surprisingly appealing.",
      "choices": [
        {
          "content": "I'll brace myself and head to the cockpit.",
          "entry_id": "scene_9_confrontation_e901"
        },
        {
          "content": "I must try to find my seat instead. Maybe something familiar will help me feel more secure.",
          "entry_id": "scene_6_expanding_e603"
        }
      ],
      "end": null
    },
    "scene_7_passenger_e702": {
      "entry_id": "scene_7_passenger_e702",
      "content": "I approach the passenger in 7A. As I draw level, he gives me a knowing look, a slight smile playing on his lips. \"You've noticed it too, haven't you?\" he says, his voice low and conspiratorial. \"This isn't a normal flight, is it? But don't worry,\" he continues, \"I think I understand what's happening, and perhaps how to... navigate it.\" He's far too calm for someone on a plane that's breaking the laws of physics, and it sets my teeth on edge.",
      "choices": [
        {
          "content": "Follow this man's lead and see what he suggests.",
          "entry_id": "scene_8_distorted_e801"
        },
        {
          "content": "He's a bit too happy about all this... I'll probe him a bit more first.",
          "entry_id": "scene_7_passenger_e704"
        }
      ],
      "end": null
    },
    "scene_7_passenger_e704": {
      "entry_id": "scene_7_passenger_e704",
      "content": "I express my unease. \"Navigate it?\" I ask, my voice barely a whisper. \"What do you mean?\" He chuckles softly, a sound that doesn't reach his eyes. \"Oh, there are ways,\" he replies, leaning closer. \"Ways to... adapt. To make the most of this... unique situation. Come with me, I have an idea.\" The implied promise of 'making the most of it', whatever 'it' is, makes my stomach churn.",
      "choices": [
        {
          "content": "Play along with this weirdo and see where he goes.",
          "entry_id": "scene_8_distorted_e801"
        },
        {
          "content": "Trust my gut, politely decline and walk away.",
          "entry_id": "scene_7_passenger_e706"
        }
      ],
      "end": null
    },
    "scene_7_passenger_e706": {
      "entry_id": "scene_7_passenger_e706",
      "content": "I move further down the aisle, away from the too-calm passenger in 7A. Each row seems to stretch on forever, and a deeper sense of unease settles in as I'm left alone with my spiralling thoughts and the undeniable strangeness of the plane. The temperature seems to drop with every step.",
      "choices": [
        {
          "content": "Embrace the strangeness and give in.",
          "entry_id": "scene_8_distorted_e801"
        },
        {
          "content": "Try to ignore everything and head back to my seat.",
          "entry_id": "scene_5_escalating_e001"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e810": {
      "entry_id": "scene_8_distorted_e810",
      "content": "The passenger next to me remains a statue, his eyes still fixed forward. But now I notice his reflection in the window. It shows him twisted in a grotesque pose, a silent scream etched across his face. The reflection flickers, becoming more monstrous with each passing second. Is he looking at me, or is the reflection? An in-flight magazine lies discarded in my lap.",
      "choices": [
        {
          "content": "Rip up the magazine.",
          "entry_id": "scene_8_distorted_e817"
        },
        {
          "content": "Succumb to the disturbing reflection and allow it to overwhelm me.",
          "entry_id": "scene_8_distorted_e805"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e805": {
      "entry_id": "scene_8_distorted_e805",
      "content": "Despair washes over me. The impossible plane, these personalized distortions, the utter unreality – it's all too much. I sink into my seat, overwhelmed by hopelessness. I close my eyes, no longer resisting, no longer caring. The plane has won. Reality dissolves completely, leaving only a void.",
      "choices": [],
      "end": "lose"
    },
    "scene_7_passenger_e703": {
      "entry_id": "scene_7_passenger_e703",
      "content": "You decide to observe another passenger. She's in seat 7B, a young woman clutching a worn teddy bear. She's visibly trembling, her eyes wide with fear, darting around the cabin. Suddenly, she notices you looking at her and her eyes lock onto yours, filled with raw panic. \"You see it too, right?\" she whispers, her voice choked with terror. \"It's... it's not normal, is it? Please, tell me I'm not going crazy.\"",
      "choices": [
        {
          "content": "Reassure the passenger.",
          "entry_id": "scene_5_escalating_e001"
        },
        {
          "content": "Maintain a cautious distance but speak to them, asking if they are alright.",
          "entry_id": "scene_7_passenger_e705"
        }
      ],
      "end": null
    },
    "scene_7_passenger_e705": {
      "entry_id": "scene_7_passenger_e705",
      "content": "You approach the terrified passenger in 7B more cautiously. As you get closer, she reaches out and grabs your arm with surprising strength. \"Please,\" she pleads, tears welling in her eyes, \"it's getting worse.  The plane... it's changing. I can feel it. We have to do something!\" Her raw fear and desperate plea solidify the horrifying reality of the situation.",
      "choices": [
        {
          "content": "Stay with the terrified passenger and try to understand what they are experiencing, offering comfort.",
          "entry_id": "scene_5_escalating_e001"
        },
        {
          "content": "Gently pull away, explaining you need to think, but acknowledge you see what they see.",
          "entry_id": "scene_5_escalating_e001"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e809": {
      "entry_id": "scene_8_distorted_e809",
      "content": "As you touch the seat fabric, it shifts and flows like liquid, conforming to my hand, then hardening into an unyielding surface. The texture changes from velvet to sandpaper, from smooth silk to coarse wool. A faint electrical charge runs through my fingertips, leaving a tingling sensation. It feels alien. My hand seems to sink into the seat, as if it no longer knows if it is a solid object.",
      "choices": [
        {
          "content": "Withdraw my hand, disturbed by the unsettling sensation.",
          "entry_id": "scene_8_distorted_e815"
        },
        {
          "content": "Push further into the seat fabric.",
          "entry_id": "scene_8_distorted_e816"
        }
      ],
      "end": null
    },
    "scene_10_revelation_e1001": {
      "entry_id": "scene_10_revelation_e1001",
      "content": "You stand at the edge of understanding, the plane's bizarre reality coalescing into a dreadful, dream-like whole. Do I attempt to pull away the veil?",
      "choices": [
        {
          "content": "Focus on my memories, trying to find a rational explanation for the plane's state.",
          "entry_id": "scene_10_revelation_e1005"
        },
        {
          "content": "Accept the impossible around me, letting the plane carry me to my destination.",
          "entry_id": "scene_10_revelation_e1006"
        },
        {
          "content": "Fight the plane's illusion, trying to force it back to normal with all my will.",
          "entry_id": "scene_10_revelation_e1007"
        }
      ],
      "end": null
    },
    "scene_10_revelation_e1005": {
      "entry_id": "scene_10_revelation_e1005",
      "content": "I delve into the recesses of my mind, recalling fragments of my life, weaving them into a narrative that unravels the plane's mystery. It seems that this isn't a real plane at all, but a twisted representation of my deepest anxieties and unresolved issues. It's a physical manifestation of my inner turmoil.",
      "choices": [
        {
          "content": "Embrace this realization, accepting my flaws and anxieties as part of myself.",
          "entry_id": "scene_10_revelation_e1002"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e812": {
      "entry_id": "scene_8_distorted_e812",
      "content": "I continue walking, the aisle stretching before me like an impossible hallway in a dream. My pace slows, and it becomes like wading through sludge. Glancing to the sides I catch fragments of images that don't make sense: A child's teddy bear, like the one I had when I was a toddler. A distorted image of a birthday party, but the faces are blurred. The temperature wildly fluctuates - a blast of heat like an open oven, then a wave of icy cold. Each step feels like a greater commitment to this bizarre journey.",
      "choices": [
        {
          "content": "Turn back.",
          "entry_id": "scene_8_distorted_e815"
        },
        {
          "content": "Keep going.",
          "entry_id": "scene_8_distorted_e816"
        }
      ],
      "end": null
    },
    "scene_8_distorted_e813": {
      "entry_id": "scene_8_distorted_e813",
      "content": "I stare at the carpet, trying to decipher its swirling patterns. The intertwining blues and greys resolve into crude faces, leering and grotesque. A dampness rises from the fibres, the smell of old pennies and something indefinable, but unpleasant. The texture prickles against my palms. The more I stare, the more the faces seem to move, whispering silent nothings into the weave.",
      "choices": [
        {
          "content": "Close my eyes, breaking free from the carpet's hypnotic pattern.",
          "entry_id": "scene_8_distorted_e815"
        },
        {
          "content": "Accept the carpet's secrets, hoping to understand the plane's distortions.",
          "entry_id": "scene_8_distorted_e816"
        }
      ],
      "end": null
    },
    "scene_10_revelation_e1006": {
      "entry_id": "scene_10_revelation_e1006",
      "content": "With a sigh, I surrender to the strangeness, becoming a passive observer. The plane responds to my apathy, the distortions losing their vivid edge, becoming bland and meaningless. The repeating announcements fade into white noise. The grey suited man next to me is no longer staring, but slumped in his seat, like a discarded mannequin.",
      "choices": [
        {
          "content": "Continue drifting.",
          "entry_id": "scene_10_revelation_e1003"
        }
      ],
      "end": null
    },
    "scene_9_confrontation_e903": {
      "entry_id": "scene_9_confrontation_e903",
      "content": "I reach the cockpit door. It's not quite right – the metal seems stretched, the handle too large. A low, rhythmic hum vibrates through the frame, almost like a heartbeat. The frantic announcement loop intensifies. \"...ensure your seatbelt is correctly fastenedensure your seatbelt is correctly fastenedensure...\" Do I try to force my way in, or admit defeat?",
      "choices": [
        {
          "content": "Force it. Damn the consequences.",
          "entry_id": "scene_9_confrontation_e905"
        },
        {
          "content": "Give up. It's too much.",
          "entry_id": "scene_9_confrontation_e917_lose_accept_fate"
        }
      ],
      "end": null
    },
    "scene_9_confrontation_e905": {
      "entry_id": "scene_9_confrontation_e905",
      "content": "I throw myself against the door, shoulder first. The metal buckles inward with a sickening screech, but the doorframe itself seems to…thicken? It resists, pushing back as if alive. Do I break through, or does this impossible plane win?",
      "choices": [
        {
          "content": "Smash through!",
          "entry_id": "scene_9_confrontation_e913_win_cockpit_success"
        },
        {
          "content": "I'm beaten. It's too strong.",
          "entry_id": "scene_9_confrontation_e914_lose_cockpit_fail"
        }
      ],
      "end": null
    },
    "scene_9_confrontation_e913_win_cockpit_success": {
      "entry_id": "scene_9_confrontation_e913_win_cockpit_success",
      "content": "The door gives way with a final, deafening crack. I stumble into the cockpit, expecting…something. But it's empty. The pilot seats are vacant. The controls are a jumbled mess of wires and sparking components. The windshield shows only a swirling vortex of grey. And on the control panel, etched in crude letters, is a single word: HOME.",
      "choices": [],
      "end": "win"
    },
    "scene_9_confrontation_e906": {
      "entry_id": "scene_9_confrontation_e906",
      "content": "I close my eyes and focus, trying to project my thoughts into the structure of the plane, seeking some kind of understanding or agreement. It's a long shot, I know, but struggling is getting me nowhere. It feels like I'm speaking into a void, but I persist, focusing all my energy on a single question: what do you want?",
      "choices": [
        {
          "content": "Wait, holding my breath, and focus on whatever response the plane might offer.",
          "entry_id": "scene_10_revelation_e1001"
        }
      ],
      "end": null
    },
    "scene_9_confrontation_e907": {
      "entry_id": "scene_9_confrontation_e907",
      "content": "Turning away from external solutions, I delve into my own thoughts and feelings, seeking a key within myself to unlock the plane's mystery. The seatbelt feels tighter, and a faint hum vibrates through the floor. Am I on the verge of a breakthrough, or just going mad?",
      "choices": [
        {
          "content": "Embrace the unsettling introspection, ready to accept whatever truth emerges.",
          "entry_id": "scene_10_revelation_e1001"
        }
      ],
      "end": null
    },
    "scene_9_confrontation_e908": {
      "entry_id": "scene_9_confrontation_e908",
      "content": "I abandon the idea of confronting anything. Understanding is for suckers. Escape is the only thing that matters. I scan the warped metal of the fuselage, searching for a weakness, a tear in the fabric of this nightmare. The whole plane groans around me. Do I really think I can just rip a hole in a plane?",
      "choices": [
        {
          "content": "Rip open the fuselage and jump. Reality has to be better than this.",
          "entry_id": "scene_9_confrontation_e915_win_escape_success"
        },
        {
          "content": "Give up. It's impossible. I'm trapped.",
          "entry_id": "scene_9_confrontation_e916_lose_escape_fail"
        }
      ],
      "end": null
    },
    "scene_9_confrontation_e914_lose_cockpit_fail": {
      "entry_id": "scene_9_confrontation_e914_lose_cockpit_fail",
      "content": "The door holds. My shoulder throbs, a dull ache spreading down my arm. The metal of the cockpit door seems to ripple, like water disturbed by a stone. The frantic announcement is almost deafening now, a distorted scream inside my head. \"...ensure your seatbelt is correctly fastenedensure your seatbelt is correctly fastenedensure...\" I stagger back, defeated. The plane has won, it seems.",
      "choices": [],
      "end": "lose"
    },
    "scene_9_confrontation_e915_win_escape_success": {
      "entry_id": "scene_9_confrontation_e915_win_escape_success",
      "content": "I heave against the warped metal of the fuselage, adrenaline coursing through me. It buckles and groans, protesting against my clumsy assault. With a final, desperate heave, a section of the wall tears away, revealing a blinding rush of wind and light. The drop looks terrifying, but anything is better than staying here. I close my eyes and jump.",
      "choices": [],
      "end": "win"
    },
    "scene_9_confrontation_e916_lose_escape_fail": {
      "entry_id": "scene_9_confrontation_e916_lose_escape_fail",
      "content": "I can't do it. I'm surrounded by metal, twisted and alien, but still metal. There's no way out. The plane has won. I sink to the floor, the swirling carpet a nauseating vortex beneath me. The repeating announcement fades into a dull, unbearable drone. I close my eyes and wait.",
      "choices": [],
      "end": "lose"
    },
    "scene_9_confrontation_e917_lose_accept_fate": {
      "entry_id": "scene_9_confrontation_e917_lose_accept_fate",
      "content": "I can't do it. The humming, the warped metal, the endless, frantic safety message... it's broken me. I sink to the floor, the shifting carpet feeling strangely soft against my cheek. What's the point? This isn't a plane. It's something else. Something I can't fight. I close my eyes and wait.",
      "choices": [],
      "end": "lose"
    },
    "scene_10_revelation_e1007": {
      "entry_id": "scene_10_revelation_e1007",
      "content": "My defiance is like fuel to the fire. The plane is fighting back, and it knows my weaknesses. The walls are no longer walls, but fleshy membranes throbbing with some unseen life. The seats contort into mocking effigies, each one a distorted reminder of my failures. The air smells like ozone and regret. Each act of resistance only tightens its grip.",
      "choices": [
        {
          "content": "Fight on, damn it all.",
          "entry_id": "scene_10_revelation_e1004"
        }
      ],
      "end": null
    },
    "scene_10_revelation_e1002": {
      "entry_id": "scene_10_revelation_e1002",
      "content": "The plane dissolves, not with a bang, but a gentle sigh. The floral patterns of the seat fade, the glares of the magazine soften, the unsettling murmurs recede. It’s not an external force releasing me, but an internal shift. The anxieties that fueled this impossible flight are acknowledged, their power diminished. There's no sudden jolt, no dramatic awakening, just a quiet sense of return. Not to a specific place or time, but to a state of equilibrium. The plane was not a prison, but a mirror.",
      "choices": [],
      "end": "win"
    },
    "scene_10_revelation_e1004": {
      "entry_id": "scene_10_revelation_e1004",
      "content": "The plane groans, a sound like tortured metal, and I feel it changing around me. My futile struggles only seem to accelerate the process. The once-familiar cabin dissolves into a swirling vortex of colours and shapes, each one a fragment of my past, my regrets, my fears. I am being pulled apart, not physically, but something much worse. The plane is no longer just a space, but a reflection of my own fractured self, and it's consuming me whole.",
      "choices": [],
      "end": "lose"
    },
    "scene_4_crew_e401": {
      "entry_id": "scene_4_crew_e401",
      "content": "I raise my hand and manage to flag down a flight attendant. She approaches, her smile smooth and practiced, the kind you see in airline commercials. \"Can I help you with something?\" she asks, her voice a touch too bright. I hesitate, suddenly feeling foolish. But the flickering lights, the endless announcement… it's all too much. I decide to press on and hope for a reasonable answer.",
      "choices": [
        {
          "content": "Hope Brenda the dismissive attendant can help.",
          "entry_id": "scene_4_crew_e402"
        },
        {
          "content": "Hope Sam the creepy attendant can help.",
          "entry_id": "scene_4_crew_e403"
        },
        {
          "content": "Hope Michael the unaware attendant can help.",
          "entry_id": "scene_4_crew_e404"
        }
      ],
      "end": null
    },
    "scene_10_revelation_e1003": {
      "entry_id": "scene_10_revelation_e1003",
      "content": "The aircraft hums, a dull drone that vibrates through my seat. I’ve been drifting for what feels like hours, the initial shock of the distortions fading into a dull acceptance. The window shows an endless expanse of grey, neither sky nor cloud, just an infinite nothing. The man in the grey suit is still slumped beside me, his tie now completely undone, his face hidden in shadow. He looks like he's given up even more than me.",
      "choices": [],
      "end": "lose"
    }
  },
  "title": "Flying Home",
  "description": "A flight home takes a bizarre turn when impossible spaces are discovered in the airplane's toilet.",
  "date": "2025-02-26",
  "order": 999,
  "tags": [
    "gemini/gemini-2.0-flash",
    "mystery",
    "airplane"
  ],
  "layout": "layouts/game.njk",
  "prompt": "N/A"
}