{
  "notes": "",
  "start_entry_id": "bristol_apartment_b001",
  "entries": {
    "bristol_apartment_b001": {
      "entry_id": "bristol_apartment_b001",
      "content": "The cramped confines of your Bristol apartment feel more like a cage these days. Overdue bills are scattered across your desk, a testament to your failing freelance graphic design career. Half-finished projects mock you from the screen of your aging laptop, each one a reminder of your creative block and mounting debt. The silence of the room is broken by the shrill ring of your mobile. Your mother. \n\nEleanor's calls are never truly 'casual'. There's always an underlying current of expectation, a subtle pressure to conform to her idea of how your life should be. You haven't been back to Oakhaven, your childhood home in Lower Slaughter, for far too long, and she never lets you forget it. A knot of anxiety tightens in your stomach. What does she want this time? A request? An instruction? Another guilt trip?\n\nThe phone continues to ring, the sound grating on your nerves. Each ring is a reminder of the mounting pressure you are under. A life you can't seem to get a grip on.",
      "choices": [
        {
          "content": "Answer the phone, steeling yourself for the conversation.",
          "entry_id": "bristol_apartment_b002"
        },
        {
          "content": "Ignore the call and let it go to voicemail.",
          "entry_id": "bristol_apartment_b005"
        }
      ],
      "end": null
    },
    "bristol_apartment_b002": {
      "entry_id": "bristol_apartment_b002",
      "content": "You answer the phone, forcing a cheerful tone that doesn't quite reach your ears. \"Hi, Mum. What's up?\" Eleanor's voice sounds tight, almost brittle. She makes small talk about the garden, the unseasonal rain, anything but the real reason for her call, which you sense is coming. Eventually, after a drawn-out silence, she suggests you come for a visit. A wave of weariness washes over you, but beneath it, you detect a note of something akin to desperation in her voice. You can't quite place it, but it makes you pause.",
      "choices": [
        {
          "content": "Politely decline, explaining that work is too busy right now.",
          "entry_id": "bristol_apartment_b003"
        },
        {
          "content": "Reluctantly agree to visit Oakhaven, sensing this might be important.",
          "entry_id": "bristol_apartment_b004"
        }
      ],
      "end": null
    },
    "bristol_apartment_b004": {
      "entry_id": "bristol_apartment_b004",
      "content": "Against your better judgement, and despite the mountain of work piling up around you, you agree to visit. Eleanor sounds instantly relieved, a little too relieved. She promises a home-cooked meal, your favourites, and 'a chance to relax'. You end the call, feeling a familiar mix of obligation and a dull, sinking dread. Eleanor's face falls slightly at your evasiveness. She seems genuinely saddened by the hints of your struggles that have slipped through your carefully constructed façade. She offers unsolicited advice about finding a 'stable job' and expresses thinly veiled concern about your 'lifestyle choices'. Her anxiety radiates from her, a palpable force in the small hallway. You begin packing a bag, trying to shake off the feeling that you're walking into something you won't like.",
      "choices": [
        {
          "content": "Pack a bag, resigning yourself to the trip to Oakhaven, despite Eleanor's thinly veiled concerns.",
          "entry_id": "oakhaven_arrival_e000"
        }
      ],
      "end": null
    },
    "oakhaven_arrival_e000": {
      "entry_id": "oakhaven_arrival_e000",
      "content": "You arrive at Oakhaven. The house looms larger than you remember, its honey-colored stone radiating a deceptive warmth. Your parents greet you at the door, Eleanor with a flurry of hugs and questions, Arthur with a reserved nod and a fleeting, almost sad, smile. The air is thick with unspoken words. The house feels both intensely familiar and somehow foreign, the weight of your shared history pressing down on you.",
      "choices": [
        {
          "content": "Engage in polite conversation with your mother, Eleanor, and try to ignore her questions.",
          "entry_id": "oakhaven_arrival_e001"
        },
        {
          "content": "Offer a brief, perfunctory greeting and head straight inside, eager to escape the strained atmosphere.",
          "entry_id": "oakhaven_arrival_e002"
        }
      ],
      "end": null
    },
    "oakhaven_arrival_e001": {
      "entry_id": "oakhaven_arrival_e001",
      "content": "Eleanor fusses over you, her hands fluttering as she asks about your journey. You sense she's trying to gauge the state of your well-being. Her gaze is intense, unwavering, and it makes you uneasy.",
      "choices": [
        {
          "content": "Answer her questions truthfully, despite your growing discomfort, hinting at your recent struggles.",
          "entry_id": "oakhaven_arrival_e003"
        },
        {
          "content": "Give vague, non-committal answers and try to change the subject, steering the conversation away from your personal life and towards the garden.",
          "entry_id": "oakhaven_arrival_e005"
        }
      ],
      "end": null
    },
    "oakhaven_arrival_e003": {
      "entry_id": "oakhaven_arrival_e003",
      "content": "Eleanor's face falls slightly at your evasiveness. She seems genuinely saddened by the hints of your struggles that have slipped through your carefully constructed façade. She offers unsolicited advice about finding a 'stable job' and expresses thinly veiled concern about your 'lifestyle choices'. Her anxiety radiates from her, a palpable force in the small hallway.",
      "choices": [
        {
          "content": "Politely thank her for her concern, but insist that you're fine, despite the evident truth.",
          "entry_id": "oakhaven_arrival_e001"
        },
        {
          "content": "Become defensive and accuse her of being overbearing, the familiar pattern of your relationship reasserting itself.",
          "entry_id": "oakhaven_arrival_e006"
        }
      ],
      "end": null
    },
    "bristol_apartment_b003": {
      "entry_id": "bristol_apartment_b003",
      "content": "You offer a string of well-worn excuses about deadlines and client demands, promising to visit soon, 'when things calm down'. Eleanor sounds deflated, but relents without much of a fight. As you hang up, a sharp pang of guilt mixes with the immediate relief. You know you should make more of an effort, but the thought of Oakhaven and your parents just feels... heavy. Ignoring the call feels easier in the short term.",
      "choices": [
        {
          "content": "Try to bury yourself in work, hoping to ignore the guilt from the unanswered call.",
          "entry_id": "bristol_apartment_b006"
        }
      ],
      "end": null
    },
    "bristol_apartment_b006": {
      "entry_id": "bristol_apartment_b006",
      "content": "You settle back at your desk, attempting to lose yourself in the half-finished logo design that's been haunting you for weeks. But the cursor blinks mockingly on the screen, and your thoughts keep drifting back to your mother's voice, that almost imperceptible tremor you detected. You close your laptop with a sigh, admitting defeat. Focus is impossible. The guilt is winning.",
      "choices": [
        {
          "content": "Stare blankly at the screen, unable to focus on the design work. Perhaps a trip to Oakhaven wouldn't be so awful?",
          "entry_id": "bristol_apartment_b008"
        }
      ],
      "end": null
    },
    "oakhaven_arrival_e002": {
      "entry_id": "oakhaven_arrival_e002",
      "content": "Arthur greets you with a stiff nod, his eyes lingering on something behind you in the garden. He seems far more concerned with the flowerbeds than with your arrival. \"The roses are looking a little worse for wear,\" he remarks, his voice dry.",
      "choices": [
        {
          "content": "Attempt to draw Arthur into a conversation about the state of his roses.",
          "entry_id": "oakhaven_arrival_e008"
        },
        {
          "content": "Excuse yourself politely and head inside to unpack, eager to avoid further conversation.",
          "entry_id": "oakhaven_arrival_e005"
        }
      ],
      "end": null
    },
    "oakhaven_arrival_e008": {
      "entry_id": "oakhaven_arrival_e008",
      "content": "\"Needs must with pruning,\" Arthur continues, oblivious to your lack of interest. He begins to expound on the merits of different rose varieties, his voice taking on a rare animation when discussing his garden.",
      "choices": [
        {
          "content": "Continue discussing the roses with your father.",
          "entry_id": "oakhaven_arrival_e008"
        },
        {
          "content": "Make your excuses and head inside, keen to escape the awkwardness.",
          "entry_id": "oakhaven_arrival_e005"
        }
      ],
      "end": null
    },
    "oakhaven_arrival_e006": {
      "entry_id": "oakhaven_arrival_e006",
      "content": "Eleanor's face crumples. Her eyes glisten, and you realise your defensiveness has genuinely hurt her. The silence stretches, thick with years of unspoken resentments and unresolved conflicts. A wave of guilt washes over you, mingling with the familiar sting of resentment. Why can't she just accept you as you are?",
      "choices": [
        {
          "content": "Apologise for his outburst and try a different approach, attempting to placate her anxiety.",
          "entry_id": "oakhaven_arrival_e003"
        },
        {
          "content": "Double down on his defensiveness, asserting his independence and refusing to be interrogated.",
          "entry_id": "oakhaven_arrival_e009"
        }
      ],
      "end": null
    },
    "oakhaven_arrival_e009": {
      "entry_id": "oakhaven_arrival_e009",
      "content": "Eleanor's face hardens, a flash of annoyance momentarily breaking through her carefully constructed facade of maternal concern. The air crackles with unspoken disapproval. \"Honestly, Elias,\" she begins, but you cut her off, desperate to escape the suffocating atmosphere.",
      "choices": [
        {
          "content": "Escape the conversation, mumbling something about needing to unpack before retreating upstairs.",
          "entry_id": "oakhaven_arrival_e005"
        }
      ],
      "end": null
    },
    "garden_door_discovery_e000": {
      "entry_id": "garden_door_discovery_e000",
      "content": "Wandering further from the house, you push aside a curtain of ivy and stumble upon something unexpected: a small, hidden door in the old stone wall that surrounds the garden. You don't remember ever seeing it before. The wall itself is built of Cotswold stone, but this section is different. Darker. Older. ",
      "choices": [
        {
          "content": "Approach the weathered door in the wall, its presence sparking your curiosity.",
          "entry_id": "garden_door_discovery_e001"
        }
      ],
      "end": null
    },
    "garden_door_discovery_e001": {
      "entry_id": "garden_door_discovery_e001",
      "content": "The door is set deep into the weathered stone wall, almost swallowed by ivy and moss. It's much smaller than a normal door, barely tall enough for a child. The wood is dark oak and seems ancient, and there's no visible handle on this side, or hinges either. The lock is a heavy iron affair, encrusted with rust. It looks like it hasn't been used in decades.",
      "choices": [
        {
          "content": "Try to force the door open, ignoring the potential damage.",
          "entry_id": "garden_door_discovery_e002"
        },
        {
          "content": "Carefully examine the surrounding area, searching for a key or any other clues to the door's purpose.",
          "entry_id": "garden_door_discovery_e003"
        }
      ],
      "end": null
    },
    "garden_door_discovery_e002": {
      "entry_id": "garden_door_discovery_e002",
      "content": "You try the door, pushing against the aged wood, but it's firmly locked, refusing to yield. You can feel the dampness of the wood through your fingertips. The hinges, if they exist, are hidden. You run your fingers along the edges of the doorframe, searching for a hidden latch or release, a secret mechanism, but find nothing. Forcing the door might work, but you hesitate, reluctant to damage something that feels so old, so… significant. A shiver runs down your spine. You can hear the faint buzzing of insects in the overgrown foliage. Something is compelling you. What do you do?",
      "choices": [
        {
          "content": "Consider your options, trying to control your rising sense of anticipation.",
          "entry_id": "garden_door_discovery_e004"
        }
      ],
      "end": null
    },
    "garden_door_discovery_e003": {
      "entry_id": "garden_door_discovery_e003",
      "content": "You search around the base of the door, pulling back the thick, clinging ivy and feeling along the cold stone wall. The rough texture scratches at your fingertips. You find nothing useful – just more moss, loose stones that shift under your touch, and the occasional snail leaving a glistening trail. The air is damp and still. There’s a distinct sense that this door has been hidden, or rather forgotten, for a very long time. The silence presses in, broken only by the distant cooing of a pigeon.",
      "choices": [
        {
          "content": "Step back and consider the possibilities.",
          "entry_id": "garden_door_discovery_e004"
        }
      ],
      "end": null
    },
    "door_investigation_d002": {
      "entry_id": "door_investigation_d002",
      "content": "You commit to researching the history of the house and garden. Time to delve into dusty archives and forgotten records.",
      "choices": [
        {
          "content": "Continue your search into the past, poring over old documents and local archives.",
          "entry_id": "research_path_e000"
        }
      ],
      "end": null
    },
    "research_path_e000": {
      "entry_id": "research_path_e000",
      "content": "You start with the old family documents and local archives, searching for any mention of the door or clues to its past existence. Should you start with family records, the historical society, or the achives of the local paper?",
      "choices": [
        {
          "content": "Start with the architectural plans of Oakhaven, kept in the study.",
          "entry_id": "research_path_e001"
        },
        {
          "content": "Enquire about the history of the area at the local historical society.",
          "entry_id": "research_path_e002"
        },
        {
          "content": "Look for newspaper records of Thomas Ashworth's disappearance.",
          "entry_id": "research_path_e003"
        }
      ],
      "end": null
    },
    "door_investigation_d001": {
      "entry_id": "door_investigation_d001",
      "content": "The best approach, you decide, is a methodical search into the past. Perhaps old family documents, local historical records, or even speaking with people in the village will reveal its secrets. Which path will you choose to unearth the truth?",
      "choices": [
        {
          "content": "Delve into family history and local archives to uncover any information about the door.",
          "entry_id": "door_investigation_d002"
        },
        {
          "content": "Directly confront your parents about the door and their knowledge of it.",
          "entry_id": "door_investigation_d003"
        },
        {
          "content": "Attempt to open the door and see what lies beyond.",
          "entry_id": "door_investigation_d004"
        }
      ],
      "end": null
    },
    "door_investigation_d003": {
      "entry_id": "door_investigation_d003",
      "content": "You decide to directly confront your parents. The thought makes your stomach churn, but you feel this is the only way to get real answers.",
      "choices": [
        {
          "content": "Continue to confront your parents, steeling yourself for their reaction.",
          "entry_id": "parents_confrontation_pc001"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc001": {
      "entry_id": "parents_confrontation_pc001",
      "content": "You find Arthur and Eleanor in the living room. The air crackles with unspoken tension as you decide how to broach the subject of the door.",
      "choices": [
        {
          "content": "Be direct and accusatory: 'What are you hiding from me?'",
          "entry_id": "parents_confrontation_pc002"
        },
        {
          "content": "Approach gently: 'I'm just curious about the door. Do you know anything about it?'",
          "entry_id": "parents_confrontation_pc003"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc002": {
      "entry_id": "parents_confrontation_pc002",
      "content": "Arthur stiffens, Eleanor wrings her hands, her knuckles white. They exchange a quick, nervous glance that you don't miss. \"There's nothing to hide, Elias,\" Arthur says, his voice tight. \"It's just an old door in the garden wall. Part of the original design.\"",
      "choices": [
        {
          "content": "Press harder: 'That's not good enough. What's behind it? What are you not telling me?'",
          "entry_id": "parents_confrontation_pc004"
        },
        {
          "content": "Back down slightly: 'It just seems odd that I don't remember it at all. Surely I would have noticed it as a child?'",
          "entry_id": "parents_confrontation_pc005"
        }
      ],
      "end": null
    },
    "garden_door_discovery_e004": {
      "entry_id": "garden_door_discovery_e004",
      "content": "Standing before the mysterious door, a sense of unease settles over you. The weathered wood and rusted lock seem to guard a secret, a story waiting to be told. A chill wind whistles through the overgrown foliage, whispering through the gaps in the wall. Should you try to force it open? Or should you proceed more cautiously, seeking answers from the past before taking a more drastic approach?",
      "choices": [
        {
          "content": "Research the history of the house and garden.",
          "entry_id": "door_investigation_d001"
        }
      ],
      "end": null
    },
    "door_exploration_d001": {
      "entry_id": "door_exploration_d001",
      "content": "Choosing a more direct approach, you decide that you're going to get through this door one way or another, and need to decide on the method. The wood is cold beneath your fingertips. The rusted lock looks like it may have been untouched for a very long time. You feel an increasing sense of urgency to discover the secrets it protects.",
      "choices": [
        {
          "content": "Search for a key around the garden.",
          "entry_id": "door_exploration_d002"
        },
        {
          "content": "Give up and try to force the door open.",
          "entry_id": "door_exploration_d003"
        }
      ],
      "end": null
    },
    "door_exploration_d002": {
      "entry_id": "door_exploration_d002",
      "content": "You begin to meticulously search the overgrown garden for a key. You check under loose rocks, disturbing families of woodlice. You claw within the thick ivy, the leaves damp and cold against your skin. You feel around the base of the wall, disturbing the roots of the nearby trees. The earth smells rich, but also slightly rotten. You wonder how long this will take.",
      "choices": [
        {
          "content": "Continue searching meticulously.",
          "entry_id": "door_exploration_d004"
        },
        {
          "content": "Give up on the key and try shouldering the door.",
          "entry_id": "door_exploration_d009"
        }
      ],
      "end": null
    },
    "door_exploration_d004": {
      "entry_id": "door_exploration_d004",
      "content": "After what seems like an eternity, your fingers brush against something cold and metallic hidden beneath a clump of ivy. You pull it out - a small, rusty key! It's tarnished with age and feels brittle in your grasp. Could this be the key to unlocking the door's secrets? A wave of anticipation washes over you.",
      "choices": [
        {
          "content": "Try the key in the door.",
          "entry_id": "door_exploration_d007"
        }
      ],
      "end": null
    },
    "door_investigation_d004": {
      "entry_id": "door_investigation_d004",
      "content": "Having decided to try and open the door physically, you steel yourself. The door is small, barely reaching your waist, and the wood is dark and weathered, hinting at untold years of exposure. The lock is a heavy, rusted iron mechanism. You feel a mix of excitement and apprehension as you consider your next move.",
      "choices": [
        {
          "content": "Continue to attempt to open the door.",
          "entry_id": "door_exploration_d001"
        }
      ],
      "end": null
    },
    "door_exploration_d003": {
      "entry_id": "door_exploration_d003",
      "content": "Time for brute force. You prepare to force the door open, assessing the aged wood for a weak point. The lower section looks more rotten than the rest, closer to the damp earth and choked by ivy.",
      "choices": [
        {
          "content": "Try kicking the door.",
          "entry_id": "door_exploration_d005"
        },
        {
          "content": "Try shouldering the door with all your weight.",
          "entry_id": "door_exploration_d009"
        }
      ],
      "end": null
    },
    "door_exploration_d005": {
      "entry_id": "door_exploration_d005",
      "content": "Adrenaline pumping, you kick at the door with all your might. The rotting wood splinters slightly around the edges, but the door itself remains firmly shut. A sharp pain shoots through your foot. You wince, hopping on one leg.",
      "choices": [
        {
          "content": "Take a closer look for a lock or mechanism despite his throbbing foot.",
          "entry_id": "door_exploration_d006"
        }
      ],
      "end": null
    },
    "door_exploration_d006": {
      "entry_id": "door_exploration_d006",
      "content": "Ignoring the throbbing pain in your foot, you examine the door more closely. You notice a small, almost invisible keyhole, cleverly disguised by the weathered wood and moss. The mechanism inside looks old and rusty, but functional. It's a tiny key, almost like something from a child's toy box.",
      "choices": [
        {
          "content": "Search his pockets for anything that might fit.",
          "entry_id": "door_exploration_d008"
        },
        {
          "content": "Return to searching the garden for a key.",
          "entry_id": "door_exploration_d002"
        }
      ],
      "end": null
    },
    "door_exploration_d008": {
      "entry_id": "door_exploration_d008",
      "content": "You rummage through your pockets, finding only a few loose coins, a crumpled receipt from a coffee shop in Bristol, and a packet of painkillers. Nothing remotely resembling a key.",
      "choices": [
        {
          "content": "Resume the search for a key in the garden.",
          "entry_id": "door_exploration_d002"
        },
        {
          "content": "Try forcing the door after all.",
          "entry_id": "door_exploration_d003"
        }
      ],
      "end": null
    },
    "research_path_e001": {
      "entry_id": "research_path_e001",
      "content": "Back in the study, you pore over the architectural plans of Oakhaven, meticulously tracing lines and comparing measurements. The layout of the house is clear, but there's no indication of the mysterious door or anything behind it. However, one plan, much older and faded, shows a well marked in approximately that location. A handwritten note scrawled along the edge states 'decommissioned 1934'. This well appears to have been removed before the house was built.",
      "choices": [
        {
          "content": "Research records of the farmhouse that previously stood on the land.",
          "entry_id": "research_path_e004"
        },
        {
          "content": "Check building permits from the 1930s to see if there is any mention of the well.",
          "entry_id": "research_path_e005"
        }
      ],
      "end": null
    },
    "research_path_e004": {
      "entry_id": "research_path_e004",
      "content": "You manage to find some records of the old farmhouse that once stood where Oakhaven now stands. The documents mention a well that was filled in when the house was built in the 1930s, presumably for safety reasons, although no explicit reason for the infilling is stated. The records are frustratingly vague, offering few details. A hand-drawn sketch shows the approximate location of the well, placing it near a copse of trees at the back of the property.",
      "choices": [
        {
          "content": "Consult old maps for the location of the well.",
          "entry_id": "research_path_e010"
        },
        {
          "content": "Visit Agnes Ashworth, Thomas's mother, and ask if she recalls anything about the land before Oakhaven was built.",
          "entry_id": "research_path_e011"
        }
      ],
      "end": null
    },
    "research_path_e010": {
      "entry_id": "research_path_e010",
      "content": "At the local history society, you discover a series of old Ordinance Survey maps dating back to the early 20th century. After cross-referencing a few of them, you confirm the well's existence. The maps pinpoint its location, placing it precisely where the door stands now, nestled against the old stone wall. A creeping sense of dread begins to take hold. This isn't just a forgotten feature; it's something deliberately concealed.",
      "choices": [
        {
          "content": "Confront Arthur with the maps and demand the truth.",
          "entry_id": "well_truth_reveal_e001"
        },
        {
          "content": "Assume Arthur is lying, and return to the door, determined to find another way in.",
          "entry_id": "research_path_e014"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e001": {
      "entry_id": "well_truth_reveal_e001",
      "content": "The pieces begin to slot into place. You step back and stare at the door, then the surrounding wall, then out to the landscape beyond. The architectural plans of the garden show no sign of any door. The wall runs consistently along the border of the property. Behind the door, hidden from sight, lies an old well. And with it, the potential answer to the disappearance of Thomas and the family’s long-held secret. You understand why the door was built, why it was hidden. The weight of the revelation is immense, crushing you with its implications. Your heart hammers against your ribs, a frantic drumbeat against the silence of the garden.",
      "choices": [
        {
          "content": "Confront your parents immediately, armed with the architectural plans.",
          "entry_id": "well_truth_reveal_e002"
        },
        {
          "content": "Peer into the well, steeling yourself for what you might find.",
          "entry_id": "well_truth_reveal_e003"
        },
        {
          "content": "Try to deny what you've found, dismissing it as a trick of the light and returning to your life in Bristol.",
          "entry_id": "well_truth_reveal_e004"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e002": {
      "entry_id": "well_truth_reveal_e002",
      "content": "Fueled by a mix of anger, grief, and a desperate need for answers, you burst back into the house, the rolled up architectural plans clutched tightly in your hand like evidence. Your parents are in the living room, seemingly oblivious to the turmoil raging within you. Eleanor is knitting, the needles clicking rhythmically, while Arthur is absorbed in the local newspaper. You demand answers, your voice trembling with suppressed emotion, the carefully constructed facade of normalcy shattered.",
      "choices": [
        {
          "content": "Accuse them directly of covering up Thomas's death.",
          "entry_id": "well_truth_reveal_e005"
        },
        {
          "content": "Ask them calmly what they know about the well and the door in the garden wall.",
          "entry_id": "well_truth_reveal_e006"
        }
      ],
      "end": null
    },
    "research_path_e002": {
      "entry_id": "research_path_e002",
      "content": "The historical society volunteers are happy to help. They dredge up some local knowledge, mentioning rumours of an old well on the Thorne property. Apparently, it was deemed unsafe for drinking back in the 1920s due to lead contamination from old pipework.",
      "choices": [
        {
          "content": "Try to find records related to the well's contamination at the local library.",
          "entry_id": "research_path_e006"
        },
        {
          "content": "Brave a direct question to Arthur Thorne about the old well. Surely he will know something.",
          "entry_id": "research_path_e007"
        }
      ],
      "end": null
    },
    "research_path_e006": {
      "entry_id": "research_path_e006",
      "content": "The contamination records at the library are frustratingly sparse. The report states high lead levels rendered the well water undrinkable, but offers no further insights into its location or use. It only serves to confirm its existence, not its significance.",
      "choices": [
        {
          "content": "Return to Arthur Thorne and attempt to press him on the details of the well.",
          "entry_id": "research_path_e007"
        },
        {
          "content": "Reconsider your approach and go back to the door in the garden. Perhaps a different tactic is required.",
          "entry_id": "door_investigation_d001"
        }
      ],
      "end": null
    },
    "research_path_e007": {
      "entry_id": "research_path_e007",
      "content": "You tentatively broach the subject of the well with Arthur. He stiffens, his eyes clouding over. He claims it was filled in long before he and Eleanor moved to Oakhaven. His voice is strained, his hands fidgeting in his lap. He swiftly steers the conversation back to the mundane, clearly unwilling to discuss it further. You feel like you've touched a nerve.",
      "choices": [
        {
          "content": "Try to eavesdrop on a conversation between Arthur and Eleanor, hoping to glean more information about the well.",
          "entry_id": "research_path_e013"
        },
        {
          "content": "Abandon this line of inquiry and return to the garden, deciding to investigate the door more directly.",
          "entry_id": "research_path_e014"
        }
      ],
      "end": null
    },
    "research_path_e013": {
      "entry_id": "research_path_e013",
      "content": "You find Eleanor and Arthur engaged in a hushed, anxious conversation in the living room. You strain to listen. You overhear Eleanor saying, \"It's all coming back, Arthur. The well...\" Arthur replies, his voice low and urgent, \"We did what we had to do. It was for Elias's own good.\"",
      "choices": [
        {
          "content": "Realize that the key to this is not in evasive action but in direct confrontation at the door itself. Return to the door, with a renewed sense of purpose.",
          "entry_id": "research_path_e014"
        },
        {
          "content": "Knowing the well is behind the door and is related to Thomas, throw caution to the wind and burst in on their conversation, demanding an explanation.",
          "entry_id": "well_truth_reveal_e001"
        }
      ],
      "end": null
    },
    "research_path_e014": {
      "entry_id": "research_path_e014",
      "content": "Frustration gnaws at you. The official records are silent on the matter of the door. You stand back in the garden, the weathered wood of the door seeming to mock your efforts. You realise that all this research has brought you back to square one. Paperwork will not reveal the secrets hidden within the walls of Oakhaven. You need to take direct action.",
      "choices": [
        {
          "content": "Driven by a surge of adrenaline, you grab a crowbar from the shed and force the door.",
          "entry_id": "well_truth_reveal_e001"
        }
      ],
      "end": null
    },
    "research_path_e003": {
      "entry_id": "research_path_e003",
      "content": "You sift through the local newspaper archives, finding numerous articles related to Thomas’s disappearance in June 1997. The reports detail the initial search, the community's grief, and the eventual unsolved case status. You also find a few follow-up articles in the years that followed, each revisiting the tragedy. While the coverage is extensive, you find no mention of a hidden door or a well in any of the reports. You remember seeing a small, grainy photo of Thomas in one of the articles, clutching a toy boat.",
      "choices": [
        {
          "content": "Visit the local library and trawl through the old newspaper archives for more details.",
          "entry_id": "research_path_e008"
        },
        {
          "content": "Seek out PC Davies, the now-retired officer who investigated Thomas's disappearance, and see if he remembers anything helpful.",
          "entry_id": "research_path_e009"
        }
      ],
      "end": null
    },
    "research_path_e009": {
      "entry_id": "research_path_e009",
      "content": "You manage to track down PC Davies, now retired and living in a small bungalow on the outskirts of Lower Slaughter. He remembers the case vividly, the pain still etched on his face. He recalls that the search focused on the surrounding fields and woods, but the garden itself wasn't thoroughly examined. He vaguely recalls the existence of an old well on the property, but mentions that it was never properly investigated. He notes the Thorne family seemed unusually reluctant to cooperate fully with the investigation, a fact that, even now, raises questions in his mind.",
      "choices": [
        {
          "content": "Press Davies for information about what he knows that is behind the door, and the circumstances surrounding Thomas's disappearance.",
          "entry_id": "well_truth_reveal_e001"
        },
        {
          "content": "Return to the door, ready to break it down if necessary, and properly investigate what lies behind it.",
          "entry_id": "research_path_e014"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e003": {
      "entry_id": "well_truth_reveal_e003",
      "content": "You peer into the well. It’s dark and damp, the air thick with a musty, earthy odour. A faint trickle of water echoes from the depths. The stone of the well is slick with moisture, and the air is heavy. A flash of memory flickers: Thomas laughing, reaching for something just out of reach, his small fingers grasping at the air.",
      "choices": [
        {
          "content": "Peer into the darkness to see if there is anything at the bottom of the well.",
          "entry_id": "well_truth_reveal_e007"
        },
        {
          "content": "Leave the well and retreat into your fragmented memories, hoping they will shed some light on the mystery.",
          "entry_id": "well_truth_reveal_e008"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e007": {
      "entry_id": "well_truth_reveal_e007",
      "content": "The darkness within the well is impenetrable. You can’t see the bottom, only a void that seems to stretch into infinity. A cold dread creeps up your spine, a visceral fear that threatens to overwhelm you. You imagine Thomas, trapped and alone in the darkness. Another flash of memory: Thomas's favourite toy, a small, brightly painted wooden boat, bobbing on the surface of a puddle.",
      "choices": [
        {
          "content": "Give up the search for now and try to process what you've already experienced; the weight of the past is heavy.",
          "entry_id": "well_truth_reveal_e011"
        },
        {
          "content": "Keep staring into the darkness, trying to force the fragmented memory into sharper focus.",
          "entry_id": "well_truth_reveal_e012"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e011": {
      "entry_id": "well_truth_reveal_e011",
      "content": "You stand at the edge of the well, looking down into its black depths. The air is cold and damp, and a shiver runs down your spine. The memories of playing with Thomas in the garden flood back to you, fragmented and distorted. You remember his infectious laugh, the way his eyes sparkled in the sunlight. You feel a profound sense of loss, not just for Thomas, but for the innocence of your childhood, now tainted by the grim reality that festers in front of you. The need for a resolution is now becoming an obsession. A battle rages within you. Do you give in to your despair and trauma, or fight to find some sort of peace?",
      "choices": [
        {
          "content": "A wave of despair washes over you, and you allow the weight of the past to crush you.",
          "entry_id": "despair_lose_d001"
        },
        {
          "content": "Try to understand your parent's perspective and the choices they made.",
          "entry_id": "well_truth_reveal_e017"
        }
      ],
      "end": null
    },
    "research_path_e005": {
      "entry_id": "research_path_e005",
      "content": "The building permits offer nothing. Just the same plans, over and over, with no well marked. Yet you remember it, surely? The heavy wooden frame, the dark depths beyond. Standing before the mysterious door again, after all the time spent in the archives, a decision takes hold. It’s time to open the door, forget the archives.",
      "choices": [
        {
          "content": "Perhaps a more methodical approach is needed after all. Reconsider your strategy.",
          "entry_id": "door_investigation_d001"
        },
        {
          "content": "The archives have yielded nothing. It's time to stop researching and investigate the door directly.",
          "entry_id": "research_path_e014"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e004": {
      "entry_id": "well_truth_reveal_e004",
      "content": "You reel back from the open doorway, a wave of nausea washing over you. It can't be true. This can't be happening. You try to convince yourself it's just an old well, nothing more. A trick of the light. But the image of the well, the dark, silent opening, is burned into your mind. It's going to be difficult to forget this.",
      "choices": [
        {
          "content": "Go back to Bristol and try to forget everything. It's just an old well, nothing more. Just walk away.",
          "entry_id": "well_truth_reveal_e009"
        },
        {
          "content": "Stay in Oakhaven, but avoid the truth. Focus on other things, anything to get the well out of your mind.",
          "entry_id": "well_truth_reveal_e015"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e009": {
      "entry_id": "well_truth_reveal_e009",
      "content": "You pack your bags and prepare to leave, determined to put this behind you. Arthur and Eleanor hover anxiously, their faces etched with a mixture of guilt and relief. As you drive away, the image of the door, and the dark opening of the well, lingers in your mind. It gnaws at you. You can't shake the feeling that you're running away from something important, something you must confront.",
      "choices": [
        {
          "content": "Continue driving, burying the truth once more. Ignore everything your senses are telling you and move on.",
          "entry_id": "denial_lose_e001"
        },
        {
          "content": "Turn the car around and confront the truth, no matter the cost. There's still time to face the consequences of the past.",
          "entry_id": "well_truth_reveal_e014"
        }
      ],
      "end": null
    },
    "denial_lose_e001": {
      "entry_id": "denial_lose_e001",
      "content": "Choosing denial, you bury the truth once more, returning to a life of quiet desperation, mirroring your parents’ path. You convince yourself that you're doing the right thing, protecting yourself from the pain. A hollow feeling settles in your stomach. It's a familiar feeling, one that has haunted you for years. Is this really what you want?",
      "choices": [
        {
          "content": "Say a quick goodbye to his parents. A brief, stilted farewell is all they deserve.",
          "entry_id": "denial_lose_e002"
        },
        {
          "content": "Leave without a word. Just get out, disappear without explanation.",
          "entry_id": "denial_lose_e003"
        }
      ],
      "end": null
    },
    "denial_lose_e002": {
      "entry_id": "denial_lose_e002",
      "content": "You find Arthur and Eleanor in the kitchen, their faces etched with a strange mixture of relief and sorrow. The goodbye is strained, filled with unspoken words and averted gazes. You can sense their hope that you'll simply forget everything, just as they have tried to do for so many years.",
      "choices": [
        {
          "content": "Begin the long drive back to Bristol.",
          "entry_id": "denial_lose_e004"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e017": {
      "entry_id": "well_truth_reveal_e017",
      "content": "You begin to understand that the actions of your parents that day came from a place of fear and desperation. They were young, faced with an impossible situation and terrified of the consequences. As much as you want to hate them, you realise that their actions, however misguided, were born out of a twisted sense of love and protection. Perhaps forgiveness is possible, even if it seems impossible right now. But is that what you truly want? Do you want them to suffer?",
      "choices": [
        {
          "content": "Accept that forgiveness is possible, and begin the long road to healing.",
          "entry_id": "acceptance_win_e001"
        },
        {
          "content": "You cannot forgive what they have done. Inform the authorities of what happened.",
          "entry_id": "truth_out_lose_e001"
        }
      ],
      "end": null
    },
    "acceptance_win_e001": {
      "entry_id": "acceptance_win_e001",
      "content": "The silence hangs heavy in the air, broken only by Eleanor's quiet sobs. You realise that everything you knew about your childhood was a lie, a carefully constructed fantasy designed to protect you from a truth too terrible to bear. The realisation hits you like a physical blow. After what seems like an eternity, they begin to speak, their voices low and hesitant. They finally acknowledge their role in Thomas's disappearance and the subsequent cover-up. You feel a mix of anger, betrayal, and a strange sense of relief that the truth is finally out in the open, no matter how painful.",
      "choices": [
        {
          "content": "Demand to know why they kept the truth from you for so long.",
          "entry_id": "acceptance_win_e002"
        },
        {
          "content": "Express your own feelings of guilt and confusion.",
          "entry_id": "acceptance_win_e003"
        }
      ],
      "end": null
    },
    "acceptance_win_e002": {
      "entry_id": "acceptance_win_e002",
      "content": "Arthur explains, his voice trembling, that they were trying to protect you from the trauma of accidentally causing Thomas's death. Eleanor adds that they panicked and made a terrible mistake. They were worried about how such news would affect you and the community. They feared social isolation, whispers and rumours, and the constant judgement of others. You see the genuine remorse in their eyes, but you also feel a profound sense of betrayal. They prioritised your feelings over your best friend's, and allowed Thomas's mother to live without knowing what really happened to her son. Is it possible to forgive such a betrayal, even if it was done with good intentions?",
      "choices": [
        {
          "content": "Vent your anger and disappointment, and let your parents know how you feel.",
          "entry_id": "acceptance_win_e007"
        },
        {
          "content": "Suggest family therapy to start the long path to understanding and forgiveness.",
          "entry_id": "acceptance_win_e004"
        }
      ],
      "end": null
    },
    "research_path_e008": {
      "entry_id": "research_path_e008",
      "content": "Hours blur as you meticulously scan each page of the archived newspapers, your eyes straining in the dim light of the library. You find endless reports about the search for Thomas, heartfelt appeals from his parents, and speculative theories about what might have happened to him. Yet, amidst all the coverage, there isn't a single mention of a hidden door or a well in the Thorne's garden. The only thing that stands out is a small article that refers to the poor condition of the well, noting it as a risk to children and animals alike. This is a dead end.",
      "choices": [
        {
          "content": "You are starting to question the purpose of the newspaper archives and return to the door.",
          "entry_id": "research_path_e014"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e005": {
      "entry_id": "well_truth_reveal_e005",
      "content": "Your accusation hits them like a physical blow. Your mother drops her knitting, her face crumpling with distress. Tears well in her eyes. Arthur, however, remains stonily silent, his gaze fixed on some distant point. 'It was an accident,' your mother sobs, her voice barely a whisper. 'We were just trying to protect you.'",
      "choices": [
        {
          "content": "Try to understand their perspective and begin the long road to healing.",
          "entry_id": "well_truth_reveal_e017"
        },
        {
          "content": "Demand to know the full story.",
          "entry_id": "well_truth_reveal_e010"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e010": {
      "entry_id": "well_truth_reveal_e010",
      "content": "Your parents begin to recount the events of that day, their voices strained with emotion. Thomas fell into the well, they say, their eyes filled with tears. It was an accident, a moment of carelessness that turned into a tragedy. They panicked, terrified of the consequences, of losing you, and decided to cover it up. They built the door to hide the well, burying their guilt along with Thomas, hoping the secret would remain hidden forever. Arthur shows you the small article from the time, referring to the well, confirming what they say is true. But is it enough?",
      "choices": [
        {
          "content": "Find it in yourself to forgive them, and begin to heal together.",
          "entry_id": "acceptance_win_e001"
        },
        {
          "content": "You cannot forgive what they have done. Inform the authorities of what happened.",
          "entry_id": "truth_out_lose_e001"
        }
      ],
      "end": null
    },
    "truth_out_lose_e001": {
      "entry_id": "truth_out_lose_e001",
      "content": "Driven by an overwhelming need for justice for Thomas, you decide that the truth must be revealed, no matter the consequences for your family. You know it will shatter your family and community forever, but you also know that it is the right thing to do. You pick up the phone and dial 999. The operator answers.",
      "choices": [
        {
          "content": "Describe the events to the police, providing all known details.",
          "entry_id": "truth_out_lose_e002"
        },
        {
          "content": "Hesitate, questioning the decision, then proceed, but omit certain details.",
          "entry_id": "truth_out_lose_e003"
        }
      ],
      "end": null
    },
    "truth_out_lose_e002": {
      "entry_id": "truth_out_lose_e002",
      "content": "The news spreads rapidly through the village, a poisonous whisper carried on the wind. You return to Oakhaven, the silence of the house amplifying the dread in your stomach. You find your parents in the living room, frozen in a tableau of despair. Eleanor is sobbing quietly, her knitting needles abandoned on the floor. Arthur is slumped in his armchair, his face ashen, staring blankly at the wall.",
      "choices": [
        {
          "content": "Return to Oakhaven to face your parents, dreading the confrontation.",
          "entry_id": "truth_out_lose_e004"
        }
      ],
      "end": null
    },
    "research_path_e011": {
      "entry_id": "research_path_e011",
      "content": "Agnes Ashworth's face lights up at the mention of Thomas. She remembers him vividly, a mischievous glint in his eyes and a perpetual smear of mud on his knees. The mention of Oakhaven dims her smile and she leans forward conspiratorially, her voice a hoarse whisper. She remembers the old well, she says, overgrown and dangerous even back then. Thomas was always fascinated by it, drawn to the dark, mysterious opening. She claims Arthur Thorne, even then a stern figure, warned him repeatedly to stay away, citing safety concerns about the crumbling brickwork.",
      "choices": [
        {
          "content": "Realize the key lies in understanding more about the well. Return to the door to investigate with this new knowledge.",
          "entry_id": "door_investigation_d001"
        },
        {
          "content": "Investigate behind the door, as the well seems to be key to understanding what Agnes knows.",
          "entry_id": "well_truth_reveal_e001"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e008": {
      "entry_id": "well_truth_reveal_e008",
      "content": "You retreat into the house, overwhelmed by the images swirling in your mind. You remember playing with Thomas in the garden, the day he disappeared, the frantic search... and then, nothing. A blank space where the truth should be. You remember the sound of your parents' voices, hushed and panicked. A sense of dread fills you, a cold premonition that the answers you seek are more terrible than you ever imagined.",
      "choices": [
        {
          "content": "Succumb to the weight of the past and let it consume you.",
          "entry_id": "despair_lose_d001"
        },
        {
          "content": "Consider the motivations behind your parent's actions.",
          "entry_id": "well_truth_reveal_e017"
        }
      ],
      "end": null
    },
    "despair_lose_d001": {
      "entry_id": "despair_lose_d001",
      "content": "The weight of their deceit crushes you. The cosy familiarity of Oakhaven now feels like a suffocating prison, its cheerful facade masking a dark secret. The thought of facing them, facing the truth, is unbearable.",
      "choices": [
        {
          "content": "Withdraw into yourself, seeking refuge in your childhood bedroom to grapple with the revelation in solitude.",
          "entry_id": "despair_lose_d002"
        },
        {
          "content": "Unleash your fury on your parents, demanding answers and accusing them of shattering your life with their lies.",
          "entry_id": "despair_lose_d003"
        }
      ],
      "end": null
    },
    "despair_lose_d002": {
      "entry_id": "despair_lose_d002",
      "content": "You retreat into yourself, avoiding all contact with your parents. You spend days locked in your childhood bedroom, the floral wallpaper a constant reminder of your lost childhood. The room feels smaller than you remember, the air thick with the ghosts of happier times. You stare at the faded posters on the wall, images of spaceships and faraway galaxies, symbols of the dreams you once held so dear. Now, they seem like a cruel joke, mocking your current state of despair.",
      "choices": [
        {
          "content": "Continue to isolate yourself, sinking deeper into depression and self-blame.",
          "entry_id": "despair_lose_d008"
        },
        {
          "content": "Seek solace in the tranquility of the Cotswolds, hoping the change of scenery might bring some peace.",
          "entry_id": "despair_lose_d004"
        }
      ],
      "end": null
    },
    "despair_lose_d004": {
      "entry_id": "despair_lose_d004",
      "content": "You wander through the picture-postcard village of Lower Slaughter, the idyllic scenery a painful reminder of the life you've lost. The honey-colored stone cottages and tranquil river seem to mock your inner turmoil. You pause on the bridge, watching the ducks glide by, their peaceful existence a stark contrast to the chaos within you.",
      "choices": [
        {
          "content": "Accept defeat and return to your miserable life in Bristol, unable to confront the darkness of the past.",
          "entry_id": "despair_lose_d006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc003": {
      "entry_id": "parents_confrontation_pc003",
      "content": "Eleanor rushes forward, her voice trembling slightly. \"Oh, darling, it's nothing to worry about. Just an old garden feature. Your father probably knows more.\"",
      "choices": [
        {
          "content": "Ask Arthur directly, but in a calmer tone: 'Dad, do you know anything about the door?'",
          "entry_id": "parents_confrontation_pc005"
        },
        {
          "content": "Change the subject, pretending to accept their explanation (for now).",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc005": {
      "entry_id": "parents_confrontation_pc005",
      "content": "Arthur seems relieved by the change in tone. \"I told you, Elias. It's just an old doorway. We have the original plans somewhere, in the study. I can show you if you like.\" Eleanor clutches at Arthur's arm, her eyes wide, her relief palpable.",
      "choices": [
        {
          "content": "Accept the offer to see the plans.",
          "entry_id": "parents_confrontation_pc008"
        },
        {
          "content": "Insist they are hiding something.",
          "entry_id": "parents_confrontation_pc009"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc009": {
      "entry_id": "parents_confrontation_pc009",
      "content": "\"I know you're hiding something,\" you insist, your voice rising. Eleanor begins to cry, her shoulders shaking, but Arthur remains stony-faced, his jaw clenched. \"Elias, please,\" she sobs. \"Can't you just let it go? For your mother?\"",
      "choices": [
        {
          "content": "Continue to press them, demanding an explanation.",
          "entry_id": "parents_confrontation_pc018"
        },
        {
          "content": "Give in to their emotional manipulation. You'll never find out the truth.",
          "entry_id": "despair_lose_d001"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc018": {
      "entry_id": "parents_confrontation_pc018",
      "content": "Arthur sighs heavily, running a hand through his thinning hair. \"Elias, this is getting us nowhere. Can't you just let it go? For your mother?\" Eleanor looks pleadingly at you, tears streaming down her face, her hands clasped tightly in her lap.",
      "choices": [
        {
          "content": "Threaten to investigate the door yourself if they don't cooperate.",
          "entry_id": "parents_confrontation_pc021"
        },
        {
          "content": "Calmly state that you deserve to know the truth, whatever it is.",
          "entry_id": "parents_confrontation_pc022"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc022": {
      "entry_id": "parents_confrontation_pc022",
      "content": "Eleanor begins to weep silently, her gaze fixed on some distant point beyond the window. Arthur remains silent, his gaze fixed on the floor, his face etched with pain. The silence is deafening, punctuated only by Eleanor's quiet sobs.",
      "choices": [
        {
          "content": "Ask for their honest thoughts and feelings about Thomas.",
          "entry_id": "parents_confrontation_pc025"
        },
        {
          "content": "Accept their silence and leave the room.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc004": {
      "entry_id": "parents_confrontation_pc004",
      "content": "Arthur's face reddens, a vein throbbing in his temple. 'Don't speak to your mother like that,' he snaps, his voice trembling. 'It's an old well. Blocked up years ago, before you were even born, probably. Nothing more.' Eleanor looks stricken, tears welling in her eyes. The tremor in her hands is now obvious.",
      "choices": [
        {
          "content": "Demand to see the well: 'If it's just a blocked-up well, show it to me, now.'",
          "entry_id": "parents_confrontation_pc007"
        },
        {
          "content": "Calmly point out the inconsistency: 'But why wouldn't I remember a well in the garden, especially one so close to the house?'",
          "entry_id": "parents_confrontation_pc016"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc007": {
      "entry_id": "parents_confrontation_pc007",
      "content": "Arthur hesitates, a flicker of something unreadable crossing his face, then sighs heavily. 'Very well,' he concedes, leading you towards the back garden. Eleanor protests weakly, her voice thin and reedy, but follows at a distance, like a reluctant shadow.",
      "choices": [
        {
          "content": "As they approach the door, casually probe for information about the garden's history.",
          "entry_id": "parents_confrontation_pc017"
        },
        {
          "content": "Continue towards the door, feigning ignorance and observing their reactions.",
          "entry_id": "parents_confrontation_pc010"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc017": {
      "entry_id": "parents_confrontation_pc017",
      "content": "Arthur seems genuinely surprised by the question, blinking rapidly. Eleanor looks acutely nervous, her eyes darting between you and Arthur. 'Not that I recall,' Arthur replies, a little too quickly, his gaze wavering. 'We were busy settling in, of course.'",
      "choices": [
        {
          "content": "Ask if anything significant happened in the garden shortly after they moved into Oakhaven.",
          "entry_id": "parents_confrontation_pc020"
        },
        {
          "content": "Change the subject abruptly, pretending everything is normal and dropping the line of questioning altogether.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc020": {
      "entry_id": "parents_confrontation_pc020",
      "content": "Arthur hesitates, his face paling slightly, then says, with a forced casualness, 'There was that... incident with the Ashworth boy... years ago, of course. Dreadful business.' Eleanor gasps softly, her hand flying to her mouth.",
      "choices": [
        {
          "content": "Casually ask about any accidents or unfortunate incidents that might have occurred in the garden over the years.",
          "entry_id": "parents_confrontation_pc024"
        },
        {
          "content": "Drop the questioning and head back inside, feigning disinterest and hoping to defuse the situation.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc024": {
      "entry_id": "parents_confrontation_pc024",
      "content": "'He... he disappeared,' Arthur says, his voice now barely a whisper, all colour drained from his face. 'We never found him. Despite searching everywhere.' A single tear rolls down Eleanor's cheek.",
      "choices": [
        {
          "content": "Press for more details about what exactly happened to Thomas Ashworth.",
          "entry_id": "parents_confrontation_pc027"
        },
        {
          "content": "Change the subject abruptly, acting as if you didn't hear anything and quickly steer the conversation elsewhere.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc006": {
      "entry_id": "parents_confrontation_pc006",
      "content": "You let the crowbar fall to the ground, acutely aware of the discomfort radiating from your parents. Arthur turns back to tending his vegetable patch and Eleanor continues to deadhead the roses, studiously avoiding eye contact. The evening stretches on, each minute an age. The air hangs heavy with unsaid words, unspoken fears, and a secret you can’t quite grasp. You feel like an intruder in your own family, unwelcome and unwanted.",
      "choices": [
        {
          "content": "Later, when the house is dark and quiet, return to the garden to further consider the door in secret.",
          "entry_id": "door_investigation_d001"
        },
        {
          "content": "Retreat to bed, accepting defeat. There’s something they’re not telling you, but they’ll never reveal it willingly.",
          "entry_id": "despair_lose_d001"
        }
      ],
      "end": null
    },
    "despair_lose_d003": {
      "entry_id": "despair_lose_d003",
      "content": "You unleash a torrent of pent-up rage, accusing your parents of cowardice and demanding to know why they kept Thomas's fate hidden from you for so long. Eleanor dissolves into silent tears, while Arthur remains stoic, his face a mask of pain. Your outburst leaves you drained and hollow.",
      "choices": [
        {
          "content": "Succumb to despair, collapsing under the weight of your anger and the fragmented memories that torment you.",
          "entry_id": "despair_lose_d007"
        },
        {
          "content": "Escape to the nearby Cotswolds village of Lower Slaughter, hoping its beauty can offer some respite from the turmoil.",
          "entry_id": "despair_lose_d004"
        }
      ],
      "end": null
    },
    "despair_lose_d007": {
      "entry_id": "despair_lose_d007",
      "content": "Consumed by anger and shame, you remain trapped in your childhood home, a prisoner of its secrets. The weight of revelation has broken your spirit, leaving you unable to eat, unable to sleep, fueled only by the dark energy of your despair.",
      "choices": [],
      "end": "lose"
    },
    "parents_confrontation_pc008": {
      "entry_id": "parents_confrontation_pc008",
      "content": "Arthur, visibly relieved by your apparent acceptance, gestures towards the door of his study. \"I'm sure I've got the plans here somewhere...\" he says, a hint of forced joviality in his voice. The study is a dimly lit, cluttered room, the air thick with the smell of old paper and dust. Bookshelves line the walls, overflowing with volumes on local history and gardening. Piles of documents teeter precariously on every surface. Arthur begins to rummage through a stack of rolled-up architectural plans, muttering to himself about misplaced documents.",
      "choices": [
        {
          "content": "Help Arthur search for the plans, watching him closely for any sign of deception.",
          "entry_id": "parents_confrontation_pc011"
        },
        {
          "content": "While Arthur is distracted, secretly search the study for any clues related to Thomas Ashworth.",
          "entry_id": "parents_confrontation_pc012"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc011": {
      "entry_id": "parents_confrontation_pc011",
      "content": "As Arthur nervously shuffles through the rolled up documents, his back to you, your gaze sweeps across the room, lingering on the crowded bookshelves. A glint of gold catches your eye. Tucked away at the back of one of the shelves, almost hidden from view, is a slim, manila file. The words 'Ashworth Correspondence' are scrawled across the front in faded ink. A chill runs down your spine. It must be about Thomas.",
      "choices": [
        {
          "content": "Seize the file and demand answers from Arthur immediately about Thomas and the Ashworths.",
          "entry_id": "well_truth_reveal_e001"
        },
        {
          "content": "Wait for the right moment to take the file without Arthur noticing, and read it later in private.",
          "entry_id": "parents_confrontation_pc014"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc014": {
      "entry_id": "parents_confrontation_pc014",
      "content": "Later, safely hidden away in your childhood bedroom, you carefully unfold the 'Ashworth Correspondence' file. Inside, you find a collection of letters, yellowed with age, exchanged between your parents and the Ashworths in the weeks following Thomas's disappearance. The letters are filled with veiled apologies, strained reassurances, and increasingly frantic pleas for secrecy. A recurring phrase catches your eye: 'for Elias's sake'. The shared secret, whatever it is, is tearing them apart. The last letter is a doctor's bill for a psychiatrist, addressed to Eleanor.",
      "choices": [
        {
          "content": "Confront your parents with the contents of the letters, demanding to know the truth about Thomas's disappearance and their secret.",
          "entry_id": "well_truth_reveal_e001"
        }
      ],
      "end": null
    },
    "acceptance_win_e003": {
      "entry_id": "acceptance_win_e003",
      "content": "You admit to them that you’ve always felt a void, a missing piece in your childhood. A sense of unease that you could never quite place. You wonder aloud if, subconsciously, you always knew more than you let on, some repressed memory nagging at the edges of your awareness. This confession seems to soften your parents' stance, their faces etched with a mixture of guilt and a glimmer of hope.",
      "choices": [
        {
          "content": "Internalize your emotions and withdraw from your parents, retreating into yourself.",
          "entry_id": "acceptance_win_e008"
        },
        {
          "content": "Express your lingering sense of hollowness, wondering if you always knew more than you let on.",
          "entry_id": "acceptance_win_e004"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc010": {
      "entry_id": "parents_confrontation_pc010",
      "content": "As you, Arthur, and Eleanor stand before the door, Arthur fumbles with the rusty padlock. It resists at first, then finally clicks open with a groan. The door creaks inwards, revealing only a void of darkness.",
      "choices": [
        {
          "content": "Search behind the foliage again. Maybe a glint of metal will reveal something new...",
          "entry_id": "parents_confrontation_pc019"
        },
        {
          "content": "Peer into the darkness beyond the door, straining your eyes to see if you can make out any shapes.",
          "entry_id": "parents_confrontation_pc013"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc019": {
      "entry_id": "parents_confrontation_pc019",
      "content": "You push aside the curtain of overgrown ivy and brambles and discover a rusty metal plate bolted to the door’s frame. The plate is roughly square, about a foot across, and the bolt heads are heavily corroded.",
      "choices": [
        {
          "content": "Try to pry open the rusty metal plate, hoping to see what's hidden underneath.",
          "entry_id": "parents_confrontation_pc023"
        },
        {
          "content": "Peer intently into the darkness again, trying to discern something new that you might have missed. You focus your eyes, trying to cut through the gloom.",
          "entry_id": "parents_confrontation_pc013"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc023": {
      "entry_id": "parents_confrontation_pc023",
      "content": "The metal plate seems stubbornly attached. You can’t see what it’s covering, but you can tell it’s been there for a long time. The edges are sealed tight with rust and age. Your parents are now in the garden, tending to the plants.",
      "choices": [
        {
          "content": "Give up on the door for now and join your parents in the garden.",
          "entry_id": "parents_confrontation_pc006"
        },
        {
          "content": "Use some force to try and remove the plate, despite the resistance. It’s worth a shot.",
          "entry_id": "parents_confrontation_pc026"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc026": {
      "entry_id": "parents_confrontation_pc026",
      "content": "You strain against the metal plate, but it won’t budge. The bolts are rusted solid and seem fused to the frame. You can't even detect any give.",
      "choices": [
        {
          "content": "Give up for now, deciding you’ll try again later when you have better tools or a clearer head, and go join your parents in the garden.",
          "entry_id": "parents_confrontation_pc006"
        },
        {
          "content": "Go get a crowbar from the shed and try to pry the plate loose, using leverage to your advantage.",
          "entry_id": "parents_confrontation_pc029"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc029": {
      "entry_id": "parents_confrontation_pc029",
      "content": "You grab a crowbar from the shed behind the house and return to the door. You wedge the crowbar under the edge of the plate, finding a purchase against the rotten wood, and pull with all your strength.",
      "choices": [
        {
          "content": "Try to pry the plate loose with the crowbar, putting your full weight into it.",
          "entry_id": "parents_confrontation_pc031"
        },
        {
          "content": "Go back to your parents, defeated. The plate seems too stubborn to remove without proper tools and more time.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc012": {
      "entry_id": "parents_confrontation_pc012",
      "content": "Rummaging through the dusty files, you unearth a faded photograph. It depicts you as a child, grinning mischievously next to another boy near an old, stone well. He must be Thomas. On the back, scrawled in what looks like your mother's shaky handwriting, is the inscription: 'Never forget.' A chill runs down your spine. What does it mean? And why was it hidden away in this forgotten corner of the study?",
      "choices": [
        {
          "content": "Confront your parents immediately with the photo, demanding to know about Thomas, the well, and what 'Never forget' means.",
          "entry_id": "well_truth_reveal_e001"
        },
        {
          "content": "Carefully pocket the photograph, keeping it as evidence while you consider your next move.",
          "entry_id": "parents_confrontation_pc015"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e012": {
      "entry_id": "well_truth_reveal_e012",
      "content": "Suddenly, a clear image pierces through the fog of your memory: Thomas, reaching for his brightly coloured wooden boat, its red and blue paint chipped and faded. You see him slipping on the mossy edge of the well, his small hands grasping for purchase on the slick stone. A piercing scream echoes in your mind, abruptly cut short. Then, nothing but silence. The boat bobs forlornly on the water's surface.",
      "choices": [
        {
          "content": "Try to come to terms with the memory alone, seeking answers within yourself.",
          "entry_id": "well_truth_reveal_e016"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e016": {
      "entry_id": "well_truth_reveal_e016",
      "content": "You sit alone, the fragmented vision of Thomas replaying in your mind. You can no longer ignore the weight of the past, the unsettling feeling that you've been living a lie. It's time to confront the truth, however painful it may be. You need to know what really happened that day, even if it shatters everything you thought you knew.",
      "choices": [
        {
          "content": "Confront your parents, demanding they finally reveal the truth about Thomas and the well.",
          "entry_id": "well_truth_reveal_e002"
        },
        {
          "content": "Try to suppress the memory, convincing yourself it's just a bad dream and attempting to move on.",
          "entry_id": "well_truth_reveal_e013"
        }
      ],
      "end": null
    },
    "acceptance_win_e007": {
      "entry_id": "acceptance_win_e007",
      "content": "A wave of anger washes over you, fuelled by years of suppressed grief and betrayal. You unleash your fury on your parents, accusing them of selfishness, cowardice, and a complete disregard for the truth. How could they keep such a devastating secret from you, allowing Thomas's mother to live without closure for all these years? You feel betrayed by their deception, struggling to reconcile their actions with the image of the loving parents you thought you knew.",
      "choices": [
        {
          "content": "Insist that they tell the authorities the full truth about Thomas, regardless of the personal consequences.",
          "entry_id": "acceptance_win_e005"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc013": {
      "entry_id": "parents_confrontation_pc013",
      "content": "The darkness is absolute. A cold, damp air rises from the opening, prickling your skin. A faint, metallic scent hangs in the air, tinged with the odour of stagnant water and decaying leaves. It's a smell that seems to claw at a forgotten corner of your memory. A shiver runs down your spine.",
      "choices": [
        {
          "content": "Demand that Arthur explain what's down there (if you know about Thomas).",
          "entry_id": "well_truth_reveal_e001"
        },
        {
          "content": "Turn away, overwhelmed by a sense of dread. The weight of the past is too much.",
          "entry_id": "despair_lose_d001"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e015": {
      "entry_id": "well_truth_reveal_e015",
      "content": "Days blur into weeks, yet you can't shake the feeling that something is profoundly wrong. The image of the well, the hidden door, replays in your mind, a constant, nagging loop. You tell yourself you're imagining things, that it's just an old house with old secrets. But the unease persists, a persistent whisper in the back of your mind. You realise you can't keep living like this.",
      "choices": [
        {
          "content": "Return to the well. You have to know the truth.",
          "entry_id": "well_truth_reveal_e003"
        },
        {
          "content": "Try to move on with your life, away from Oakhaven.",
          "entry_id": "denial_lose_e001"
        }
      ],
      "end": null
    },
    "denial_lose_e003": {
      "entry_id": "denial_lose_e003",
      "content": "You slip out of the house, the garden gate creaking shut behind you, the sound unnaturally loud in the still air. You avoid eye contact with your parents, a heavy wave of guilt washing over you. Their faces are pale and drawn, etched with a silent plea. You know you should say something, but the words catch in your throat. Turning away, you head to the car, the keys cold and heavy in your hand.",
      "choices": [
        {
          "content": "Begin the long drive back to Bristol.",
          "entry_id": "denial_lose_e004"
        }
      ],
      "end": null
    },
    "denial_lose_e004": {
      "entry_id": "denial_lose_e004",
      "content": "The drive back to Bristol is long and uneventful, the familiar Cotswold landscape blurring into a monotonous green. You stare blankly at the road, your thoughts a jumbled mess of denial and regret. You try to focus on the road, the white lines a metronomic rhythm. The weight of the unacknowledged secret presses down on you, a suffocating blanket of guilt and fear.",
      "choices": [
        {
          "content": "Arrive back in Bristol and unpack.",
          "entry_id": "denial_lose_e005"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc015": {
      "entry_id": "parents_confrontation_pc015",
      "content": "As Arthur and Eleanor prepare for bed, you take out the photograph from the study. The faded image shows a younger you and Thomas standing near the well. A weathered stone structure surrounds the well, identical to the one half-hidden behind the garden door. Scrawled on the back, in what you recognise as your mother's handwriting, are the words 'Never forget'. The meaning is now horribly clear. Your parents know more than they've ever let on. The truth, it seems, is buried as deep as that well.",
      "choices": [
        {
          "content": "Show them the photograph and demand the truth about the well, now knowing the connection to Thomas.",
          "entry_id": "well_truth_reveal_e001"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e006": {
      "entry_id": "well_truth_reveal_e006",
      "content": "Your calm approach seems to disarm them slightly. Arthur's shoulders slump with a mixture of relief and exhaustion, while Eleanor's breathing becomes less shallow. \"We need to talk,\" he says, his voice heavy with a grief he's clearly carried for decades. He stands and gestures to the living room.",
      "choices": [
        {
          "content": "Listen to their story, approaching it calmly and without accusation.",
          "entry_id": "well_truth_reveal_e010"
        }
      ],
      "end": null
    },
    "truth_out_lose_e004": {
      "entry_id": "truth_out_lose_e004",
      "content": "Back in Oakhaven, the air is heavy with unspoken accusations and stifled grief. You return, despite being asked to remain in the area for questioning. Eleanor sits motionless, staring blankly ahead, her face pale and drawn. Arthur stands at the window, his back to you, his shoulders slumped with defeat. The comfortable facade of their lives has shattered, leaving behind only raw pain and bitter regret.",
      "choices": [
        {
          "content": "Attempt to explain, hoping they will understand the impossible situation you find yourself in.",
          "entry_id": "truth_out_lose_e005"
        },
        {
          "content": "Apologize for putting them in this position, attempting to shoulder the blame yourself.",
          "entry_id": "truth_out_lose_e006"
        }
      ],
      "end": null
    },
    "truth_out_lose_e006": {
      "entry_id": "truth_out_lose_e006",
      "content": "Overcome with guilt and regret, your heartfelt apology seems to break through their stunned silence. Eleanor reaches out and grasps your hand, her grip surprisingly strong. Arthur nods slowly, a flicker of something akin to understanding in his eyes. Though the scars of the past will always remain, a fragile bridge has been built, offering the faintest glimmer of hope for reconciliation.",
      "choices": [
        {
          "content": "Try to repair the damage, even knowing it may be beyond repair.",
          "entry_id": "truth_out_lose_e007"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc016": {
      "entry_id": "parents_confrontation_pc016",
      "content": "Eleanor avoids eye contact, fiddling with the silver locket she always wears. Arthur says defensively, his voice raised slightly, 'We didn't want to upset you. It was a long time ago. Best left buried.' The words hang in the air, heavy with unspoken meaning.",
      "choices": [
        {
          "content": "Demand they tell you what they are hiding.",
          "entry_id": "parents_confrontation_pc018"
        },
        {
          "content": "Drop the subject, deciding further confrontation is pointless. You can feel yourself getting nowhere.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc021": {
      "entry_id": "parents_confrontation_pc021",
      "content": "Arthur and Eleanor exchange worried looks. You sense they are close to revealing something, but the years of ingrained habit – of keeping this buried – are hard to overcome. 'Please, Elias,' Eleanor says, her voice trembling. 'Can’t you just let it go?'",
      "choices": [
        {
          "content": "Despite their pleas, you decide to investigate the door further, but more cautiously, tonight.",
          "entry_id": "door_investigation_d001"
        },
        {
          "content": "Go to bed, frustrated and unresolved. You can’t face this anymore.",
          "entry_id": "despair_lose_d001"
        }
      ],
      "end": null
    },
    "despair_lose_d008": {
      "entry_id": "despair_lose_d008",
      "content": "Driven to understand what happened that day, Elias finds some old newspaper clippings and police reports stored in the dusty attic. Yellowed and brittle, they tell a story of a missing boy, a frantic search, and a community shattered by grief. As you piece the tragic story together, a new perspective forms, and you begin to glimpse the depths of your parents' grief and the burden they have carried all these years. This knowledge brings a strange sense of peace amidst the pain.",
      "choices": [
        {
          "content": "Try to reconcile with his parents, hoping that understanding may heal the wounds of the past.",
          "entry_id": "despair_lose_d009"
        }
      ],
      "end": null
    },
    "despair_lose_d009": {
      "entry_id": "despair_lose_d009",
      "content": "Although things will never be the same, Elias begins the long and difficult process of rebuilding his relationship with his parents. Small gestures of kindness replace the years of unspoken resentment. The family starts to visit Thomas' grave regularly, sharing memories and finding solace in their shared grief. A fragile peace settles over them, tinged with the ever-present sadness of what was lost. The sharp, painful image of Thomas slowly begins to fade, replaced by the softer memory of a happy child and the hope of a shared future.",
      "choices": [],
      "end": "win"
    },
    "parents_confrontation_pc025": {
      "entry_id": "parents_confrontation_pc025",
      "content": "Arthur's face crumples. For a moment, the mask of stoicism cracks, revealing the pain beneath. \"Every single day,\" he admits quietly, his voice barely a whisper. He looks away, his gaze lost in the middle distance, as if reliving the events again and again.",
      "choices": [
        {
          "content": "Ask if they ever blamed themselves for what happened to Thomas.",
          "entry_id": "parents_confrontation_pc028"
        },
        {
          "content": "Let the conversation end, deciding you won't get any more information.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc028": {
      "entry_id": "parents_confrontation_pc028",
      "content": "Arthur hesitates, his eyes darting nervously towards Eleanor, who remains silent, her face pale. \"I... I don't know if we have them anymore,\" he says, his voice strained. \"It was a long time ago, Elias. Things get lost, thrown away...\"",
      "choices": [
        {
          "content": "Ask to see the original architectural plans of the house.",
          "entry_id": "parents_confrontation_pc008"
        },
        {
          "content": "End the conversation and retreat, overwhelmed by the revelations.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "despair_lose_d006": {
      "entry_id": "despair_lose_d006",
      "content": "Back in Bristol, your life completely unravels. The overdue rent finally catches up, and you're evicted from your apartment. Your freelance business collapses, and you find yourself drifting further and further from your parents, the rift between you unhealed. You are haunted by the image of Thomas in the well, a symbol of the secrets that fractured your life, and the crushing weight of your own inaction.",
      "choices": [],
      "end": "lose"
    },
    "parents_confrontation_pc027": {
      "entry_id": "parents_confrontation_pc027",
      "content": "'They moved away, shortly after... after Thomas,' Arthur says, his voice strained. 'We haven't spoken to them in years.' Eleanor avoids your gaze, fiddling with the silver locket around her neck.",
      "choices": [
        {
          "content": "Ask if the Ashworths are still alive and if they know about the door.",
          "entry_id": "parents_confrontation_pc030"
        },
        {
          "content": "Give up, and rejoin your parents in the garden. It’s clear they don’t want to talk about it.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc030": {
      "entry_id": "parents_confrontation_pc030",
      "content": "'We never told them anything,' Arthur says quickly, a defensive edge creeping into his voice. Eleanor bursts into tears again, a silent cascade of grief and guilt.",
      "choices": [
        {
          "content": "Ask if the Ashworths ever suspected anything about the well, or the garden.",
          "entry_id": "parents_confrontation_pc032"
        },
        {
          "content": "Say you are done and leave. Their evasiveness is making you sick.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc032": {
      "entry_id": "parents_confrontation_pc032",
      "content": "'I don't want to talk about it anymore', Arthur says, his voice firm, shutting down the conversation. He avoids your eyes and stares intently at the rose bushes.",
      "choices": [
        {
          "content": "Say you are done and leave. This is getting you nowhere.",
          "entry_id": "parents_confrontation_pc006"
        },
        {
          "content": "Ask one more question about the circumstances of Thomas's disappearance. You need to know more.",
          "entry_id": "parents_confrontation_pc034"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc034": {
      "entry_id": "parents_confrontation_pc034",
      "content": "'We've said too much already. The truth is the Ashworth boy is gone, and we don't want to dredge up the past’, Arthur says, his voice rising slightly. His hands clench into fists at his sides.",
      "choices": [
        {
          "content": "Continue to press Arthur, determined to get him to tell you more about what happened to Thomas Ashworth.",
          "entry_id": "parents_confrontation_pc009"
        },
        {
          "content": "Give up and rejoin your parents in the garden. They’re clearly not going to be forthcoming, and you don’t want to upset your mother any further.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "door_exploration_d009": {
      "entry_id": "door_exploration_d009",
      "content": "You throw your weight against the door, but it doesn't budge. The old wood groans ominously under the pressure, but remains stubbornly in place. The rusty hinges creak in protest. A sharp pain shoots through your shoulder.",
      "choices": [
        {
          "content": "Take a closer look for a lock or mechanism despite the throbbing pain in your shoulder.",
          "entry_id": "door_exploration_d006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc031": {
      "entry_id": "parents_confrontation_pc031",
      "content": "The crowbar bites into the wood around the rusted bolts. With a final heave, the metal plate creaks and groans, finally breaking free. The rusted fixings give way, showering the ground with flakes of decaying metal.",
      "choices": [
        {
          "content": "Remove the plate, revealing whatever lies behind.",
          "entry_id": "parents_confrontation_pc033"
        },
        {
          "content": "Admit defeat and rejoin your parents in the garden, abandoning your search for now.",
          "entry_id": "parents_confrontation_pc006"
        }
      ],
      "end": null
    },
    "parents_confrontation_pc033": {
      "entry_id": "parents_confrontation_pc033",
      "content": "Behind the metal plate, a smaller wooden door is revealed. It is also made of dark oak, but this door is newer, less weathered. This door has no handle or hinges visible from this side. Instead, the door has a keyhole. It's as if it were built to conceal something specifically.",
      "choices": [
        {
          "content": "Peel back the wood to reveal the well behind the door.",
          "entry_id": "well_truth_reveal_e001"
        }
      ],
      "end": null
    },
    "well_truth_reveal_e014": {
      "entry_id": "well_truth_reveal_e014",
      "content": "You have returned to Oakhaven. The image of the well, dark and silent, is burned into your mind. This has gone on long enough. The truth, no matter how painful, must be revealed.",
      "choices": [
        {
          "content": "Turn the car around and confront your parents. The truth, no matter how painful, has to come out.",
          "entry_id": "well_truth_reveal_e002"
        },
        {
          "content": "Report what you suspect to the authorities. Let the police investigate - the truth will out.",
          "entry_id": "truth_out_lose_e001"
        }
      ],
      "end": null
    },
    "truth_out_lose_e005": {
      "entry_id": "truth_out_lose_e005",
      "content": "Your desperate attempts at justification are met with stony silence. Eleanor's face is a mask of fury and disappointment, her eyes blazing with anger. Arthur simply shakes his head, a deep sadness etched into his face. The unspoken words hang heavy in the air - betrayal, disappointment, and regret. The bond is irrevocably broken. You gather your belongings and leave Oakhaven, knowing you can never truly return. The weight of what you've done will stay with you forever.",
      "choices": [],
      "end": "lose"
    },
    "door_exploration_d007": {
      "entry_id": "door_exploration_d007",
      "content": "The rusty key slides into the lock with a satisfying click, though it takes a bit of wiggling. You turn it, and the door creaks open with a groan that echoes through the still garden. The hinges, stiff with age, protest as you pull it ajar. A rush of cool, damp air wafts out, carrying the scent of moss and stagnant water. The opening reveals a dark, ominous space beyond, promising secrets and hidden truths.",
      "choices": [
        {
          "content": "Step through the door, bracing yourself for what awaits.",
          "entry_id": "well_truth_reveal_e001"
        }
      ],
      "end": null
    },
    "truth_out_lose_e003": {
      "entry_id": "truth_out_lose_e003",
      "content": "You attempt to minimize your parents' involvement, driven by a desperate hope to protect them from the worst of the fallout. You emphasise your own actions and downplay their role in the cover-up. The police listen intently, their expressions unreadable. They note the inconsistencies in your statement, subtle shifts in your story that betray your unease, but acknowledge your distress. You're told not to leave the area. A knot of anxiety tightens in your chest. Have you made things better, or just condemned yourself and your family?",
      "choices": [
        {
          "content": "Return to Oakhaven and confront your parents, despite being asked to stay in the area.",
          "entry_id": "truth_out_lose_e004"
        }
      ],
      "end": null
    },
    "truth_out_lose_e007": {
      "entry_id": "truth_out_lose_e007",
      "content": "Despite the initial moments of forgiveness, the underlying tensions simmer beneath the surface. The weight of your actions, and the revelation of the truth, continue to strain your relationship with your parents. The atmosphere in Oakhaven remains heavy and charged. Over time, the shared burden of the past becomes too much to bear, leading to a gradual but inevitable breakdown of the family unit. You find yourself increasingly isolated, haunted by the ghosts of the past and the knowledge that you are ultimately alone.",
      "choices": [],
      "end": "lose"
    },
    "well_truth_reveal_e013": {
      "entry_id": "well_truth_reveal_e013",
      "content": "The events of the past are swirling around you, the air thick with unspoken words. You remember Thomas's smile, the way his eyes would light up when he spotted a butterfly in the garden. Can you use this memory, this newfound awareness, to forge a new path? Or will it drag you down into the darkness?",
      "choices": [
        {
          "content": "Find the strength to forgive and attempt to rebuild a relationship with your parents.",
          "entry_id": "acceptance_win_e001"
        },
        {
          "content": "The memory of Thomas is too much to bear; let it consume you and retreat from the world.",
          "entry_id": "despair_lose_d001"
        }
      ],
      "end": null
    },
    "acceptance_win_e008": {
      "entry_id": "acceptance_win_e008",
      "content": "The silence is deafening. You feel utterly adrift. You stare at your parents, their faces etched with guilt and fear. Can you ever look at them the same way again? The desire to run, to escape this suffocating atmosphere, is overwhelming. Yet, a flicker of resolve remains, a need to see justice done, for Thomas, and for yourself.",
      "choices": [
        {
          "content": "Insist that they confess the full truth about Thomas to the authorities, even if it means imprisonment.",
          "entry_id": "acceptance_win_e005"
        }
      ],
      "end": null
    },
    "acceptance_win_e005": {
      "entry_id": "acceptance_win_e005",
      "content": "Arthur and Eleanor, their faces pale and drawn, finally agree to contact PC Davies, the retired officer who led the original investigation, and confess their part in the cover-up of Thomas’s death. It will mean facing the consequences of their actions, risking their reputations and their freedom. But a sense of grim determination settles over them as they dial the number.",
      "choices": [
        {
          "content": "Move forward, accepting the consequences of their actions and building a new foundation of honesty with your family.",
          "entry_id": "acceptance_win_e006"
        }
      ],
      "end": null
    },
    "acceptance_win_e006": {
      "entry_id": "acceptance_win_e006",
      "content": "The air is still, the only sound the gentle rustling of leaves in the garden. You, Arthur, and Eleanor stand together, a fragile truce forged between you. The police have concluded their investigation, the village whispers have died down, and the truth is finally out in the open. Thomas’s memory is honoured with a small plaque beside the well. A small, private memorial, a place for remembrance. The future remains uncertain, but you face it together, bound by a shared history and a renewed sense of purpose. The sun sets over Oakhaven, casting long shadows across the garden, a silent promise of a new dawn.",
      "choices": [],
      "end": "win"
    },
    "acceptance_win_e004": {
      "entry_id": "acceptance_win_e004",
      "content": "Your parents tentatively agree to family therapy, a suggestion met with a mixture of hope and trepidation. The sessions are emotionally draining, filled with painful silences and tearful recriminations as you navigate the tangled web of your shared past. Slowly, painstakingly, you begin to unravel the layers of guilt and resentment that have defined your family for so long. They admit they should have been honest with you much earlier, and allowed you to make your own peace with it. The weight of their regret is palpable.",
      "choices": [
        {
          "content": "Find the strength to forgive them and work toward rebuilding your family, now that the truth is out in the open. It won't be easy, but it's a start.",
          "entry_id": "acceptance_win_e006"
        }
      ],
      "end": null
    },
    "denial_lose_e005": {
      "entry_id": "denial_lose_e005",
      "content": "Back in your Bristol apartment, you unpack mechanically. The familiar surroundings offer no comfort, only a stark reminder of your stagnant existence. The unfinished design projects on your desk seem to mock you now. The garden door, the well... they're already fading, becoming just another layer of forgotten memories, of things you didn't face. You lie in bed, staring at the ceiling, sleep refusing to come. A sense of profound emptiness settles over you. This is your life, and it will never change.",
      "choices": [],
      "end": "lose"
    },
    "bristol_apartment_b005": {
      "entry_id": "bristol_apartment_b005",
      "content": "You let the call go to voicemail. The machine clicks on, and Eleanor's voice, laced with a tremor you know all too well, fills the small space. She asks you to call back 'when you have a moment'. The last two words hang in the air, heavy with unspoken expectation. You delete the message without replying, a familiar knot of guilt twisting in your stomach. You tell yourself it's better this way. Prolonging the inevitable won't make it any easier. // You avoid your mother's call, feeling both guilty and resentful.",
      "choices": [
        {
          "content": "Stew about the missed call and your complicated relationship with your mother.",
          "entry_id": "bristol_apartment_b007"
        }
      ],
      "end": null
    },
    "bristol_apartment_b007": {
      "entry_id": "bristol_apartment_b007",
      "content": "The silence in the apartment is thick with the weight of the unanswered call. You try to convince yourself it was nothing important, just a routine check-in. But the memory of the subtle waver in your mother's voice keeps replaying in your mind. You glance at the phone, then back at the blinking cursor on your laptop. Focus is impossible. The unreturned call hangs heavily over you, and you feel guilty.",
      "choices": [
        {
          "content": "Continue to ignore the call and try to distract yourself with work, despite the worry.",
          "entry_id": "bristol_apartment_b006"
        },
        {
          "content": "Give in and call her back. You can't shake the feeling that something is genuinely wrong.",
          "entry_id": "bristol_apartment_b002"
        }
      ],
      "end": null
    },
    "oakhaven_arrival_e005": {
      "entry_id": "oakhaven_arrival_e005",
      "content": "You unpack in your childhood bedroom, the air thick with the scent of lavender and dust. The room feels both intimately familiar and strangely alien, a museum dedicated to a past version of yourself. You glance out of the window at the garden below, overgrown and slightly wilder than you remember. It beckons, promising a brief respite from the suffocating atmosphere of the house. // Elias seeks escape in the garden.",
      "choices": [
        {
          "content": "Head downstairs and into the garden, seeking escape and fresh air.",
          "entry_id": "oakhaven_arrival_e007"
        }
      ],
      "end": null
    },
    "oakhaven_arrival_e007": {
      "entry_id": "oakhaven_arrival_e007",
      "content": "You step out into the garden, the cool, damp air a welcome contrast to the stuffiness of the house. The scent of roses and damp earth fills your nostrils, a potent reminder of childhood summers. The garden is noticeably overgrown, the flowerbeds blurring into one another, the lawn dotted with unruly patches of weeds. You feel a strange sense of liberation in its untamed state. It's as if the garden has been allowed to mirror the unspoken tensions within the house. // Elias explores the overgrown garden.",
      "choices": [
        {
          "content": "Wander deeper into the overgrown garden. You want to explore.",
          "entry_id": "garden_door_discovery_e000"
        }
      ],
      "end": null
    },
    "bristol_apartment_b008": {
      "entry_id": "bristol_apartment_b008",
      "content": "You stare out the window, watching the Bristol rain streak the glass. The city feels oppressive, the relentless grey mirroring your own mood. Maybe a change of scenery would do you good, a temporary escape from the mounting pressure. And perhaps, just perhaps, you could finally figure out what's truly bothering your mother. // Elias considers a trip to Oakhaven as a solution to his problems.",
      "choices": [
        {
          "content": "Call your mother and suggest a visit to Oakhaven. Perhaps you can ease her worries.",
          "entry_id": "bristol_apartment_b002"
        }
      ],
      "end": null
    }
  },
  "title": "The Garden Door",
  "description": "At the end of your rope, returning to your childhood home offers little comfort, until you find a strange, half-remembered door in the garden that promises a bizarre escape.",
  "date": "2025-02-25",
  "order": 999,
  "tags": [
    "gemini/gemini-2.0-flash",
    "garden door",
    "childhood mystery"
  ],
  "layout": "layouts/game.njk",
  "prompt": "N/A"
}