{
  "start_entry_id": "ef608",
  "entries": {
    "ef608": {
      "entry_id": "ef608",
      "content": "The floral wallpaper of your Wolverhampton bedroom swims into focus as a shaft of sunlight pierces through a gap in the curtains. You're sprawled amongst the duvet, blissfully unaware of the momentous day ahead. That is, until the radio alarm clock on your bedside table crackles to life. \n\n'Good morning, Wolverhampton! And a *very* good morning it is, because today, ladies and gentlemen, the wait is over! Lionel Richie's brand new album has officially dropped!' The DJ's voice, buzzing with excitement, slices through your sleep-addled brain. Lionel Richie! The new album! Your eyes snap open. How could you have forgotten? This is a disaster! You simply *must* get your hands on a copy today. Your quest begins now, in Wolverhampton.",
      "choices": [
        {
          "content": "Grope for the radio, desperate to hear more.",
          "entry_id": "alarming_announcement_entry_2b"
        },
        {
          "content": "Mutter and bury your head under the pillow, feigning ignorance.",
          "entry_id": "alarming_announcement_entry_2a"
        }
      ],
      "end": null
    },
    "alarming_announcement_entry_2a": {
      "entry_id": "alarming_announcement_entry_2a",
      "content": "You groan, burying your head under the pillow. The DJ's voice is relentless, but you're clinging to the hope of a few more minutes of sleep. Lionel can wait, surely. But the nagging feeling that today is *the* day is hard to ignore. You can just about make out the DJ mentioning something about 'Spin City' and a 'special promotion'.",
      "choices": [
        {
          "content": "Give in and listen to the radio.",
          "entry_id": "e1958"
        },
        {
          "content": "Try to drift back to sleep, dreams of Lionel fading away.",
          "entry_id": "e0306"
        }
      ],
      "end": null
    },
    "e1958": {
      "entry_id": "e1958",
      "content": "The radio DJ's voice, now even more irritatingly upbeat, cuts through your grogginess. '...and don't forget folks, a special release day promotion down at 'Spin City' record store! Get yourselves down there for a chance to win...' The words 'Lionel Richie' and 'special promotion' finally register. It hits you like a bucket of cold water. You completely forgot! Today is the release day, and you haven't even pre-ordered a copy. A true fan in Wolverhampton is about to face a major crisis.",
      "choices": [
        {
          "content": "Leap out of bed in a panic – there's no time to lose! Lionel Richie awaits!",
          "entry_id": "alarming_announcement_entry_3a"
        },
        {
          "content": "Calmly assess the situation – what's the best course of action to secure the album?",
          "entry_id": "alarming_announcement_entry_3b"
        }
      ],
      "end": null
    },
    "alarming_announcement_entry_3a": {
      "entry_id": "alarming_announcement_entry_3a",
      "content": "A wave of pure, unadulterated panic washes over you. How could you be so forgetful? Lionel Richie deserves better than this! You leap out of bed with a start, instantly regretting your life choices. This is a disaster of epic proportions!",
      "choices": [
        {
          "content": "Rush out of bed without looking – speed is key!",
          "entry_id": "e00af"
        },
        {
          "content": "Frantically search for your keys and wallet – gotta be prepared.",
          "entry_id": "eb341"
        }
      ],
      "end": null
    },
    "e00af": {
      "entry_id": "e00af",
      "content": "In your haste, you trip over a pile of clothes carelessly strewn across the floor – mostly old band t-shirts and forgotten socks. You nearly fall headfirst, narrowly avoiding a collision with the bedside table. This day is off to a truly terrible start.\n\nFully awake and fueled by a mixture of panic and excitement, you're now determined to secure a copy of Lionel Richie's new album. The chain record store in the city centre – 'Spin City' – is the obvious first stop. It's time to begin your quest. ",
      "choices": [
        {
          "content": "Consider a quick shower – wouldn't want to offend anyone's nostrils.",
          "entry_id": "chain_store_letdown_entry_1a"
        },
        {
          "content": "Grab a quick coffee – need the caffeine boost for this mission.",
          "entry_id": "chain_store_letdown_entry_1b"
        }
      ],
      "end": null
    },
    "chain_store_letdown_entry_1a": {
      "entry_id": "chain_store_letdown_entry_1a",
      "content": "You contemplate a quick shower, picturing the refreshing spray washing away the sleep-induced fog. But no, time is of the essence! Every second counts in the quest for the new Lionel Richie album. You decide to forgo the hygiene and embrace the urgency. You're still in your bedroom, perhaps smelling slightly of sleep and desperation.",
      "choices": [
        {
          "content": "Wonder if showering would have somehow brought you good Richie-finding luck.",
          "entry_id": "e4382"
        },
        {
          "content": "Check your hair in the mirror – gotta look presentable, even if you're a bit ripe.",
          "entry_id": "e9444"
        }
      ],
      "end": null
    },
    "alarming_announcement_entry_2b": {
      "entry_id": "alarming_announcement_entry_2b",
      "content": "You blindly reach for the radio, desperate to silence the DJ's intrusive cheer. Sleep is precious! But your clumsy fingers only manage to make things worse. You accidentally crank the volume up, sending a deafening blast of 'All Night Long' ricocheting around the room.",
      "choices": [
        {
          "content": "Stumble out of bed to try and turn it down again.",
          "entry_id": "e1bca"
        },
        {
          "content": "Succumb to the music's infectious rhythm.",
          "entry_id": "ed71a"
        }
      ],
      "end": null
    },
    "e1bca": {
      "entry_id": "e1bca",
      "content": "The sudden, deafening burst of Lionel sends a jolt through your system, instantly dispelling any lingering sleepiness. Ears ringing, you finally manage to wrestle the volume knob back under control. The radio now whispers its unwelcome news.\n\nSleep defeated, you drag yourself up, burying your face in a pillow in a futile attempt to recapture a few more moments of peace. But the insistent whisper of Lionel's music, now a personal affront, is impossible to ignore. The nagging feeling that today is *the* day is hard to shake. The DJ is now plugging 'Spin City' record store and a 'special promotion'.",
      "choices": [
        {
          "content": "Grumble and listen to the radio.",
          "entry_id": "e1958"
        },
        {
          "content": "Try to drift back to sleep anyway.",
          "entry_id": "e0306"
        }
      ],
      "end": null
    },
    "e0306": {
      "entry_id": "e0306",
      "content": "Despite your best efforts, you drift back into a fitful doze. You dream of dancing on the ceiling with Lionel Richie, but even in your dream state, a nagging feeling of forgotten responsibilities casts a shadow. The dream quickly fades.\n\nThe radio DJ's announcement, now just a faint echo, hits you with the force of a cold bucket of water. You completely forgot! Today is the release day of Lionel Richie's new album, and you haven't even pre-ordered a copy. You are failing as a true fan in Wolverhampton. Panic sets in.",
      "choices": [
        {
          "content": "Leap out of bed, ready to face the music.",
          "entry_id": "alarming_announcement_entry_3a"
        },
        {
          "content": "Try to calmly assess the damage.",
          "entry_id": "alarming_announcement_entry_3b"
        }
      ],
      "end": null
    },
    "alarming_announcement_entry_3b": {
      "entry_id": "alarming_announcement_entry_3b",
      "content": "You take a deep breath, attempting to calmly assess the situation. Panicking won't get you anywhere. You *can* still get a copy of the new album, surely? Optimism, however fragile, flickers in your heart. A plan begins to form.",
      "choices": [
        {
          "content": "Take a moment for a luxurious stretch and yawn.",
          "entry_id": "e66e7"
        },
        {
          "content": "Grab your phone to check for local news on the album release.",
          "entry_id": "efe0b"
        }
      ],
      "end": null
    },
    "chain_store_letdown_entry_1b": {
      "entry_id": "chain_store_letdown_entry_1b",
      "content": "You decide a quick coffee is non-negotiable. Stumbling into the tiny kitchenette in your Wolverhampton bedroom, you spoon instant granules into a chipped mug, the aroma barely cutting through the lingering scent of sleep. The kettle screeches, and you pour the boiling water, the dark liquid promising focus.",
      "choices": [
        {
          "content": "Chuck in a spoonful of Tate & Lyle.",
          "entry_id": "e3881"
        },
        {
          "content": "Bravely take a scalding sip.",
          "entry_id": "e8e0f"
        }
      ],
      "end": null
    },
    "e3881": {
      "entry_id": "e3881",
      "content": "You hover the sugar bowl over your mug, then think better of it. You need clarity, not a sugar rush. A pure, unadulterated caffeine hit is the order of the day. You down the coffee in three burning gulps and grab your keys, ready to face Wolverhampton. \n\nThe 'Spin City' chain store looms before you, a glass and steel temple to chart-topping mediocrity. Inside, the air hums with generic pop music. You spot a young employee with carefully sculpted hair behind the counter. 'Lionel Richie's new album?' you ask, hopefully. He barely glances up from his phone. After a cursory tap on the keyboard, he delivers the blow. 'Sold out. Pre-orders, limited stock, you know how it is.'",
      "choices": [
        {
          "content": "Scan the racks for a 'Now That's What I Call Lionel!' compilation.",
          "entry_id": "chain_store_letdown_entry_2c"
        },
        {
          "content": "Briefly consider asking if he knows any other Wolverhampton record shops that might have it.",
          "entry_id": "chain_store_letdown_entry_2b"
        },
        {
          "content": "Overhear a disgruntled customer complaining about Ed Sheeran.",
          "entry_id": "chain_store_letdown_entry_2a"
        }
      ],
      "end": null
    },
    "chain_store_letdown_entry_2c": {
      "entry_id": "chain_store_letdown_entry_2c",
      "content": "Your gaze drifts to a brightly coloured display nearby. Nestled amongst the Sam Smith and Taylor Swift CDs, you spot a 'Now That's What I Call Lionel!' compilation. It's a tempting fallback option, a comforting reminder of past glories. But it's not the new album, is it?",
      "choices": [
        {
          "content": "Flick through the tracklist, hoping for a rare B-side.",
          "entry_id": "e1991"
        },
        {
          "content": "Start humming 'Dancing on the Ceiling' under your breath.",
          "entry_id": "edef7"
        }
      ],
      "end": null
    },
    "e1991": {
      "entry_id": "e1991",
      "content": "You scan the tracklist on the back of the compilation, your eyes darting for hidden gems. Maybe there's a live recording, an extended mix, something to justify the purchase. But no, it's just the usual hits. 'Hello', 'Easy', 'Three Times a Lady'... classics, sure, but nothing new.\n\nYou step out of 'Spin City' and onto the busy Wolverhampton street. The weight of your failure begins to sink in. The new album is proving elusive. This isn't going to be as easy as you thought. The Wolverhampton music scene suddenly feels a lot more challenging.\n\n'Spin City' recedes behind you, its generic facade blending into the cityscape. You start walking north, towards the University Quarter, where a smaller, independent record shop might offer a glimmer of hope.",
      "choices": [
        {
          "content": "Whip out your phone and search for other record stores in Wolverhampton.",
          "entry_id": "ef882"
        },
        {
          "content": "Continue towards the University Quarter.",
          "entry_id": "e06ef"
        }
      ],
      "end": null
    },
    "ef882": {
      "entry_id": "ef882",
      "content": "You pull out your phone and tap furiously, searching for 'record shops Wolverhampton'. Google Maps spits out a list, but most are too far out of the city centre to be practical. Except for 'Vinyl Vortex', nestled in the heart of the student area. It's worth a shot.\n\n'Vinyl Vortex' is a different world. The air is thick with the smell of incense and old vinyl. Psychedelic posters adorn the walls, and obscure indie bands blare from the speakers. A long-haired employee with multiple piercings stands behind the counter, looking supremely unimpressed with everything.",
      "choices": [
        {
          "content": "Rummage through the racks of limited edition vinyl.",
          "entry_id": "e3283"
        },
        {
          "content": "Check out the poster for a local band, 'Concrete Canary'.",
          "entry_id": "e4dc5"
        }
      ],
      "end": null
    },
    "chain_store_letdown_entry_2a": {
      "entry_id": "chain_store_letdown_entry_2a",
      "content": "While the employee taps away at his phone, you overhear another customer nearby. He's red-faced and muttering about the 'pathetic' vinyl selection. \"Honestly,\" he says to himself, loud enough for you to hear, \"they call this a record shop? They haven't got anything beyond Ed Sheeran!\"",
      "choices": [
        {
          "content": "Nod in agreement and subtly roll your eyes at the employee.",
          "entry_id": "e4b30"
        },
        {
          "content": "Consider starting a vinyl collection to broaden your music horizons.",
          "entry_id": "e0203"
        }
      ],
      "end": null
    },
    "e4b30": {
      "entry_id": "e4b30",
      "content": "You share a knowing look with the disgruntled customer. Vinyl is the superior format, everyone knows that. Although this small act of solidarity does little to improve your mood, or your chances of finding the album. Disappointment washes over you as you leave the 'Spin City' chain store. The Wolverhampton music scene suddenly seems a lot more challenging than you first thought. \n\nThe 'Spin City' chain store fades into the background as you start walking. You decide to head towards the University Quarter, hoping an independent record store might have better luck, but first, you need a plan.",
      "choices": [
        {
          "content": "Check your phone for alternative record shops in Wolverhampton.",
          "entry_id": "ef882"
        },
        {
          "content": "Continue towards the University Quarter.",
          "entry_id": "e06ef"
        }
      ],
      "end": null
    },
    "e06ef": {
      "entry_id": "e06ef",
      "content": "You pause to listen to a busker outside 'Spin City'. He's strumming a slightly off-key rendition of \"Easy Like Sunday Morning\" on an acoustic guitar. He's giving it his all, but it doesn't really lift your spirits. The thought of finding that Lionel Richie album is still paramount. You decide to move on towards the University Quarter, hoping for better luck.\n\nYou arrive at 'Vinyl Vortex', an independent record store nestled amongst the cafes and student flats of the University Quarter. The air is thick with the smell of incense and something vaguely herbal. The walls are plastered with vinyl records and posters for local bands you've never heard of, and there's a distinct lack of anything mainstream or 'pop'.",
      "choices": [
        {
          "content": "Browse the seemingly endless racks of vinyl.",
          "entry_id": "e3283"
        },
        {
          "content": "Check out the poster for local band, 'Concrete Canary'.",
          "entry_id": "e4dc5"
        }
      ],
      "end": null
    },
    "e3283": {
      "entry_id": "e3283",
      "content": "You scan the vinyl selection, noticing a distinct lack of anything resembling Lionel Richie. There's plenty of obscure indie bands, classic rock, and even a surprisingly large selection of polka records, but no sign of anything remotely resembling \"Dancing on the Ceiling\". You approach the counter, where a long-haired employee with multiple piercings is meticulously cleaning a record with a soft cloth.\n\nYou ask the employee about the new Lionel Richie album. He stops cleaning the record and gives you a slightly surprised look. \"Lionel Richie?\" he says, checking a list behind the counter. \"Blimey, we had a few copies in this morning, but they all sold out. Didn't expect that much demand for him, to be honest.\"\n\nYou remain in 'Vinyl Vortex', having already tried another record store earlier today.",
      "choices": [
        {
          "content": "Ask the employee if he knows where to find the album online.",
          "entry_id": "eda28"
        },
        {
          "content": "Listen to the employee complain about hipsters buying up all the vinyl.",
          "entry_id": "e45c1"
        }
      ],
      "end": null
    },
    "eda28": {
      "entry_id": "eda28",
      "content": "The employee suggests checking online marketplaces like Discogs or eBay. \"You might get lucky,\" he says, with a hint of skepticism. You sigh, explaining that you're really hoping to find a physical copy today. He shrugs and returns to cleaning his record.\n\nYou leave 'Vinyl Vortex' feeling more concerned than ever. The album is proving stubbornly elusive. You've already tried one record store, with no luck. You stand on the pavement outside the shop, considering your next move. Should you try that dusty second-hand vinyl shop down the alley, or investigate the rumours you heard about new albums turning up at a local charity shop?",
      "choices": [
        {
          "content": "Head to the local charity shop, hoping the rumours are true.",
          "entry_id": "charity_shop_rumours_entry_charity_start"
        },
        {
          "content": "Brave the depths of the second-hand vinyl shop down the alley.",
          "entry_id": "dusty_depths_entry_dusty_start"
        }
      ],
      "end": null
    },
    "chain_store_letdown_entry_2b": {
      "entry_id": "chain_store_letdown_entry_2b",
      "content": "You briefly consider asking the disinterested employee if they know of any other record stores in Wolverhampton that might have the album, but his glazed-over expression suggests he wouldn't know or care if Lionel Richie himself walked through the door. His world begins and ends with whatever's trending on TikTok, you suspect. Best not to waste your breath.",
      "choices": [
        {
          "content": "Vow to search for record stores on your phone later, away from his judgemental gaze.",
          "entry_id": "e17b1"
        },
        {
          "content": "Remember a friend mentioning a cool record store near the university, full of 'vinyls' and 'vibes'.",
          "entry_id": "ebbc6"
        }
      ],
      "end": null
    },
    "e17b1": {
      "entry_id": "e17b1",
      "content": "You decide to look up a map of Wolverhampton's record stores on your phone later, hoping to find some hidden gems 'Spin City' wouldn't even know about. Places that understand the *true* artistry of Lionel. You exit the chain record store, a wave of disappointment washing over you. The realization that the album might be harder to find than expected begins to sink in. The Wolverhampton music scene suddenly seems a lot more challenging.\n\nYou exit the chain store, feeling deflated. The album is proving harder to find than expected. You begin walking towards the student area, hoping an independent record store might have better luck. The generic pop music from 'Spin City' fades into the background.",
      "choices": [
        {
          "content": "Whip out your phone and frantically search for 'record shops Wolverhampton' before you forget.",
          "entry_id": "ef882"
        },
        {
          "content": "Continue towards the University Quarter.",
          "entry_id": "e06ef"
        }
      ],
      "end": null
    },
    "e4dc5": {
      "entry_id": "e4dc5",
      "content": "You notice a poster advertising a local indie band called 'Concrete Canary' playing at the 'Slade Rooms' venue next week. The poster features a blurry black and white photo of the band members looking suitably angst-ridden. You briefly wonder if the band members might have a secret stash of the new Lionel Richie album, perhaps as an ironic statement, but dismiss the thought as highly unlikely.\n\nYou approach the counter and ask the Independent Record Store Employee about the new Lionel Richie album. The employee checks a list with a slightly surprised expression. \"Lionel Richie? Blimey, we had a few copies in this morning, but they all sold out. Didn't expect that much demand for him, to be honest.\"\n\nYou remain in 'Vinyl Vortex', having already tried another record store earlier today.",
      "choices": [
        {
          "content": "Probe the employee about where else you might find the album, perhaps online.",
          "entry_id": "eda28"
        },
        {
          "content": "Overhear the employee gossiping to a colleague about the day's unusual sales.",
          "entry_id": "e45c1"
        }
      ],
      "end": null
    },
    "e45c1": {
      "entry_id": "e45c1",
      "content": "You overhear the employee talking to a colleague in hushed tones. \"Yeah, Lionel Richie...sold out in hours. Apparently, there's a rumour going around that some local superfan bought up all the stock. Crazy, innit? They're saying he's got a lock-up full of them somewhere in Bilston.\"\n\nYou exit 'Vinyl Vortex', feeling more concerned than ever. The album is proving stubbornly elusive. You've already tried one record store, with no luck. You consider your next move. Should you brave the depths of that dusty second-hand vinyl shop down the alley, or investigate the rumours about new albums turning up at a local charity shop?",
      "choices": [
        {
          "content": "Follow up on the charity shop lead.",
          "entry_id": "charity_shop_rumours_entry_charity_start"
        },
        {
          "content": "Plunge into the second-hand shop.",
          "entry_id": "dusty_depths_entry_dusty_start"
        }
      ],
      "end": null
    },
    "charity_shop_win_entry_donate": {
      "entry_id": "charity_shop_win_entry_donate",
      "content": "Elated by your unexpected find, you feel a surge of goodwill. A collection tin sits on the counter, overflowing with spare change. You spot a faded sign explaining the charity supports local musicians in Wolverhampton. It feels like the right thing to do.",
      "choices": [
        {
          "content": "Head outside and quickly scan the CD.",
          "entry_id": "ebfaf"
        },
        {
          "content": "Drop some coins into the collection tin.",
          "entry_id": "ee61c"
        }
      ],
      "end": null
    },
    "ebfaf": {
      "entry_id": "ebfaf",
      "content": "You briefly consider slipping the CD out of its case and holding it up to the light, checking for scratches. But you decide against it; better to wait until you get home and can blast it out on your stereo, the way Lionel intended.\n\nClutching the album tightly, you stand on the Wolverhampton pavement outside the shop. It feels substantial, weighty – the perfect reward for a morning's hard work.",
      "choices": [
        {
          "content": "Step out into the sunshine, humming 'Dancing on the Ceiling'.",
          "entry_id": "ec22a"
        },
        {
          "content": "Check the bus timetable at the stop across the road.",
          "entry_id": "e79cb"
        }
      ],
      "end": null
    },
    "ec22a": {
      "entry_id": "ec22a",
      "content": "The sun, breaking through the clouds over Wolverhampton, seems to celebrate your victory. You grin, feeling utterly triumphant. You've done it. You secured the new Lionel Richie album.\n\nYour quest is complete. You pause outside the charity shop, savouring the moment. Wolverhampton, and the world, are yours!",
      "choices": [],
      "end": "win"
    },
    "e2d56": {
      "entry_id": "e2d56",
      "content": "For a fleeting moment, you consider giving up the physical quest and resorting to streaming. But the thought is quickly banished. A true fan celebrates release day with a tangible copy! Your mind flicks back to a second-hand record shop tucked away down a back alley off Dudley Street. It's a long shot, but you're running out of options.",
      "choices": [
        {
          "content": "Stop to look at the poster for a local band, weighing your options.",
          "entry_id": "e2068"
        },
        {
          "content": "Carefully step around a precarious stack of milk crates on the pavement.",
          "entry_id": "eac7f"
        },
        {
          "content": "Follow a strange smell wafting from a doorway, which you think is coming from the record shop.",
          "entry_id": "ecf3e"
        }
      ],
      "end": null
    },
    "e2068": {
      "entry_id": "e2068",
      "content": "As you turn into the alley, a tattered poster catches your eye. 'The Manky Ponchos' are playing at 'The Dog & Doublet' next week. You briefly consider checking it out – a distraction from your Richie-related woes. But no, focus! The album awaits.\n\nYou finally arrive at the second-hand record shop. Piles of vinyl, CDs, and tapes are crammed into every available space, visible through the grime-streaked window. It smells faintly of dust, damp cardboard, and forgotten dreams.",
      "choices": [
        {
          "content": "Notice the barely-hanging, faded \"Open\" sign, then push the door open.",
          "entry_id": "ea296"
        },
        {
          "content": "Hesitantly push the door open and enter the shop.",
          "entry_id": "ed493"
        },
        {
          "content": "Take a peek through the window first.",
          "entry_id": "dusty_depths_entry_dusty_exterior_option3"
        }
      ],
      "end": null
    },
    "ea296": {
      "entry_id": "ea296",
      "content": "You notice a faded \"Open\" sign hanging crookedly in the window, barely attached by one rusty nail. It looks like it's been there since the 80s, probably around the time Lionel was at his peak. You push the door open, a bell tinkling faintly above your head, announcing your arrival.\n\nInside, the shop is even more cluttered than it appeared from the outside. The owner, a slightly dishevelled man with a long beard, is engrossed in sorting through a stack of jazz records behind the counter. He seems completely oblivious to your presence, lost in his own world of bebop and blues. Given his lack of awareness of current music, you don't hold out much hope of him having the new Lionel Richie album.",
      "choices": [
        {
          "content": "Examine a box overflowing with old cassette tapes, then leave the shop.",
          "entry_id": "e9ecf"
        },
        {
          "content": "Leave the shop and head to the Wolverhampton Outdoor Market.",
          "entry_id": "ed564"
        }
      ],
      "end": null
    },
    "e9ecf": {
      "entry_id": "e9ecf",
      "content": "Before admitting defeat and leaving the second-hand record shop, you idly flick through a box of old cassette tapes near the door. You spot a few 80s classics: *Rio* by Duran Duran, *True* by Spandau Ballet. A pang of nostalgia hits, but these relics won't help you secure the new Lionel Richie album.\n\nEmerging from the shop, you find yourself in the bustling Wolverhampton Outdoor Market. A wave of sounds and smells washes over you – the shouts of vendors hawking their wares, the aroma of frying onions, the general hubbub of shoppers. Amidst the fruit and veg stalls and clothing vendors, you spot various places to browse.",
      "choices": [
        {
          "content": "Browse the colourful fruit displays.",
          "entry_id": "e6ca4"
        },
        {
          "content": "Listen to the busker's rendition of a classic hit.",
          "entry_id": "ee22c"
        },
        {
          "content": "Head towards a DVD stall and avoid a rogue shopping trolley hurtling through the crowd.",
          "entry_id": "e7e9f"
        }
      ],
      "end": null
    },
    "dusty_depths_entry_dusty_exterior_option3": {
      "entry_id": "dusty_depths_entry_dusty_exterior_option3",
      "content": "You squint through the grime-covered window, trying to penetrate the gloom. Inside, it's even more chaotic than you imagined: leaning towers of vinyl, precarious stacks of yellowing magazines, and a general sense of musical entropy. You can barely make out a path through the labyrinth of forgotten sounds.",
      "choices": [
        {
          "content": "Spot the faded \"Open\" sign, hanging by a thread, and push the door open.",
          "entry_id": "ea296"
        },
        {
          "content": "Hesitantly brave the chaos and step inside.",
          "entry_id": "ed493"
        }
      ],
      "end": null
    },
    "ed493": {
      "entry_id": "ed493",
      "content": "You hesitate, one hand hovering over the door handle. This place looks like a black hole for new releases. Still, with options dwindling, you push open the door. A rusty bell jingles overhead, barely audible above the muffled strains of jazz. Inside, a dishevelled man with a ZZ Top beard is hunched over a stack of vinyl, seemingly oblivious to your arrival. He's more likely to know obscure B-sides from the 60s than the latest Lionel Richie album.\n\nRealising this shop is a dead end for finding the new Lionel Richie album, you leave and head to Wolverhampton's outdoor market, hoping for a stroke of luck.",
      "choices": [
        {
          "content": "Examine the box of old cassette tapes by the door, then leave the shop.",
          "entry_id": "e9ecf"
        },
        {
          "content": "Leave the shop and listen in on the snippets of market-goers' conversations.",
          "entry_id": "ed564"
        }
      ],
      "end": null
    },
    "ed564": {
      "entry_id": "ed564",
      "content": "As you step back outside, you overhear two shoppers complaining about the council's new parking restrictions on market days. You tune out their grumbles; parking permits are the least of your worries right now. You need Lionel.\n\nEmerging from the shop, you arrive at the bustling Wolverhampton Outdoor Market. A cacophony of sounds and smells assaults your senses – the shouts of vendors, the aroma of frying onions, the general hustle and bustle of shoppers. Amongst the fruit and veg stalls and clothing vendors, you spot various places to browse.",
      "choices": [
        {
          "content": "Browse the colourful fruit displays.",
          "entry_id": "e6ca4"
        },
        {
          "content": "Listen to the busker's off-key rendition of \"Easy Like Sunday Morning\".",
          "entry_id": "ee22c"
        },
        {
          "content": "Head towards a DVD stall and dodge the rogue shopping trolley careening through the crowd.",
          "entry_id": "e7e9f"
        }
      ],
      "end": null
    },
    "e6ca4": {
      "entry_id": "e6ca4",
      "content": "Drawn in by the vibrant colours, you pause at a fruit stall piled high with plums, peaches, and nectarines. You briefly consider buying a punnet of juicy local plums, but the thought of Lionel Richie snaps you back to reality. Fruit can wait; Richie can't.\n\nYou approach the makeshift CD stall. The stallholder, a shifty-looking character with a gold tooth and a knowing glint in his eye, is meticulously arranging his wares. You take a deep breath and ask: 'Got the new Lionel Richie album, by any chance?' The stallholder's expression changes, and he glances around nervously.",
      "choices": [
        {
          "content": "Watch the stallholder's reaction closely as you mention Lionel Richie.",
          "entry_id": "e79e2"
        },
        {
          "content": "Scan the DVDs on display while the stallholder considers your question.",
          "entry_id": "ecb42"
        }
      ],
      "end": null
    },
    "e79e2": {
      "entry_id": "e79e2",
      "content": "The stallholder's eyes dart left and right, like a startled rabbit, before he leans in conspiratorially. His sudden caution only heightens your suspicion – is this a legitimate business, or something a little more…under the table?\n\nYou are now fully engaged with the shifty market stallholder, having inquired about the elusive Lionel Richie album. Your search has led you to a potentially untrustworthy source in the heart of Wolverhampton market. However, he avoids giving you a straight answer, and you're left feeling unsure about your next move.",
      "choices": [
        {
          "content": "Give up on the market and head to the \"Dancing on the Ceiling\" pub.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_1"
        },
        {
          "content": "Press him about the possibility of a \"secret stash\".",
          "entry_id": "secret_storage_unit_entry_market_stall_approach"
        }
      ],
      "end": null
    },
    "secret_storage_unit_entry_market_stall_chat": {
      "entry_id": "secret_storage_unit_entry_market_stall_chat",
      "content": "You decide to play it cool, attempting to strike up a conversation with the stallholder. You hope to glean some insight into the local music scene. Maybe someone knows something about the scarcity of the new Lionel Richie album, or maybe they can point you in the right direction.",
      "choices": [
        {
          "content": "Probe the stallholder about the vinyl collecting scene in Wolverhampton.",
          "entry_id": "e5fc4"
        },
        {
          "content": "Ask about local Wolverhampton bands, and any success they've had.",
          "entry_id": "ece73"
        }
      ],
      "end": null
    },
    "e5fc4": {
      "entry_id": "e5fc4",
      "content": "You try to subtly steer the conversation towards the local vinyl collecting community. You mention your quest for the new Lionel Richie album, hoping someone might have a lead on where to find rare or hard-to-find records.\n\nJust as you're about to write the stallholder off as a dead end, he leans in, his gold tooth glinting in the Wolverhampton sunlight. He whispers that he might know someone who has a 'stash' of albums in a storage unit on the outskirts of town. He pauses, then adds, 'Information like that doesn't come free, mate.'",
      "choices": [
        {
          "content": "Press him for more details about this 'Mick' and the storage unit.",
          "entry_id": "secret_storage_unit_entry_ask_details"
        },
        {
          "content": "Express your doubt about the legitimacy of the 'stash' and the dodgy contact.",
          "entry_id": "secret_storage_unit_entry_express_doubt"
        },
        {
          "content": "Try to haggle with the stallholder over the price.",
          "entry_id": "secret_storage_unit_entry_haggle_price"
        }
      ],
      "end": null
    },
    "secret_storage_unit_entry_ask_details": {
      "entry_id": "secret_storage_unit_entry_ask_details",
      "content": "Before handing over any cash, you decide to press the stallholder for more concrete information about this 'Mick' character and his alleged storage unit stash. You need to assess the risk before getting your hopes up.",
      "choices": [
        {
          "content": "Wait and hear what details the stallholder is willing to provide about the contact.",
          "entry_id": "e76a5"
        },
        {
          "content": "Listen carefully as the stallholder whispers specific details about Mick, the contact.",
          "entry_id": "ef737"
        }
      ],
      "end": null
    },
    "e76a5": {
      "entry_id": "e76a5",
      "content": "The stallholder's description of 'Mick' is vague and unconvincing. He mumbles something about a 'mate of a mate' who 'deals in stuff'. He can't offer much about the storage unit itself, except that it's 'out by the industrial estate'. The lack of detail only deepens your suspicion that this could be a wild goose chase.\n\nDespite your misgivings, you agree to meet 'Mick'. You follow the stallholder's directions, arriving at a desolate area on the outskirts of Wolverhampton. Your mind races, considering what would cause such a deliberate hoarding or unusual distribution of the album.\n\nA nervous-looking man, presumably Mick, fidgets by a chain-link fence. He's wearing a tracksuit and keeps glancing around. He finally makes eye contact and beckons you over. Mick leads you towards a row of identical, grey storage units.",
      "choices": [
        {
          "content": "Question Mick’s trustworthiness, sensing something is not right.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01a"
        },
        {
          "content": "Try to put Mick at ease and get a feel for the situation by asking him about music.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01b"
        }
      ],
      "end": null
    },
    "secret_storage_unit_entry_inspect_stall": {
      "entry_id": "secret_storage_unit_entry_inspect_stall",
      "content": "The stallholder is watching you closely, so you try to act nonchalant. You scan the haphazard displays, crammed with DVDs of dubious quality and CDs in jewel cases cracked beyond repair. You're looking for anything that might hint at a secret stash – an unusual price tag, a hastily scribbled note, anything out of the ordinary.",
      "choices": [
        {
          "content": "Examine the price tags attached to the CDs, looking for any unusual deals.",
          "entry_id": "ed013"
        },
        {
          "content": "Search for other bootleg albums, hoping their presence might lead to the new Lionel Richie release.",
          "entry_id": "e1662"
        }
      ],
      "end": null
    },
    "ed013": {
      "entry_id": "ed013",
      "content": "You scrutinise the price tags, most of which seem to have been written with the same thick marker pen. '2 for £5' screams a handwritten sign above a pile of Robbie Williams albums. Then, tucked away behind a stack of Now That's What I Call Music compilations, you spot a CD with no price tag at all. As you reach for it, the stallholder leans in close, a conspiratorial glint in his eye. 'Alright, mate,' he whispers, 'I might know someone who's got a stash of albums in a storage unit on the outskirts of town. But information like that comes at a price.'",
      "choices": [
        {
          "content": "Press him for more details about the contact, hoping to get a better sense of the situation.",
          "entry_id": "secret_storage_unit_entry_ask_details"
        },
        {
          "content": "Express your doubt about the legitimacy of this 'stash' and the stallholder's motives.",
          "entry_id": "secret_storage_unit_entry_express_doubt"
        },
        {
          "content": "Try and haggle with the stallholder over the price of the information.",
          "entry_id": "secret_storage_unit_entry_haggle_price"
        }
      ],
      "end": null
    },
    "secret_storage_unit_entry_express_doubt": {
      "entry_id": "secret_storage_unit_entry_express_doubt",
      "content": "You raise an eyebrow, unconvinced. 'A stash, eh? Sounds a bit dodgy to me. And this 'mate' of yours – is he likely to be on the level?' You want to make sure you're not being taken for a ride before you get your hopes up.",
      "choices": [
        {
          "content": "See if the stallholder backs down in light of your skepticism.",
          "entry_id": "e4bb4"
        },
        {
          "content": "Watch the stallholder closely, to see if he tries to reassure you about the situation.",
          "entry_id": "ed2b5"
        }
      ],
      "end": null
    },
    "e4bb4": {
      "entry_id": "e4bb4",
      "content": "The stallholder's face hardens. 'Alright, mate, suit yourself,' he says, turning away to rearrange his stock. 'Plenty of other people looking for that album.' You start to wonder if you've made a mistake by questioning him – perhaps he really did have a lead. \n\nYou follow the directions provided by the market stallholder, arriving at a desolate area on the outskirts of Wolverhampton. A nervous-looking man, presumably Mick, fidgets by a chain-link fence. He glances around before making eye contact and beckons you over. Mick leads you toward a row of identical, grey storage units.",
      "choices": [
        {
          "content": "Question Mick’s trustworthiness, sensing that something is not quite right.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01a"
        },
        {
          "content": "Attempt to make small talk about music with Mick, trying to put him at ease.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01b"
        }
      ],
      "end": null
    },
    "storage_unit_stash_entry_storage_unit_01a": {
      "entry_id": "storage_unit_stash_entry_storage_unit_01a",
      "content": "You watch Mick carefully as he fiddles with the lock on the storage unit. He avoids your gaze, his Adam's apple bobbing nervously. There's something definitely off about this whole situation. You can't shake the feeling that you're walking into something you might regret. Is Mick simply nervous, or is he leading you into a trap?",
      "choices": [
        {
          "content": "Subtly observe Mick’s behaviour, looking for more clues about his true intentions.",
          "entry_id": "e5df8"
        },
        {
          "content": "Consider Mick’s connection to the stallholder, wondering if he is trustworthy.",
          "entry_id": "edc33"
        }
      ],
      "end": null
    },
    "secret_storage_unit_entry_haggle_price": {
      "entry_id": "secret_storage_unit_entry_haggle_price",
      "content": "The stallholder names his price for the contact: a tenner. You wince. A tenner for a name and a vague promise of a 'stash'? Still, you've come this far. You decide to try your luck and haggle the price, hoping you can get a better deal before committing to this potentially dodgy lead.",
      "choices": [
        {
          "content": "Reluctantly pay the tenner, accepting you're not going to get a better deal.",
          "entry_id": "e53bd"
        },
        {
          "content": "Try and knock a couple of quid off the price of the contact.",
          "entry_id": "e1606"
        }
      ],
      "end": null
    },
    "e53bd": {
      "entry_id": "e53bd",
      "content": "Your attempt at haggling fails. The stallholder is unmoved by your pleas and insists on the full tenner. Grumbling, you hand over the money, feeling slightly ripped off but determined to pursue this lead regardless.\n\nArmed with the contact details, you follow the stallholder's directions to a desolate industrial estate on the outskirts of Wolverhampton. You wonder if this whole thing is a scam, but you keep driving on. A nervous-looking man, presumably Mick, fidgets by a chain-link fence. He glances around before making eye contact and beckons you over. Mick leads you toward a row of identical, grey storage units.",
      "choices": [
        {
          "content": "Question Mick’s nervous behaviour, wondering if you should trust him.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01a"
        },
        {
          "content": "Attempt to start a friendly conversation about music with Mick, trying to get a feel for the situation.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01b"
        }
      ],
      "end": null
    },
    "storage_unit_stash_entry_storage_unit_01b": {
      "entry_id": "storage_unit_stash_entry_storage_unit_01b",
      "content": "Hoping to ease the tension, you ask Mick what his favourite Lionel Richie song is. Mick visibly tenses up, his eyes darting around the industrial estate. He seems completely uninterested in discussing music, or anything else for that matter, and mumbles something about needing to be quick before anyone sees. He seems more concerned with getting the transaction done quickly.",
      "choices": [
        {
          "content": "Realise Mick's not interested in chatting and focus on finding the albums.",
          "entry_id": "e891c"
        },
        {
          "content": "Push Mick for an answer, insisting that you can't trust someone who doesn't appreciate 'Dancing on the Ceiling'.",
          "entry_id": "e9323"
        }
      ],
      "end": null
    },
    "e891c": {
      "entry_id": "e891c",
      "content": "You realise that Mick is only interested in one thing: getting paid and getting out. Any attempt at conversation is pointless. He just wants to get this over with. He nods towards a specific unit, number 23.\n\nMick fumbles with a set of keys, finally unlocking the unit. The door creaks open, revealing a dimly lit space packed floor-to-ceiling with cardboard boxes of various sizes. The air is thick with the smell of damp cardboard and dust, with a faint hint of something else in the air. It seems like a lot of merchandise for one person.",
      "choices": [
        {
          "content": "Consider the implications of finding so many albums, wondering if Mick is doing something illegal.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02b"
        },
        {
          "content": "Sense that Mick is hiding something, adding to your growing unease and the feeling that something isn't right.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02c"
        },
        {
          "content": "Try to identify the strange smell, wondering what else is in the unit.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02a"
        }
      ],
      "end": null
    },
    "storage_unit_stash_entry_storage_unit_02b": {
      "entry_id": "storage_unit_stash_entry_storage_unit_02b",
      "content": "The sheer number of boxes is overwhelming. Who would need this many copies of a single album? Is this a legitimate business, or something far more sinister? The thought of Mick’s nervous glances and the stallholder's shifty demeanor only adds to your unease. You feel increasingly on edge.",
      "choices": [
        {
          "content": "Imagine a secret society of Lionel Richie superfans, hoarding all the albums for themselves.",
          "entry_id": "e375f"
        },
        {
          "content": "Recall news stories about counterfeit goods being sold at markets in Wolverhampton.",
          "entry_id": "ebc6d"
        }
      ],
      "end": null
    },
    "storage_unit_stash_entry_storage_unit_02a": {
      "entry_id": "storage_unit_stash_entry_storage_unit_02a",
      "content": "A strange, acrid smell stings your nostrils, a disconcerting mix of damp cardboard and something that smells vaguely like burning plastic. It hangs heavy in the air, making your eyes water slightly. You wrinkle your nose, wondering what could possibly be causing such a bizarre odour in this Wolverhampton storage unit.",
      "choices": [
        {
          "content": "Consider calling the police and reporting the smell.",
          "entry_id": "e0876"
        },
        {
          "content": "Wonder if the smell is somehow tainting the precious Lionel Richie albums.",
          "entry_id": "ebdf0"
        }
      ],
      "end": null
    },
    "e0876": {
      "entry_id": "e0876",
      "content": "A fleeting thought crosses your mind: should you contact the police about that strange smell? This whole situation feels wrong, like something's not quite right about this whole operation. But the burning desire for the album outweighs your apprehension. You decide to wait and see what Mick reveals.\n\nWith a grunt, Mick pulls out a rusty box cutter and slices open one of the cardboard boxes. He peels back the flaps, revealing dozens of sealed copies of the new Lionel Richie album, gleaming under the dim light. Behind the boxes, you see a stack of obsolete 8-track tapes, gathering dust. You're surrounded by a mountain of Richie, a hidden hoard that begs the question: why is it here, and why is it so hard to find elsewhere in Wolverhampton?\n\nYou stand inside the dimly lit storage unit on the outskirts of Wolverhampton. Brown boxes upon boxes of the new Lionel Richie album surround you, a testament to the unexpected scale of this operation. Mick, the contact from the market stall, leans against a stack, waiting. You need to secure a copy.",
      "choices": [
        {
          "content": "Try to quickly count how many albums are stacked in the unit, ready to begin negotiations.",
          "entry_id": "e537a"
        },
        {
          "content": "Take a quick look around the storage unit, trying to memorize the layout.",
          "entry_id": "ea336"
        }
      ],
      "end": null
    },
    "e537a": {
      "entry_id": "e537a",
      "content": "You try to quickly gauge the number of boxes. It's difficult to get an exact count in the low light, but there must be hundreds, maybe even thousands, of Lionel Richie's new album here. It's a staggering amount, and makes the 'sold out' status at the city centre chain store seem even more suspicious. What's going on in Wolverhampton?\n\nYou begin negotiations with Mick. Sensing your genuine enthusiasm, Mick softens and agrees to sell you a copy for what seems like a reasonable price.",
      "choices": [
        {
          "content": "Compliment Mick on his excellent musical taste.",
          "entry_id": "storage_unit_win_entry_negotiation_c"
        },
        {
          "content": "Ask Mick where all the albums came from in the first place.",
          "entry_id": "ed543"
        },
        {
          "content": "Attempt to haggle for a lower price.",
          "entry_id": "e51ae"
        }
      ],
      "end": null
    },
    "storage_unit_win_entry_negotiation_c": {
      "entry_id": "storage_unit_win_entry_negotiation_c",
      "content": "You try to build rapport by complimenting Mick on his apparent excellent musical taste, given the sheer volume of Lionel Richie albums. Mick remains unimpressed, giving a noncommittal shrug and a barely perceptible eye roll. He seems more interested in getting you out of here than discussing 'Dancing on the Ceiling'.",
      "choices": [
        {
          "content": "Ask Mick about the source of the albums anyway.",
          "entry_id": "ed543"
        },
        {
          "content": "Try to haggle for a lower price on the album anyway.",
          "entry_id": "e51ae"
        }
      ],
      "end": null
    },
    "ed543": {
      "entry_id": "ed543",
      "content": "You probe Mick about the source of the albums, trying to understand why they are hidden away in a storage unit on the outskirts of Wolverhampton. Mick becomes evasive, repeating that he is just helping out a friend and can't divulge any more information. He glances nervously at the storage unit door.\n\nWith the new Lionel Richie album finally in hand, you prepare to leave the storage unit. Despite securing the album, Mick's vague explanation and the sheer quantity of albums leave a lingering sense of mystery about the whole situation. You wonder if you'll ever get to the bottom of this Richie-related Wolverhampton conspiracy, or if there might be even more stashes like this one...",
      "choices": [
        {
          "content": "Check the album's shrink-wrap, making sure that it's properly sealed.",
          "entry_id": "e8421"
        },
        {
          "content": "Thank Mick for his help, despite all the odd circumstances.",
          "entry_id": "e5e57"
        },
        {
          "content": "Ask Mick if he knows of any other secret stashes of rare music in Wolverhampton.",
          "entry_id": "storage_unit_win_entry_leaving_c"
        }
      ],
      "end": null
    },
    "e375f": {
      "entry_id": "e375f",
      "content": "You try to come up with a plausible explanation, imagining a network of Lionel Richie superfans, all working together to corner the market and drive up the price of the new release. It's a ridiculous thought, but, somehow… plausible, considering the lengths some people go to. \n\nMick pulls out a box cutter with a loud grunt and slices open one of the cardboard boxes. He peels back the flaps, revealing dozens of sealed copies of the new Lionel Richie album, gleaming under the dim light. You're surrounded by a mountain of Richie. It begs the question: why is it here, and why is it so hard to find elsewhere in Wolverhampton?\n\nYou stand inside the dimly lit storage unit on the outskirts of Wolverhampton. Brown boxes upon boxes of the new Lionel Richie album surround you, a testament to the unexpected scale of this operation. Mick, the contact from the market stall, leans against a stack, waiting. You need to secure a copy.",
      "choices": [
        {
          "content": "Try to estimate just how many albums are actually in this unit, ready to begin negotiations.",
          "entry_id": "e537a"
        },
        {
          "content": "Take a glance around the storage unit, noting the layout of the area.",
          "entry_id": "ea336"
        }
      ],
      "end": null
    },
    "ea336": {
      "entry_id": "ea336",
      "content": "Your gaze sweeps across the storage unit, taking in the endless rows of brown boxes. In a dusty corner, you spot a stack of obsolete 8-track tapes, gathering dust - a relic of a bygone musical era. An odd juxtaposition with the pristine, new albums. \n\nYou begin negotiations with Mick. Sensing your genuine enthusiasm, Mick softens and agrees to sell a copy for what seems like a reasonable price. He explains he's just helping a friend who needed temporary storage for some merchandise.",
      "choices": [
        {
          "content": "Compliment Mick on his great taste in music.",
          "entry_id": "storage_unit_win_entry_negotiation_c"
        },
        {
          "content": "Ask Mick about where the albums originally came from.",
          "entry_id": "ed543"
        },
        {
          "content": "Attempt to haggle for a lower price.",
          "entry_id": "e51ae"
        }
      ],
      "end": null
    },
    "e51ae": {
      "entry_id": "e51ae",
      "content": "You try your luck at haggling, but Mick remains firm on the price. However, he relents slightly, offering you a slightly creased, but still official, signed promotional poster as a compromise. \"Go on, it's got Lionel's actual signature on it.\"\n\nWith the new Lionel Richie album now firmly in your grasp, you prepare to leave the storage unit. Despite finally securing the album, Mick's vague explanation and the sheer quantity of albums leave a lingering sense of mystery about the whole situation. You wonder if there might be even more stashes like this one...",
      "choices": [
        {
          "content": "Check the album's seal, just to be sure.",
          "entry_id": "e8421"
        },
        {
          "content": "Thank Mick for his help, despite all the odd circumstances.",
          "entry_id": "e5e57"
        },
        {
          "content": "Ask Mick if he knows of any other secret stashes of rare music in Wolverhampton.",
          "entry_id": "storage_unit_win_entry_leaving_c"
        }
      ],
      "end": null
    },
    "storage_unit_stash_entry_storage_unit_02c1": {
      "entry_id": "storage_unit_stash_entry_storage_unit_02c1",
      "content": "Your eyes dart around the cramped storage unit, finally spotting a small, black security camera tucked into the top corner, its unblinking lens pointed directly at the boxes. Who's watching you, and what are they hoping to see? Is this whole stash a legitimate operation, or are you about to become an unwilling extra in a Wolverhampton-based crime drama?\n\nYou also notice that the boxes are full of Lionel Richie albums.",
      "choices": [
        {
          "content": "Reconsider the sheer number of albums stacked around you, questioning the scale of the operation.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02b"
        },
        {
          "content": "Sniff the air, trying to identify a strange chemical smell permeating the storage unit.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02a"
        }
      ],
      "end": null
    },
    "ebc6d": {
      "entry_id": "ebc6d",
      "content": "You remember hearing about a sting operation in Wolverhampton Market, where police seized hundreds of counterfeit CDs being sold at inflated prices. Could this be a similar scam? The prospect of finally owning the new Lionel Richie album is suddenly soured by a wave of apprehension.\n\nMick pulls out a box cutter with a practiced flick of his wrist and slices open one of the cardboard boxes. He peels back the flaps, revealing stacks of Lionel Richie's new album, still gleaming in their shrink wrap. The dimly lit storage unit on the outskirts of Wolverhampton is filled with an unexpected treasure trove, begging the question: why is it here, and why is it so scarce in the rest of Wolverhampton?",
      "choices": [
        {
          "content": "Try to count the boxes, estimating the total number of albums hidden in this storage unit, ready to begin negotiations.",
          "entry_id": "e537a"
        },
        {
          "content": "Scan the interior of the unit, taking in the damp cardboard and the general sense of dodgy storage.",
          "entry_id": "ea336"
        }
      ],
      "end": null
    },
    "storage_unit_win_entry_leaving_c": {
      "entry_id": "storage_unit_win_entry_leaving_c",
      "content": "On a whim, you ask Mick if he knows of any other secret stashes of rare music hidden around Wolverhampton. He throws his head back and lets out a booming laugh, the sound echoing around the metal walls of the storage unit. 'Let's just say', he replies, wiping a tear from his eye, 'that Wolverhampton has a few secrets it's not ready to share'. He clearly knows more than he's letting on, but you sense you've reached the limit of what he's willing to divulge.",
      "choices": [
        {
          "content": "Give the album a quick check, making sure the shrink-wrap hasn't been tampered with.",
          "entry_id": "e8421"
        },
        {
          "content": "Thank Mick for his help and leave the storage unit, clutching your prize.",
          "entry_id": "e5e57"
        }
      ],
      "end": null
    },
    "e8421": {
      "entry_id": "e8421",
      "content": "Still feeling uneasy about the whole situation, you carefully examine the album in your hands, running your fingers along the shrink-wrap to check for any signs of tampering. The seal is intact, the corners are sharp, and the album looks brand new. You breathe a sigh of relief. It seems legitimate. Finally, you turn and head for the exit, ready to escape this strange storage unit on the outskirts of Wolverhampton.\n\nYou step out of the storage unit and back into the Wolverhampton sunshine, clutching the new Lionel Richie album tightly. A wave of relief washes over you, battling with a lingering sense of unease about the shady transaction you just completed. But you have the album, and that's all that matters.",
      "choices": [],
      "end": "win"
    },
    "dancing_on_the_ceiling_clues_entry_1": {
      "entry_id": "dancing_on_the_ceiling_clues_entry_1",
      "content": "The market stall was a bust. The stallholder's shifty eyes and evasive answers leave you feeling deflated. You need a break, a drink, and a chance to regroup. Maybe you'll have better luck if you temporarily abandon the search, and find a pub to steady your nerves.",
      "choices": [
        {
          "content": "Pull out your phone to find nearby pubs.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_1a"
        },
        {
          "content": "Rack your brain for a pub with Lionel Richie vibes.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_1b"
        }
      ],
      "end": null
    },
    "dancing_on_the_ceiling_clues_entry_1a": {
      "entry_id": "dancing_on_the_ceiling_clues_entry_1a",
      "content": "You decide against risking another market stall, especially since you can see the shifty stallholder from before is already packing up his wares. With no other leads at the market, the only option is to find a pub.",
      "choices": [
        {
          "content": "Tap the screen to search for nearby pubs on your phone.",
          "entry_id": "e82d2"
        },
        {
          "content": "Ask a nearby fruit stallholder for pub recommendations.",
          "entry_id": "eda91"
        }
      ],
      "end": null
    },
    "e82d2": {
      "entry_id": "e82d2",
      "content": "Scrolling through your phone, you find a few pubs in the immediate vicinity. One called 'Dancing on the Ceiling' catches your eye – the name alone is enough to pique your interest. It sounds far more promising than 'The Dog and Doublet' or 'The Hogshead'.\n\nAs you wander through Wolverhampton, you spot 'Dancing on the Ceiling'. The pub sign features the name in bright, neon lettering, along with a slightly faded picture of Lionel Richie himself in his '80s prime. Peeking through the window, you see various Lionel Richie posters adorn the walls.",
      "choices": [
        {
          "content": "Hesitate for a moment, then decide to go inside for a pint.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2c"
        },
        {
          "content": "Check out the poster advertising upcoming events.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2b"
        },
        {
          "content": "Step inside, drawn in by the familiar strains of 'All Night Long'.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2a"
        }
      ],
      "end": null
    },
    "dancing_on_the_ceiling_clues_entry_2c": {
      "entry_id": "dancing_on_the_ceiling_clues_entry_2c",
      "content": "You hesitate, momentarily questioning your sanity. This whole quest seems a little ridiculous. But the lure of a cold pint and the irresistible sounds of Lionel Richie's 'Dancing on the Ceiling' are too strong to resist. You push open the door and step inside.",
      "choices": [
        {
          "content": "Wonder if finding this Lionel Richie-themed pub is a sign.",
          "entry_id": "e5279"
        },
        {
          "content": "Steel yourself for yet another potential disappointment.",
          "entry_id": "e4016"
        }
      ],
      "end": null
    },
    "e5279": {
      "entry_id": "e5279",
      "content": "You wonder if finding this Lionel Richie-themed pub is a sign that you are finally on the right track to finding the album. Perhaps fate, or at least Lionel Richie, is finally on your side. \n\nInside 'Dancing on the Ceiling', the barman is humming along to 'Easy Like Sunday Morning' while polishing glasses. Framed records and posters adorn the walls. Emboldened by the overwhelmingly Richie-esque atmosphere, you decide to ask, half-jokingly, if he knows where to get the new album. He grins and tells you that the owner, Barry, is a *massive* Lionel Richie fan and pre-ordered loads of albums. \n\nThe barman, after hearing about your desperate album hunt, says he'll go grab Barry, the owner, as he's the biggest Lionel Richie fan he knows. He disappears through a door marked 'Private'.",
      "choices": [
        {
          "content": "Chat to the barman while you wait for Barry to appear.",
          "entry_id": "the_superfan's_secret_entry_1a"
        },
        {
          "content": "Examine the framed gold disc and other Lionel Richie memorabilia on the walls.",
          "entry_id": "the_superfan's_secret_entry_1b"
        }
      ],
      "end": null
    },
    "dancing_on_the_ceiling_clues_entry_1b": {
      "entry_id": "dancing_on_the_ceiling_clues_entry_1b",
      "content": "Then you vaguely remember seeing a flyer for a 'Lionel Richie Karaoke Night' somewhere in Wolverhampton. You can't recall the name of the pub, but decide to hunt for a place with distinct Richie vibes. It’s a long shot, but you feel it's worth a try.",
      "choices": [
        {
          "content": "Head towards the university area, hoping to spot familiar faces.",
          "entry_id": "e8514"
        },
        {
          "content": "Ask around at nearby shops, mentioning the karaoke night.",
          "entry_id": "e0cef"
        }
      ],
      "end": null
    },
    "e8514": {
      "entry_id": "e8514",
      "content": "You have a vague recollection that the pub was located somewhere near the university. You decide to head in that direction, hoping to stumble upon it. The university area is known for its concentration of pubs, so the odds are in your favour.\n\nWandering through Wolverhampton, you spot a pub called 'Dancing on the Ceiling.' The pub sign features the name in bright, retro lettering, along with a picture of Lionel Richie himself, circa 'Dancing on the Ceiling'. Peeking inside, you see posters of Lionel Richie adorning the walls.",
      "choices": [
        {
          "content": "Hesitate, then push open the door for a pint, hoping for the best.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2c"
        },
        {
          "content": "Check out the poster advertising upcoming events, hoping for a clue.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2b"
        },
        {
          "content": "Step inside, drawn in by the familiar strains of 'All Night Long'.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2a"
        }
      ],
      "end": null
    },
    "dancing_on_the_ceiling_clues_entry_2b": {
      "entry_id": "dancing_on_the_ceiling_clues_entry_2b",
      "content": "You notice a poster outside advertising upcoming events at the pub. It mentions a Lionel Richie release party for *this week*. This piques your interest, and you decide to investigate further. A release party suggests they *might* have had copies of the album today.\n\nInside the 'Dancing on the Ceiling' pub, the barman is humming along to a Lionel Richie song while polishing glasses. You, emboldened by the atmosphere, decide to ask, half-jokingly, if he knows where to get the new album. The barman grins and says that the owner, Barry, is a *massive* Lionel Richie fan and pre-ordered loads of copies.",
      "choices": [
        {
          "content": "Check the poster closely to confirm the date of the release party.",
          "entry_id": "ee7bd"
        },
        {
          "content": "Scan the poster for drink specials and other events that are on this week.",
          "entry_id": "e671a"
        }
      ],
      "end": null
    },
    "the_superfan's_secret_entry_1a": {
      "entry_id": "the_superfan's_secret_entry_1a",
      "content": "You ask the barman if he's a big Lionel Richie fan himself. The barman grins and says he appreciates the music, especially 'Easy', but Barry, the owner, is the *real* superfan. \"He's got everything,\" he says, wiping down the bar.",
      "choices": [
        {
          "content": "Ask the barman which Lionel Richie album cover is his favourite.",
          "entry_id": "eaf6c"
        },
        {
          "content": "Ask if he's planning to attend the release party tonight.",
          "entry_id": "e1fc7"
        }
      ],
      "end": null
    },
    "dancing_on_the_ceiling_clues_entry_2a": {
      "entry_id": "dancing_on_the_ceiling_clues_entry_2a",
      "content": "Outside 'Dancing on the Ceiling', the familiar opening bars of 'All Night Long' drift out into the Wolverhampton air. The music washes over you, a siren song promising Richie-related salvation. Perhaps this pub holds more than just themed nights.",
      "choices": [
        {
          "content": "Push open the door, ready to throw yourself into the Richie-themed revelry.",
          "entry_id": "ee762"
        },
        {
          "content": "Smooth down your crumpled shirt, hoping to make a good impression on the locals.",
          "entry_id": "ec9ca"
        }
      ],
      "end": null
    },
    "ee762": {
      "entry_id": "ee762",
      "content": "You push open the door and step inside. The 'Dancing on the Ceiling' pub is a shrine to Lionel. The air is thick with the comforting sounds of his music. Behind the bar, a barman hums along, polishing pint glasses with a practiced hand. You take a chance and ask if he knows where you could possibly find the new album. He grins and tells you Barry, the owner, is a *massive* fan and pre-ordered stacks of copies.",
      "choices": [
        {
          "content": "Chat to the barman about Lionel Richie while you wait for Barry.",
          "entry_id": "the_superfan's_secret_entry_1a"
        },
        {
          "content": "Let your eyes wander over the framed records and posters adorning the walls.",
          "entry_id": "the_superfan's_secret_entry_1b"
        }
      ],
      "end": null
    },
    "the_superfan's_secret_entry_1b": {
      "entry_id": "the_superfan's_secret_entry_1b",
      "content": "While the barman goes to find Barry, you take in the pub's decor. Framed gold records of 'Can't Slow Down' and 'Dancing on the Ceiling' hang on the walls. A small TV screen in the corner plays the 'Dancing on the Ceiling' music video on a loop, complete with dodgy 80s special effects.",
      "choices": [
        {
          "content": "Examine a faded 'Dancing on the Ceiling' poster, trying to decipher the set list from Lionel's 1986 Wolverhampton gig.",
          "entry_id": "eb586"
        },
        {
          "content": "Scan the walls for any rare or signed Lionel Richie memorabilia, hoping to find a clue to Barry's Richie obsession.",
          "entry_id": "e4a79"
        }
      ],
      "end": null
    },
    "eb586": {
      "entry_id": "eb586",
      "content": "You study the vintage 'Dancing on the Ceiling' poster. It's seen better days, faded from years of sunlight and beer fumes, but it still radiates 80s excess. It reminds you of simpler times and makes you all the more determined to get your hands on the new album. \n\nYou ask the barman if he's a big Lionel Richie fan himself. He grins and says he appreciates the music, especially when it's 'Easy Like Sunday Morning', but Barry, the owner, is the *real* superfan.",
      "choices": [
        {
          "content": "Ask the barman which Lionel Richie album cover he thinks is the most iconic.",
          "entry_id": "eaf6c"
        },
        {
          "content": "Ask him if he's planning to attend the Lionel Richie release party tonight.",
          "entry_id": "e1fc7"
        }
      ],
      "end": null
    },
    "eaf6c": {
      "entry_id": "eaf6c",
      "content": "You ask the barman about his favourite Lionel Richie album cover. He scratches his head, admitting he just puts the music on and doesn't really pay attention to the artwork. He repeats that Barry is the man to ask. He heads off to find Barry.\n\nA moment later, the barman returns, followed by Barry, the owner of the pub. Barry is beaming, practically radiating enthusiasm for Lionel Richie. The pub walls behind him are plastered with Lionel Richie memorabilia. He's wearing a well-worn 'Hello' t-shirt, and his eyes twinkle with fanatical excitement.",
      "choices": [
        {
          "content": "Ask Barry which Lionel Richie song is his all-time favourite.",
          "entry_id": "the_superfan's_secret_entry_2b"
        },
        {
          "content": "Remark on Barry's obvious enthusiasm for Lionel Richie, hoping to strike up a conversation.",
          "entry_id": "the_superfan's_secret_entry_2a"
        }
      ],
      "end": null
    },
    "the_superfan's_secret_entry_2a": {
      "entry_id": "the_superfan's_secret_entry_2a",
      "content": "You can't help but be struck by Barry's enthusiastic demeanor, and comment on it. 'Wow, you're clearly a big fan!' you say, gesturing towards the walls plastered with Lionel Richie memorabilia. He beams, a genuine smile spreading across his face, clearly pleased that his dedication is so obvious. He seems like he might know something about the new album you're looking for.",
      "choices": [
        {
          "content": "Compliment Barry on his 'Hello' t-shirt, hoping to ingratiate yourself further.",
          "entry_id": "e4bfd"
        },
        {
          "content": "Ask if he's always been such a big fan, curious about the origins of his Richie obsession.",
          "entry_id": "e50ae"
        }
      ],
      "end": null
    },
    "e4bfd": {
      "entry_id": "e4bfd",
      "content": "You compliment Barry on his 'Hello' t-shirt, hoping to ingratiate yourself. Barry puffs out his chest, clearly pleased. 'Only the best for Lionel!' he declares.\n\nBarry, a little flustered but clearly enjoying the attention, leans closer. 'So, the barman tells me you're looking for the new album? Listen, mate, I might be able to help. See, I pre-ordered... well, let's just say I pre-ordered *a lot* of copies. I wanted to make sure I had enough for myself, and for the big release party tonight. Turns out, I might have accidentally bought up half of Wolverhampton's initial stock! Sorry about that!' Barry winks, a hint of mischievousness in his eye. You remain inside the 'Dancing on the Ceiling' pub, listening to Barry's explanation.",
      "choices": [
        {
          "content": "Take a look at his Lionel Richie collection.",
          "entry_id": "album_acquired_entry_1a"
        },
        {
          "content": "Let your eyes wander over the Lionel Richie memorabilia around the pub.",
          "entry_id": "album_acquired_entry_1b"
        }
      ],
      "end": null
    },
    "album_acquired_entry_1a": {
      "entry_id": "album_acquired_entry_1a",
      "content": "You're curious about the source of Barry's superfandom, and ask about his Lionel Richie collection. Barry's eyes light up at the mention, and he launches into a detailed description of his prized possessions. You wonder what treasures he holds.",
      "choices": [
        {
          "content": "Wait for Barry to describe his most prized item, hoping for a glimpse into the heart of his obsession.",
          "entry_id": "e6b56"
        },
        {
          "content": "Prompt Barry to talk about his favourite concert, curious about his live Richie experiences.",
          "entry_id": "e0586"
        }
      ],
      "end": null
    },
    "e6b56": {
      "entry_id": "e6b56",
      "content": "Barry launches into an enthusiastic description of his most prized Lionel Richie item – a signed first edition vinyl of 'Can't Slow Down,' obtained at a meet-and-greet in the 80s. He gestures wildly as he recounts the story of queuing for hours outside the Birmingham Odeon, clutching his precious vinyl.\n\nBarry, still buzzing from his confession about hoarding the albums, reaches under the bar and pulls out a pristine, shrink-wrapped copy of the new Lionel Richie album. He hands it to you with a flourish and invites you to the release party tonight. He beams, acknowledging your shared love of Lionel. You gratefully receive the album from Barry.",
      "choices": [
        {
          "content": "Ask about the release night event in more detail, hoping to join the celebrations.",
          "entry_id": "album_acquired_entry_2b"
        },
        {
          "content": "Thank Barry profusely for the album, overwhelmed by his generosity and your successful quest.",
          "entry_id": "album_acquired_entry_2a"
        }
      ],
      "end": null
    },
    "album_acquired_entry_2b": {
      "entry_id": "album_acquired_entry_2b",
      "content": "Intrigued by the mention of a release party, you ask Barry for more details about the event. His eyes gleam with excitement as he begins to describe the festivities planned for tonight at 'Dancing on the Ceiling'.",
      "choices": [
        {
          "content": "Enquire about the music and drinks that will be on offer, curious about the soundtrack and refreshments for the night.",
          "entry_id": "e73a5"
        },
        {
          "content": "Ask if there will be a karaoke competition, envisioning yourself belting out 'Hello' to an adoring crowd.",
          "entry_id": "e7abd"
        }
      ],
      "end": null
    },
    "the_superfan's_secret_entry_2b": {
      "entry_id": "the_superfan's_secret_entry_2b",
      "content": "You ask Barry which is his favourite Lionel Richie song. Barry's eyes light up behind his glasses. 'That's a tough one! So many to choose from. But if I *had* to pick... it'd be 'Dancing on the Ceiling', of course! Hence the name of the pub, see?' He grins, gesturing around at the pub.",
      "choices": [
        {
          "content": "Nudge him playfully, asking him to sing a few lines.",
          "entry_id": "eaf44"
        },
        {
          "content": "Ask about the music video, with its iconic zero-gravity dance moves.",
          "entry_id": "e2a4e"
        }
      ],
      "end": null
    },
    "e50ae": {
      "entry_id": "e50ae",
      "content": "You ask if he's always been such a big fan. Barry laughs. 'Since 'Easy Like Sunday Morning'! Changed my life, that song did!'\n\nBarry, suddenly remembering himself, says, 'So, the barman tells me you're looking for the new album? Listen, mate, I might be able to help. See, I pre-ordered... well, let's just say I pre-ordered *a lot* of copies. I wanted to make sure I had enough for myself, and for the big release party tonight. Turns out, I might have accidentally bought up half of Wolverhampton's initial stock! Sorry about that!'\n\nBarry, clearly pleased with himself for unintentionally solving the local Lionel Richie album drought, offers you a copy from behind the bar. He beams, acknowledging your dedication to Lionel. You're still inside the 'Dancing on the Ceiling' pub, listening to Barry's explanation.",
      "choices": [
        {
          "content": "Enquire further about his Lionel Richie collection.",
          "entry_id": "album_acquired_entry_1a"
        },
        {
          "content": "Let your gaze drift to the various pieces of Lionel Richie memorabilia around the pub.",
          "entry_id": "album_acquired_entry_1b"
        }
      ],
      "end": null
    },
    "album_acquired_entry_1b": {
      "entry_id": "album_acquired_entry_1b",
      "content": "Instead of directly engaging with Barry, your eyes are drawn to the extensive Lionel Richie memorabilia adorning the pub walls. There are posters from various tours, framed gold and platinum records, and even a slightly unsettling velvet painting of Lionel in his '80s heyday.",
      "choices": [
        {
          "content": "Study the signed Lionel Richie poster, trying to decipher the message.",
          "entry_id": "e1fcf"
        },
        {
          "content": "Take a closer look at the framed photo of Barry with Lionel Richie, wondering about the story behind it.",
          "entry_id": "e8ef5"
        }
      ],
      "end": null
    },
    "e1fcf": {
      "entry_id": "e1fcf",
      "content": "You notice a large, framed poster of Lionel Richie on the wall, signed in bold silver marker. Beneath the signature, it reads: 'To Barry, Keep Dancing!'. It looks like it could be quite valuable.\n\nBarry, still buzzing from his confession about hoarding the albums, reaches under the bar and pulls out a pristine, shrink-wrapped copy of the new Lionel Richie album. He hands it to you with a flourish and invites you to the release party tonight. You receive the album from Barry.",
      "choices": [
        {
          "content": "Ask about the release night event, eager to know what's planned.",
          "entry_id": "album_acquired_entry_2b"
        },
        {
          "content": "Thank Barry profusely, barely able to contain your excitement.",
          "entry_id": "album_acquired_entry_2a"
        }
      ],
      "end": null
    },
    "album_acquired_entry_2a": {
      "entry_id": "album_acquired_entry_2a",
      "content": "You're overcome with relief, thanking Barry profusely. 'I can't believe it, I've actually got it!' you exclaim, clutching the album tightly. 'You're a lifesaver, Barry! This is going straight on the turntable when I get home!'",
      "choices": [
        {
          "content": "Continue to thank Barry for the album, expressing your sincere gratitude.",
          "entry_id": "eafc6"
        },
        {
          "content": "Reassure Barry that you're a true Lionel Richie fan, not just some bandwagon-jumper.",
          "entry_id": "e1b62"
        }
      ],
      "end": null
    },
    "ed71a": {
      "entry_id": "ed71a",
      "content": "Surprisingly, the loud music seems to be working its magic. Your limbs begin to loosen, and you find yourself involuntarily tapping your foot. A faint smile creeps across your face as you hum along to 'All Night Long'. Maybe this day isn't a complete disaster after all.\n\nBut then, reality bites. The radio DJ's voice, now even more intrusive, reminds you of your mission. You *need* that album! The DJ mentions a 'special promotion' down at 'Spin City'.",
      "choices": [
        {
          "content": "Give in and listen to what the DJ has to say.",
          "entry_id": "e1958"
        },
        {
          "content": "Try desperately to ignore the music and drift back to sleep.",
          "entry_id": "e0306"
        }
      ],
      "end": null
    },
    "eb341": {
      "entry_id": "eb341",
      "content": "Muttering about the importance of pre-ordering and the impending doom of missing out, you frantically search for your keys and wallet. Time is of the essence! You rummage through the chaotic mess on your desk, scattering old takeaway menus and crumpled receipts in your wake. Finally, you locate the essentials – a slightly battered wallet and a keyring adorned with a miniature Lionel Richie figurine. Fully awake and fueled by a mixture of panic and excitement, you're now determined to secure a copy of the new album. The next stop is the large chain record store in the city centre: a logical, if slightly soulless, starting point.",
      "choices": [
        {
          "content": "Pause to consider a quick shower before heading out.",
          "entry_id": "chain_store_letdown_entry_1a"
        },
        {
          "content": "Prioritise speed, and grab a quick coffee instead.",
          "entry_id": "chain_store_letdown_entry_1b"
        }
      ],
      "end": null
    },
    "e4382": {
      "entry_id": "e4382",
      "content": "For a fleeting moment, you wonder if a quick shower would somehow improve your Richie-finding luck, a superstitious thought that quickly vanishes. The urgency of the situation takes over, and you push the thought aside.\n\nYou arrive at 'Spin City', the chain record store in Wolverhampton city centre, its brightly lit interior a stark contrast to the dingy backstreets you just navigated. You approach the young employee behind the counter, his expression suggesting he'd rather be anywhere else. You ask about the new Lionel Richie album, but he barely glances up from his phone. After a perfunctory check of the computer, he delivers the bad news with a shrug: 'Sold out, mate. Loads of pre-orders, limited stock, you know how it is.'",
      "choices": [
        {
          "content": "Check out a 'Now That's What I Call Lionel!' compilation as a backup plan.",
          "entry_id": "chain_store_letdown_entry_2c"
        },
        {
          "content": "Summon the courage to ask the employee about other record stores in town.",
          "entry_id": "chain_store_letdown_entry_2b"
        },
        {
          "content": "Overhear another customer complaining loudly about the lack of decent music.",
          "entry_id": "chain_store_letdown_entry_2a"
        }
      ],
      "end": null
    },
    "edef7": {
      "entry_id": "edef7",
      "content": "You start humming 'Dancing on the Ceiling' under your breath, a subconscious attempt to soothe the disappointment of failing to secure the new album. The compilation is tempting, but you resist the urge to settle for second best.\n\nYou exit the chain record store, a wave of deflation washing over you. The realization that the album might be harder to find than you expected begins to sink in. The Wolverhampton music scene suddenly seems a lot more challenging than you'd anticipated. The generic pop posters in the chain store window seem to mock your quest.",
      "choices": [
        {
          "content": "Consult your phone for a list of other record stores in Wolverhampton.",
          "entry_id": "ef882"
        },
        {
          "content": "Continue towards the University Quarter.",
          "entry_id": "e06ef"
        }
      ],
      "end": null
    },
    "e9444": {
      "entry_id": "e9444",
      "content": "You catch a glimpse of yourself in the shop window as you hurry past. Your reflection stares back, hair sticking up at odd angles, a testament to your frantic awakening. A quick comb-through with your fingers will have to do; Lionel Richie demands your immediate attention!\n\nYou arrive at 'Spin City', the large chain record store dominating Wolverhampton's city centre. Inside, the air conditioning hums, and the scent of new plastic fills your nostrils. You approach the counter, where a young employee with carefully sculpted hair is engrossed in his phone. \"Hi,\" you say, perhaps a little too eagerly. \"I'm looking for the new Lionel Richie album?\"\n\nHe barely glances up. A few taps on the keyboard, a disinterested shrug. \"Sold out, mate. Pre-orders cleared us out. Limited stock, you know?\"",
      "choices": [
        {
          "content": "Browse the 'easy listening' section for a 'Now That's What I Call Lionel!' compilation.",
          "entry_id": "chain_store_letdown_entry_2c"
        },
        {
          "content": "Press the employee for information about other record stores in Wolverhampton.",
          "entry_id": "chain_store_letdown_entry_2b"
        },
        {
          "content": "Overhear a nearby customer's complaint about the store's vinyl selection.",
          "entry_id": "chain_store_letdown_entry_2a"
        }
      ],
      "end": null
    },
    "ebbc6": {
      "entry_id": "ebbc6",
      "content": "As you trudge out of 'Spin City', the automatic doors hissing shut behind you, you remember your friend Liam mentioning a 'proper' record shop near the university. 'Vinyl Vortex', he called it. Apparently, they're all about 'the vibes' and 'obscure pressings'. It's a long shot, but maybe they'll appreciate Lionel's genius more than that chain store did.\n\nThe city centre buzzes around you: shoppers laden with bags, buses roaring past, the distant clang of the Wolverhampton market. The initial excitement has faded, replaced by a nagging worry. This isn't going to be as easy as you thought. Still, the thought of spinning that new album keeps you going.\n\nYou start walking in the general direction of the university, hoping 'Vinyl Vortex' holds the key to your Richie Retrieval mission. 'Spin City' shrinks behind you, a monument to mainstream disappointment.",
      "choices": [
        {
          "content": "Pull out your phone and search for other record stores in Wolverhampton.",
          "entry_id": "ef882"
        },
        {
          "content": "Pause to listen to a busker playing a mournful tune outside the Mander Centre.",
          "entry_id": "e06ef"
        }
      ],
      "end": null
    },
    "e8e0f": {
      "entry_id": "e8e0f",
      "content": "You bravely take a scalding sip of the coffee, instantly regretting it as a dribble escapes your lips and lands squarely on your t-shirt. You wipe at the stain furiously, hoping it won't be too noticeable as you head out to the chain store.\n\nArriving at 'Spin City', the large chain record store in Wolverhampton city centre, a beacon of mainstream music, you approach the counter. You ask the young employee, who looks like he'd rather be anywhere else, about the new Lionel Richie album. He sighs, barely glancing up from his phone, checks the computer with all the enthusiasm of a sloth, and delivers the bad news: 'Sold out. Popular pre-orders, limited stock, innit?'",
      "choices": [
        {
          "content": "Check out a 'Now That's What I Call Lionel!' compilation, maybe it's better than nothing.",
          "entry_id": "chain_store_letdown_entry_2c"
        },
        {
          "content": "Consider asking the employee if other record stores might have the album.",
          "entry_id": "chain_store_letdown_entry_2b"
        },
        {
          "content": "Listen to another customer complaining about the terrible vinyl selection.",
          "entry_id": "chain_store_letdown_entry_2a"
        }
      ],
      "end": null
    },
    "e0203": {
      "entry_id": "e0203",
      "content": "You momentarily consider starting a vinyl collection, maybe to impress the cool employee, before remembering the urgent need for the new Lionel Richie album. A red-faced customer nearby is still ranting about the 'Ed Sheeran section'.\n\nLeaving Spin City, disappointment washes over you like a Wolverhampton raincloud. The album is proving harder to find than you thought, and the Wolverhampton music scene suddenly feels a lot more challenging. You trudge out onto the pavement, remembering your friend mentioning a cool record store near the university called 'Vinyl Vortex'.",
      "choices": [
        {
          "content": "Check your phone for directions to 'Vinyl Vortex'.",
          "entry_id": "ef882"
        },
        {
          "content": "Listen to the busker outside the store, maybe he'll play some Lionel.",
          "entry_id": "e06ef"
        }
      ],
      "end": null
    },
    "e83c4": {
      "entry_id": "e83c4",
      "content": "The snippet of conversation has renewed your hope. You consider pulling out your phone to search for the nearest bus to Broad Street, but decide against it.",
      "choices": [
        {
          "content": "Edge closer to the women to try and catch more of their chat.",
          "entry_id": "e72b5"
        },
        {
          "content": "Ignore the women and continue searching for the album in record stores.",
          "entry_id": "e587c"
        }
      ],
      "end": null
    },
    "e72b5": {
      "entry_id": "e72b5",
      "content": "You lean in slightly, hoping to glean more information from the women's conversation. Unfortunately, they've moved on to discussing the rising cost of tea cakes, and you hear nothing more about the charity shop or any mysterious CD delivery.\n\nThe rumour of a charity shop stash is now a lifeline. You are still in Wolverhampton, and despite how unlikely it sounds, the charity shop is now the most promising lead you have. You must decide whether to pursue this strange tip-off.",
      "choices": [
        {
          "content": "Try another record shop anyway, despite the odds.",
          "entry_id": "ec52b"
        },
        {
          "content": "Head straight to the charity shop on Broad Street. It's now or never!",
          "entry_id": "eae1a"
        }
      ],
      "end": null
    },
    "ec52b": {
      "entry_id": "ec52b",
      "content": "A flicker of doubt creeps in. Perhaps you should try one *last* record shop? But you quickly dismiss the idea. The chain store and the indie shop were both busts. Time is running out, and there's only one sensible choice: charity shop ahoy!\n\nYou weigh the odds, considering the potential disappointment if the rumour turns out to be false. But the thought of Lionel Richie's music spurs you on. You have to take the chance.\n\nWith renewed determination, you set off towards the charity shop on Broad Street in Wolverhampton. Could this unlikely location be the final stop on your Richie Retrieval mission?\n\nYou head towards the charity shop in Wolverhampton, your pace quickening with a renewed sense of hope. The building looks a little rundown, but a handwritten sign in the window promises 'Bargains Galore!' As you approach. As you get closer to the entrance, you take a deep breath, ready to dive in.",
      "choices": [
        {
          "content": "Take a moment to study the bizarre collection in the window display.",
          "entry_id": "ec304"
        },
        {
          "content": "Pause to listen to the busker plucking a tune nearby.",
          "entry_id": "e5d12"
        }
      ],
      "end": null
    },
    "ec304": {
      "entry_id": "ec304",
      "content": "The charity shop window is a chaotic jumble of items. A porcelain doll with a vacant stare sits next to a chipped teacup. Most bizarrely, a velvet Elvis painting, shimmering slightly, dominates the display. The combination is strangely alluring, in a very Wolverhampton kind of way.\n\nInside, the charity shop smells faintly of mothballs and forgotten dreams. You navigate the crowded aisles, filled with clothes, books, and bric-a-brac. Near the back, you spot a promising sign: 'New Arrivals'. You can see a cardboard box in the distance beneath it, looking hopeful. This confirms that the shop does indeed get new items, including potentially the album.",
      "choices": [
        {
          "content": "Browse the old vinyl records.",
          "entry_id": "e6d1f"
        },
        {
          "content": "Strike up a conversation with the chatty volunteer behind the till.",
          "entry_id": "e2442"
        }
      ],
      "end": null
    },
    "e6d1f": {
      "entry_id": "e6d1f",
      "content": "Drawn by habit, you briefly get distracted by a stack of old vinyl records. You flip through them, finding a few forgotten gems – a surprisingly good local band from the 90s – and some truly awful easy listening albums that should probably stay forgotten.\n\nFinally, you reach the 'New Arrivals' box. It contains a random assortment of items: a broken toaster, some unwanted Christmas decorations, and… wait a minute. Tucked amongst the clutter are several copies of the new Lionel Richie album! This unexpected discovery suggests the distribution of the album might be unusual or irregular, and you have stumbled upon a hidden stash. Here at last, in a Wolverhampton charity shop, is a box of new albums, including *the* album.",
      "choices": [
        {
          "content": "Closely examine the album for any damage or imperfections.",
          "entry_id": "ecde2"
        },
        {
          "content": "Check the price tag on one of the albums.",
          "entry_id": "e009d"
        }
      ],
      "end": null
    },
    "eae1a": {
      "entry_id": "eae1a",
      "content": "Weighing the odds, you consider the potential disappointment if the rumour turns out to be false. But the thought of Lionel Richie's music spurs you on. You have to take the chance.\n\nWith renewed determination, you set off in the direction of the charity shop on Broad Street in Wolverhampton. Could this unlikely location be the final stop on your Richie Retrieval mission?\n\nYou head towards the charity shop in Wolverhampton, your pace quickening with a renewed sense of hope. The building is a little rundown, but a handwritten sign in the window promises 'Bargains Galore!' As you approach. As you approach the entrance, you take a deep breath, ready to dive in.",
      "choices": [
        {
          "content": "Study the peculiar window display.",
          "entry_id": "ec304"
        },
        {
          "content": "Listen to the busker's rendition of 'Easy'.",
          "entry_id": "e5d12"
        }
      ],
      "end": null
    },
    "e5d12": {
      "entry_id": "e5d12",
      "content": "As you approach, you hear faint music. It's a busker struggling through a slightly off-key rendition of Lionel Richie's 'Easy'. The performance is enthusiastic, if not entirely accurate. The irony is not lost on you.\n\nInside, the charity shop smells faintly of mothballs and forgotten dreams. You navigate the crowded aisles, filled with clothes, books, and bric-a-brac. Near the back, you spot a promising sign: 'New Arrivals'. You start heading towards the cardboard box beneath it, looking hopeful. This confirms that the shop does indeed get new items, including potentially the album.",
      "choices": [
        {
          "content": "Browse the old vinyl records.",
          "entry_id": "e6d1f"
        },
        {
          "content": "Talk to the chatty volunteer.",
          "entry_id": "e2442"
        }
      ],
      "end": null
    },
    "e2442": {
      "entry_id": "e2442",
      "content": "Before you can reach the 'New Arrivals' box, a chatty volunteer, armed with a duster and a friendly smile, approaches. They launch into a detailed history of the charity shop, including tales of bizarre donations and local legends. Apparently, they once received a full suit of armour!\n\nFinally, you reach the 'New Arrivals' box. It contains a random assortment of items: a broken toaster, some unwanted Christmas decorations, and… wait a minute. Tucked amongst the clutter are several copies of the new Lionel Richie album! This unexpected discovery suggests that the distribution of the album might be unusual or irregular, and that you have stumbled upon a hidden stash. You have found a box of new albums at the charity shop, including the Lionel Richie album.",
      "choices": [
        {
          "content": "Examine the album for any signs of damage or imperfections.",
          "entry_id": "ecde2"
        },
        {
          "content": "Check the price tag on one of the albums.",
          "entry_id": "e009d"
        }
      ],
      "end": null
    },
    "ee61c": {
      "entry_id": "ee61c",
      "content": "Before leaving, you carefully inspect the album cover. You run your finger along the edges, checking for creases. The plastic case seems unscratched, the cover art pristine. This copy is definitely a keeper.\n\nYou stand outside the charity shop, clutching the new Lionel Richie album. The weight of the CD feels significant, a tangible reward for your dedicated search across Wolverhampton.",
      "choices": [
        {
          "content": "Step out into the sunshine, humming 'Hello'.",
          "entry_id": "ec22a"
        },
        {
          "content": "Check the bus timetable at the stop across the road.",
          "entry_id": "e79cb"
        }
      ],
      "end": null
    },
    "e79cb": {
      "entry_id": "e79cb",
      "content": "You glance across the road at the bus stop. The number 59 to Fordhouses will get you home fastest, but it's not due for another twenty minutes. Still, every second counts when the sweet sounds of Lionel Richie are calling.\n\nYou stand outside the charity shop in Wolverhampton, clutching the new Lionel Richie album. You feel utterly triumphant. The quest is complete, the album secured. Wolverhampton has been conquered, all thanks to a bit of luck and unwavering dedication to the music of Lionel Richie.",
      "choices": [],
      "end": "win"
    },
    "eb9c5": {
      "entry_id": "eb9c5",
      "content": "The volunteer at the till, an older woman with a warm smile, sees the album in your hand. You strike up a conversation about the unexpected delivery. 'Oh, yes,' she says, adjusting her glasses. 'We had a house clearance just yesterday. A whole box of them, still sealed. Must have been a real fan.'\n\nYou pay for the album, handing over a fiver. As she rings it up, a wave of satisfaction washes over you. Your quest is almost at its end.",
      "choices": [
        {
          "content": "Quickly check the CD on your phone to see if it plays.",
          "entry_id": "ebfaf"
        },
        {
          "content": "Donate the 47p change to a charity tin.",
          "entry_id": "charity_shop_win_entry_donate"
        },
        {
          "content": "Examine the cover for any imperfections.",
          "entry_id": "ee61c"
        }
      ],
      "end": null
    },
    "e83cb": {
      "entry_id": "e83cb",
      "content": "You grab your phone and frantically search for any local record store listings you might have missed, hoping to unearth a hidden gem in Wolverhampton. You tap furiously, scrolling past listings for guitar repair shops and music tuition services.\n\nThen you remember a slightly more obscure second-hand record shop tucked away down a back alley off Dudley Street. You tell yourself it's a long shot – these places rarely stock new releases – but you are running out of options. You start walking in that direction.",
      "choices": [
        {
          "content": "Notice a poster for a local band and consider checking out the pub where they are playing.",
          "entry_id": "e2068"
        },
        {
          "content": "Carefully step around a precarious stack of milk crates blocking the pavement.",
          "entry_id": "eac7f"
        },
        {
          "content": "Follow an interesting smell wafting from a doorway, which you think is coming from the record shop.",
          "entry_id": "ecf3e"
        }
      ],
      "end": null
    },
    "eac7f": {
      "entry_id": "eac7f",
      "content": "You nearly trip over a stack of precariously balanced milk crates in the alleyway, momentarily distracted by the near miss. Focus, you tell yourself, there is no time for injuries when Lionel is waiting.\n\nYou finally arrive at the second-hand record shop. The shop is crammed with boxes of vinyl, CDs, and tapes visible through the grime-streaked window. It's dusty, cluttered, and smells faintly of old cardboard and forgotten dreams.",
      "choices": [
        {
          "content": "Notice the faded \"Open\" sign swinging precariously in the doorway and push the door.",
          "entry_id": "ea296"
        },
        {
          "content": "Hesitantly push the door open and step inside.",
          "entry_id": "ed493"
        },
        {
          "content": "Take a peek through the window first, assessing the chaos within.",
          "entry_id": "dusty_depths_entry_dusty_exterior_option3"
        }
      ],
      "end": null
    },
    "ee22c": {
      "entry_id": "ee22c",
      "content": "Your ears are drawn to the sound of a busker attempting a slightly off-key rendition of \"Easy Like Sunday Morning\". The performance is…enthusiastic, if not entirely accurate. You appreciate the sentiment, but it's not quite the new album you're after.\n\nWith a renewed sense of purpose, you approach the stall selling DVDs and CDs. The stallholder, a slightly shifty-looking character with a glint in his eye, is arranging his wares. You take a deep breath and ask the question: 'Do you, by any chance, have the new Lionel Richie album?' The stallholder glances around nervously.",
      "choices": [
        {
          "content": "Observe the stallholder closely, trying to gauge his reaction to the name Lionel Richie.",
          "entry_id": "e79e2"
        },
        {
          "content": "Scan the DVDs on display while the stallholder considers your question.",
          "entry_id": "ecb42"
        }
      ],
      "end": null
    },
    "ecf3e": {
      "entry_id": "ecf3e",
      "content": "A powerful smell of frying onions drifts from a doorway nearby, momentarily distracting you from your quest. Your stomach rumbles in protest at being ignored, but you press on, the image of that Lionel Richie album spurring you forward.\n\nYou finally reach the alley where the second-hand record shop is located. Through the window, you see teetering stacks of vinyl threaten to spill out onto the pavement. The glass is coated in a thick layer of grime, obscuring the treasures within. The air hangs heavy with the scent of dust and forgotten dreams.",
      "choices": [
        {
          "content": "Notice the faded \"Open\" sign, hanging precariously, and push the door open.",
          "entry_id": "ea296"
        },
        {
          "content": "Hesitantly brave the unknown and step inside the shop.",
          "entry_id": "ed493"
        },
        {
          "content": "Peer through the grime-covered window, trying to assess the situation.",
          "entry_id": "dusty_depths_entry_dusty_exterior_option3"
        }
      ],
      "end": null
    },
    "e7e9f": {
      "entry_id": "e7e9f",
      "content": "Lost in thought, you almost stumble over a shopping trolley abandoned in the middle of the walkway, its wheels squeaking ominously. A quick sidestep saves you from a collision, reminding you to stay sharp amidst the market's chaos.\n\nYou approach the market stall, where a man with a gold tooth and a knowing glint in his eye is arranging a collection of DVDs – mostly knock-off action films and karaoke discs. Taking a deep breath, you ask, 'Have you got the new Lionel Richie album, by any chance?' The stallholder glances around, as if expecting the authorities to swoop in.",
      "choices": [
        {
          "content": "Study the stallholder's body language for any telltale signs that he might know something.",
          "entry_id": "e79e2"
        },
        {
          "content": "Scan the DVDs on display while the stallholder considers your question.",
          "entry_id": "ecb42"
        }
      ],
      "end": null
    },
    "ecb42": {
      "entry_id": "ecb42",
      "content": "While the stallholder considers your question, you scan the DVDs on display. They're dirt cheap – a fiver for what looks like the latest blockbuster. Too good to be true, surely? Most of the titles are recent releases, which only adds to the dodgy vibe. It's hard to believe this stall is entirely legit.\n\nYou've committed now, asking about the Lionel Richie album, and the stallholder's weighing up his response. The search has led you to a potentially dodgy source in the heart of Wolverhampton market. He avoids giving you a straight answer, and you're left feeling unsure if he's being truthful.",
      "choices": [
        {
          "content": "Cut your losses and head to the 'Dancing on the Ceiling' pub, hoping for a legitimate lead.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_1"
        },
        {
          "content": "Press him about a 'stash', hinting you're willing to pay extra for discretion.",
          "entry_id": "secret_storage_unit_entry_market_stall_approach"
        }
      ],
      "end": null
    },
    "eda91": {
      "entry_id": "eda91",
      "content": "You ask the stallholder at the fruit stand next door if they know any decent pubs. He points vaguely down the street, wiping his hands on his apron. 'There's a place down there, always got music blaring,' he says. It's not exactly a ringing endorsement, but it's a start.\n\nWandering down the street, you spot a pub with a familiar name: 'Dancing on the Ceiling'. The sign above the door is impossible to miss: bright, retro lettering with a picture of Lionel Richie grinning down at you. Peeking through the window, you see posters of Lionel adorning the walls.",
      "choices": [
        {
          "content": "Take a deep breath and push open the door for a pint, hoping for a Richie miracle.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2c"
        },
        {
          "content": "Pause to examine the poster in the window, advertising upcoming events.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2b"
        },
        {
          "content": "Let the irresistible beat of 'All Night Long' pull you inside.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2a"
        }
      ],
      "end": null
    },
    "ece73": {
      "entry_id": "ece73",
      "content": "You ask the stallholder if he knows anything about local Wolverhampton bands, hoping to gauge his knowledge of the music scene. You casually mention you're interested in discovering some hidden gems, figuring he might open up about the new Lionel Richie album if he thinks you're a serious music fan.\n\nJust as you're about to give up, the stallholder leans in close, a sly grin spreading across his face. 'Local bands, eh? Not my thing, but I might know a bloke who's got a... shall we say, *stash* of albums out in a storage unit. On the outskirts of town.' He pauses, then adds, 'Information like that comes at a price.'",
      "choices": [
        {
          "content": "Press the stallholder for more details about this contact and the storage unit.",
          "entry_id": "secret_storage_unit_entry_ask_details"
        },
        {
          "content": "Tell the stallholder you're not convinced, and the stash sounds dodgy.",
          "entry_id": "secret_storage_unit_entry_express_doubt"
        },
        {
          "content": "Try to haggle with the stallholder over the price of this information.",
          "entry_id": "secret_storage_unit_entry_haggle_price"
        }
      ],
      "end": null
    },
    "ef737": {
      "entry_id": "ef737",
      "content": "The stallholder rattles off surprisingly specific details about his contact: 'Name's Mick. Meet him by the old Speedy Storage place on the Cannock Road. Unit 42. Says he's got what you're looking for.' He winks. 'Don't tell him I sent you.' His readiness to share these details makes you wonder if this is a genuine lead, or if you are being set up for something.\n\nYou follow the directions provided by the market stallholder, arriving at a desolate area on the outskirts of Wolverhampton. A nervous-looking man, presumably Mick, fidgets by a chain-link fence. He keeps glancing over his shoulder. Spotting you, he makes eye contact and beckons you over, then leads you towards a row of identical, grey storage units.",
      "choices": [
        {
          "content": "Study Mick's behaviour, and distrust him.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01a"
        },
        {
          "content": "Try to start a friendly conversation about music with Mick.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01b"
        }
      ],
      "end": null
    },
    "e5df8": {
      "entry_id": "e5df8",
      "content": "You focus on Mick's body language, trying to assess whether he is being honest. His face is pale and he keeps licking his lips. The Speedy Storage place looks deserted. He seems more scared than malicious, but his nervousness is unsettling. Unit 42 looms ahead, its metal door a dull grey in the fading light.\n\nMick fumbles with a set of keys, finally unlocking Unit 42. The door creaks open with a protesting groan, revealing a dimly lit space packed floor-to-ceiling with cardboard boxes of various sizes. The air is thick with the smell of damp cardboard and dust, with a faint hint of something strange in the air. The interior is dimly lit by a single flickering bulb.\n\nYou notice that the boxes all appear to contain Lionel Richie albums.",
      "choices": [
        {
          "content": "Consider what it might mean to find so many albums here.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02b"
        },
        {
          "content": "Sense the unspoken secrets in the dusty air of the storage unit.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02c"
        },
        {
          "content": "Notice a strange, acrid smell emanating from the storage unit.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02a"
        }
      ],
      "end": null
    },
    "e1662": {
      "entry_id": "e1662",
      "content": "You rifle through the CDs, looking for any other albums that seem a bit dodgy. If this stallholder is dealing in bootlegs, maybe he's got a line on the new Lionel Richie, too. You spot a suspiciously pristine copy of *Thriller* with a slightly off-centre cover, and a DVD box set of *Only Fools and Horses* with what looks like Tippex covering up a swear word on the case. \n\nJust as you’re about to give up, the stallholder leans in close, his gold tooth glinting in the Wolverhampton sunlight. He lowers his voice to a whisper. 'Alright, mate,' he says. 'I might know a bloke who's got a bit of a stash out in a storage unit, like. On the outskirts.' He pauses, then adds, 'Information ain't free, though.'",
      "choices": [
        {
          "content": "Press the stallholder for more information about this 'stash' and the contact.",
          "entry_id": "secret_storage_unit_entry_ask_details"
        },
        {
          "content": "Tell the stallholder you're not sure you trust this 'stash' idea.",
          "entry_id": "secret_storage_unit_entry_express_doubt"
        },
        {
          "content": "Try to get the stallholder to drop the price for the contact's details.",
          "entry_id": "secret_storage_unit_entry_haggle_price"
        }
      ],
      "end": null
    },
    "ed2b5": {
      "entry_id": "ed2b5",
      "content": "The stallholder puffs out his chest and insists his 'mate' is as good as gold, a real stand-up guy. 'Trust me,' he says, a little too forcefully. 'He's got the stuff, alright?' He then hands you a crumpled napkin with an address scrawled on it. 'Ask for Mick,' he says with a wink. 'Tell him I sent you.'\n\nYou follow the directions the stallholder provided, driving out past the ring road to a grim industrial estate on the edge of Wolverhampton. A nervous-looking man, who must be Mick, is hanging around by a chain-link fence, puffing on a cigarette. He glances around before catching your eye and giving you a hesitant nod. He leads you towards the storage unit.",
      "choices": [
        {
          "content": "Voice your concerns about Mick's trustworthiness.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01a"
        },
        {
          "content": "Try to break the ice by chatting to Mick about Lionel Richie.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01b"
        }
      ],
      "end": null
    },
    "edc33": {
      "entry_id": "edc33",
      "content": "The stallholder's shifty eyes and forced smile flash through your mind. Was this whole thing a set-up? Is Mick just a pawn in some dodgy scheme? You consider turning around and heading back to the market, but the thought of that new Lionel Richie album spurs you on. \n\nMick fumbles with a padlock, the metal clinking in the silence of the industrial estate. Finally, he manages to unlock one of the units. He pulls the door open with a groan, revealing a dimly lit space packed floor-to-ceiling with cardboard boxes. They're all different sizes and shapes, some taped up, some open, some with handwritten labels. The air is thick with the smell of damp cardboard and dust, and something else hangs in the air.\n\nYou can see that the boxes contain Lionel Richie albums.",
      "choices": [
        {
          "content": "Consider why there might be so many albums in a storage unit.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02b"
        },
        {
          "content": "Try to interpret what Mick's motives are, and what's going on here.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02c"
        },
        {
          "content": "Take a sniff and try to identify the source of the storage unit's strange smell.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02a"
        }
      ],
      "end": null
    },
    "e9323": {
      "entry_id": "e9323",
      "content": "Mick stammers, \"Uh… All Night Long,\" but his voice is flat and unconvincing. It’s clear he’s just trying to say something, anything, to get you off his back. He picks up his pace, heading towards one of the units.\n\nMick fumbles with a set of keys, finally unlocking a specific storage unit. The door creaks open, revealing a dimly lit space packed floor-to-ceiling with cardboard boxes of various sizes. The air is thick with the smell of cardboard and dust, and something acrid; it seems like a lot of merchandise for one person.",
      "choices": [
        {
          "content": "Consider the sheer scale of this operation; this must be more than just personal sales.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02b"
        },
        {
          "content": "Sense an unspoken tension in the air, and wonder if you're getting involved in something shady.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02c"
        },
        {
          "content": "Sniff the air, detecting a strange, chemical-like odor emanating from within the unit.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02a"
        }
      ],
      "end": null
    },
    "ebdf0": {
      "entry_id": "ebdf0",
      "content": "You can't shake the feeling that the smell is more than just old cardboard. Could it be related to how the albums were stored, or is something else entirely? Is something else hidden here?\n\nWith a grunt, Mick pulls out a box cutter and slices open one of the cardboard boxes. He peels back the flaps, revealing dozens of sealed copies of the new Lionel Richie album, gleaming under the dim light. Behind the boxes, you notice a stack of old 8-track tapes. You're surrounded by a mountain of Richie, a hidden hoard that begs the question: why is it here, and why is it so hard to find elsewhere in Wolverhampton?\n\nYou stand inside the dimly lit storage unit on the outskirts of Wolverhampton. Boxes upon boxes of the new Lionel Richie album surround you, a testament to the unexpected scale of this operation. Mick leans against a stack, waiting. You need to secure a copy.",
      "choices": [
        {
          "content": "Try to calculate the potential street value of this many albums, and what that might imply, ready to begin negotiations.",
          "entry_id": "e537a"
        },
        {
          "content": "Scan the storage unit, taking in the details of the surroundings, and the arrangement of the boxes.",
          "entry_id": "ea336"
        }
      ],
      "end": null
    },
    "e5e57": {
      "entry_id": "e5e57",
      "content": "You thank Mick for his help in obtaining the album, despite the odd circumstances. He simply nods, his gaze already drifting back to the mountain of Lionel Richie albums stacked behind him. He clearly has more important things on his mind.\n\nYou step out of the dimly lit storage unit and back into the Wolverhampton sunshine, the new Lionel Richie album clutched tightly in your hand. A wave of relief washes over you, mixed with a lingering feeling of unease about the whole shady transaction. Still, you have the album, and that's all that matters now. You can finally relax and enjoy Lionel's dulcet tones.",
      "choices": [],
      "end": "win"
    },
    "e0cef": {
      "entry_id": "e0cef",
      "content": "The notion of randomly asking strangers about a niche pub seems futile, but you spot a cluster of shops further down the Wolverhampton market. Maybe someone will recognise the description of a Lionel Richie-themed karaoke night. \n\nAfter a few minutes walking, a sign catches your eye. Emblazoned in neon pink and purple is the legend: 'Dancing on the Ceiling'. Below, a slightly faded image of Lionel Richie smiles down at you. Through the window, you can see various Lionel Richie posters plastered on the walls.",
      "choices": [
        {
          "content": "Take a deep breath and step inside for a pint, hoping for a miracle.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2c"
        },
        {
          "content": "Take a closer look at the posters outside to see if they mention future events.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2b"
        },
        {
          "content": "Let the sounds of Lionel Richie draw you inside.",
          "entry_id": "dancing_on_the_ceiling_clues_entry_2a"
        }
      ],
      "end": null
    },
    "e4016": {
      "entry_id": "e4016",
      "content": "You try to shake off the disappointment from the record shops. Even if you fail, a bit of fun is welcome. Besides, you are in a Lionel Richie pub, after all.\n\nInside 'Dancing on the Ceiling', the barman is polishing glasses and humming along to 'Three Times A Lady'. Framed records and posters adorn the walls. You decide to take a shot and ask if he knows where you might find the new album. He grins, revealing a gap between his teeth, and replies that Barry, the owner, is a *massive* Lionel Richie fan. Apparently, he pre-ordered loads of copies.\n\nThe barman, hearing about your quest, seems genuinely keen to assist. He offers to fetch Barry, declaring him the ultimate Lionel Richie authority.",
      "choices": [
        {
          "content": "Chat to the barman while you wait for Barry.",
          "entry_id": "the_superfan's_secret_entry_1a"
        },
        {
          "content": "Take a moment to soak in the atmosphere and examine the Lionel Richie memorabilia adorning the walls.",
          "entry_id": "the_superfan's_secret_entry_1b"
        }
      ],
      "end": null
    },
    "e4a79": {
      "entry_id": "e4a79",
      "content": "You look for any rare or signed memorabilia, hoping for a clue about Barry's Richie obsession. You spot a framed photo of Lionel with Barry, faded and slightly foxed, but it doesn’t seem like anything too valuable.\n\nYou ask the barman if he's a big Lionel Richie fan himself. He admits he appreciates the music, especially when it's 'Easy Like Sunday Morning', but says Barry, the owner, is the *real* superfan.",
      "choices": [
        {
          "content": "Ask the barman which Lionel Richie album cover is his favourite.",
          "entry_id": "eaf6c"
        },
        {
          "content": "Ask him if he's planning to attend the album release party tonight.",
          "entry_id": "e1fc7"
        }
      ],
      "end": null
    },
    "e1fc7": {
      "entry_id": "e1fc7",
      "content": "You ask if he's planning to attend the release party tonight. The barman replies that he'll be working, of course, and that he's looking forward to it immensely. He says Barry has been planning the event for weeks. He then heads off to find Barry.\n\nA moment later, the barman returns, followed by Barry, the owner of the pub. Barry is beaming, practically radiating enthusiasm for Lionel Richie. The pub walls behind him are plastered with Lionel Richie memorabilia. He's wearing a 'Hello' t-shirt and his eyes twinkle with fanatical excitement.",
      "choices": [
        {
          "content": "Directly ask Barry which Lionel Richie song is his personal favourite.",
          "entry_id": "the_superfan's_secret_entry_2b"
        },
        {
          "content": "Mention Barry's obvious enthusiasm for Lionel Richie, hoping to strike up a conversation about the new album.",
          "entry_id": "the_superfan's_secret_entry_2a"
        }
      ],
      "end": null
    },
    "e2a4e": {
      "entry_id": "e2a4e",
      "content": "You ask about the story behind the 'Dancing on the Ceiling' video, with its gravity-defying choreography. Barry's eyes light up, and he launches into a detailed explanation. He describes the cutting-edge special effects for the time, and how Lionel insisted on doing as many of the stunts himself as possible. He even does an impression of Lionel's signature moonwalk, nearly knocking over a pint glass in the process. He catches himself mid-moonwalk, suddenly remembering why you're here.\n\nBarry, still buzzing from his impromptu history lesson, pauses and looks at you, noticing your own enthusiasm. 'Wow, you're clearly a big fan!' he says, a smile spreading across his face.",
      "choices": [
        {
          "content": "Compliment Barry on his 'Hello' t-shirt.",
          "entry_id": "e4bfd"
        },
        {
          "content": "Ask Barry if he's always been a Lionel Richie fan.",
          "entry_id": "e50ae"
        }
      ],
      "end": null
    },
    "e0586": {
      "entry_id": "e0586",
      "content": "Barry's face softens as he recalls a Lionel Richie concert he attended back in the 80s. 'The atmosphere, the energy… it was electric!' he says, his voice filled with nostalgia. 'Everyone was just singing along, every word, every note. It was like… pure joy.'\n\nYou've been searching for this album everywhere! Still buzzing from his confession about accidentally cornering the market on the new album, Barry reaches under the bar and pulls out a pristine, shrink-wrapped copy of the new Lionel Richie album. 'Here you go, mate,' he says, handing it to you with a flourish. 'On the house. And you're welcome to join the release party tonight.' You receive the album from Barry, triumphant.",
      "choices": [
        {
          "content": "Ask Barry about the release night event in more detail.",
          "entry_id": "album_acquired_entry_2b"
        },
        {
          "content": "Thank Barry profusely for the album.",
          "entry_id": "album_acquired_entry_2a"
        }
      ],
      "end": null
    },
    "e73a5": {
      "entry_id": "e73a5",
      "content": "Barry's enthusiasm bubbles over as he describes the music lineup for the night, promising wall-to-wall Lionel Richie classics spun by a local DJ, alongside themed cocktails, such as the 'Hello' Highball (gin and grapefruit) and the 'Dancing on the Ceiling' Daiquiri (blue curaçao and pineapple).\n\nClutching the new Lionel Richie album, you exit the 'Dancing on the Ceiling' pub. The Wolverhampton sun shines down, and you feel a surge of triumph. You feel a powerful urge to immediately listen to the album.",
      "choices": [],
      "end": "win"
    },
    "e8ef5": {
      "entry_id": "e8ef5",
      "content": "You spot a framed photograph on the wall; a much younger Barry, sporting a questionable mullet, stands beaming next to Lionel Richie himself. Barry's arm is around Lionel, and both are giving a thumbs-up. It's clearly a treasured memento. You'd begun to think you'd never find the album. Barry, still buzzing from admitting to his hoarding, suddenly dives under the bar. He re-emerges, triumphantly holding aloft a pristine, shrink-wrapped copy of the new Lionel Richie album. 'For you, mate!' he declares, handing it over with a flourish. 'And you're officially invited to the release party tonight. First drink's on me!'",
      "choices": [
        {
          "content": "Probe for more details about the release night event.",
          "entry_id": "album_acquired_entry_2b"
        },
        {
          "content": "Thank Barry profusely for the album, overwhelmed by his generosity.",
          "entry_id": "album_acquired_entry_2a"
        }
      ],
      "end": null
    },
    "e7abd": {
      "entry_id": "e7abd",
      "content": "Barry grins, rubbing his hands together with glee. 'Oh, it's gonna be a night to remember! We've got a Lionel Richie karaoke competition later on, with a grand prize of a signed Lionel Richie photo – and a lifetime supply of pub snacks!'\n\nClutching the new Lionel Richie album to your chest, you exit the 'Dancing on the Ceiling' pub. The Wolverhampton sun shines down, and a surge of triumph washes over you, mixed with a powerful urge to immediately listen to the album. You're outside the pub, feeling victorious, the album is finally yours.",
      "choices": [],
      "end": "win"
    },
    "eafc6": {
      "entry_id": "eafc6",
      "content": "Barry waves your thanks away, looking genuinely pleased. 'Any time, mate! Just spreading a little Richie love.'\n\nYou step out of the 'Dancing on the Ceiling' pub and into the Wolverhampton sunshine, clutching the new Lionel Richie album to your chest. A wave of pure triumph washes over you. You can practically hear 'All Night Long' already. You turn towards home, ready to put the record on.",
      "choices": [],
      "end": "win"
    },
    "e1b62": {
      "entry_id": "e1b62",
      "content": "Barry's face lights up, hearing your heartfelt words. He grins, a twinkle in his eye. 'That's what I like to hear! Glad it's going to a true fan. You earned it, trekking all over Wolverhampton like that.'\n\nClutching the shrink-wrapped new Lionel Richie album, you step out of the 'Dancing on the Ceiling' pub and into the Wolverhampton sunshine. A surge of triumph washes over you, mixed with a powerful urge to get home and drop the needle on that sweet, sweet vinyl. Your quest is complete, and Lionel Richie awaits.",
      "choices": [],
      "end": "win"
    },
    "efe0b": {
      "entry_id": "efe0b",
      "content": "You grab your phone, fingers fumbling in your haste. You search for 'Lionel Richie new album Wolverhampton'. A few early reviews pop up, praising the smooth sounds, but nothing about local stock. Time is ticking!\n\nFully awake, the adrenaline is pumping. This isn't just about music; it's about being a *fan*. You throw back the duvet and decide to head straight to the large chain record store in the city centre. It's the obvious place to start your quest to secure Lionel Richie's new album.",
      "choices": [
        {
          "content": "Jump in the shower – smelling good for Lionel is essential.",
          "entry_id": "chain_store_letdown_entry_1a"
        },
        {
          "content": "Down a quick coffee – you'll need the energy for this mission.",
          "entry_id": "chain_store_letdown_entry_1b"
        }
      ],
      "end": null
    },
    "e009d": {
      "entry_id": "e009d",
      "content": "You pick up a copy of the album and squint at the price tag. £2.99! You can't believe your eyes. Surely this must be some kind of mistake? It seems unbelievably cheap, almost too good to be true. You look around, half expecting someone to snatch it away, declaring it a mispricing error. But no one seems to notice your bargain. Is this a charitable miracle, or has someone seriously underestimated Lionel's enduring appeal in Wolverhampton?\n\nHolding the album, you feel a surge of hope. This find might just save the day! You clutch the album tightly, ready to head to the till and secure your prize. You stand at the till inside the Wolverhampton charity shop, Lionel Richie's new album clutched in your hand. A sense of hopeful anticipation washes over you as you prepare to make the purchase.",
      "choices": [
        {
          "content": "While you wait for the volunteer, browse the nearby shelves.",
          "entry_id": "e92f5"
        },
        {
          "content": "Make conversation with the volunteer at the till as you go to pay.",
          "entry_id": "eb9c5"
        }
      ],
      "end": null
    },
    "ecde2": {
      "entry_id": "ecde2",
      "content": "You scrutinise the album cover, front and back, checking for any tell-tale signs of damage. The colours are vibrant, Lionel's beaming smile is reassuringly intact. But wait... on the back, just above the barcode, you spot it. A tiny imperfection, a minuscule blur affecting the 'i' in 'Richie'. Almost unnoticeable, yet undeniably there.\n\nDespite the misprint, a wave of relief washes over you as you hold the album. This could be it, the end of your Wolverhampton quest! You grip the album tightly, a tangible symbol of hope in your slightly sweaty palm, ready to pay and claim your prize. You shuffle towards the till, your heart pounding in anticipation. This is it.",
      "choices": [
        {
          "content": "While you wait, browse the towering shelves.",
          "entry_id": "e92f5"
        },
        {
          "content": "Chat to the cheery volunteer behind the counter as you pay.",
          "entry_id": "eb9c5"
        }
      ],
      "end": null
    },
    "e1606": {
      "entry_id": "e1606",
      "content": "You manage to talk him down, saving yourself a measly two quid. You can't help feeling like you're still being ripped off, but at least it's *slightly* less painful. He scribbles an address on a crumpled napkin and a name: 'Mick'.\n\nThe napkin leads you to a grim industrial estate on the outskirts of Wolverhampton. Rows of identical storage units stretch into the distance, each one as uninviting as the last. This whole venture feels increasingly suspect. A skinny bloke in a tracksuit, chewing gum and looking shifty, stands by a padlocked gate. He flicks his cigarette butt to the ground as you approach. This must be Mick. He nods curtly, eyes darting around.",
      "choices": [
        {
          "content": "Accuse Mick of being a con artist.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01a"
        },
        {
          "content": "Try to act like you're old mates with Mick.",
          "entry_id": "storage_unit_stash_entry_storage_unit_01b"
        }
      ],
      "end": null
    },
    "ec9ca": {
      "entry_id": "ec9ca",
      "content": "Before you step inside 'Dancing on the Ceiling', you smooth down your crumpled shirt. Gotta look presentable, especially around fellow Richie aficionados. You push open the door and see framed records and posters adorning the walls. The barman is humming 'Hello' while polishing glasses. You decide to chance your luck and ask, 'Know anywhere I could pick up the new Lionel Richie album?' He grins, 'Barry, the owner, is *obsessed*. Pre-ordered loads, he did.' He leans closer, 'I'll grab him for you, he's the biggest fan I know.'",
      "choices": [
        {
          "content": "Chat to the barman while he fetches Barry.",
          "entry_id": "the_superfan's_secret_entry_1a"
        },
        {
          "content": "Check out the framed 'Can't Slow Down' album cover hanging above the bar and other memorabilia.",
          "entry_id": "the_superfan's_secret_entry_1b"
        }
      ],
      "end": null
    },
    "e671a": {
      "entry_id": "e671a",
      "content": "The poster shouts about 'Lionel Libations' – two-for-one cocktails all night – and a 'Hello, Is It Quiz You're Looking For?' trivia night later in the week. A pub this dedicated to Lionel Richie *must* be worth investigating. You step inside 'Dancing on the Ceiling' to the sound of someone attempting 'Dancing on the Ceiling' on a karaoke machine. The barman, wiping down the counter, is humming along. He looks up as you approach. You ask, perhaps a little too eagerly, if he knows where you could possibly find a copy of the new album. He grins. \"Barry? The owner? He's the *biggest* Lionel Richie fan I know. Pre-ordered loads, he did.\"",
      "choices": [
        {
          "content": "Ask the barman if *he's* a big Lionel Richie fan.",
          "entry_id": "the_superfan's_secret_entry_1a"
        },
        {
          "content": "Ask the barman if you can speak to Barry.",
          "entry_id": "the_superfan's_secret_entry_1b"
        }
      ],
      "end": null
    },
    "charity_shop_rumours_entry_charity_start": {
      "entry_id": "charity_shop_rumours_entry_charity_start",
      "content": "Outside 'Vinyl Vortex', your earlier confidence begins to wane. The thought of giving up flickers momentarily, but then 'Dancing on the Ceiling' begins to play in your head, reminding you why you started this quest. You won't be defeated! Just then, as you stand on the pavement in Wolverhampton, you overhear two people chatting nearby. \"...apparently, the Age UK on Broad Street got a whole box of new CDs by mistake,\" one says. \"New CDs? In a charity shop?\" the other replies, incredulous. Could this be the answer?",
      "choices": [
        {
          "content": "Overcome your hesitation and head straight for the bus station to get to Broad Street.",
          "entry_id": "e83c4"
        },
        {
          "content": "Decide it's too unlikely and head to the pub for a pint, figuring you can stream it later.",
          "entry_id": "e1bec"
        }
      ],
      "end": null
    },
    "secret_storage_unit_entry_market_stall_approach": {
      "entry_id": "secret_storage_unit_entry_market_stall_approach",
      "content": "The stallholder purses his lips, stroking his chin. 'Lionel Richie, eh? Bit before my time, that. Still,' he adds, glancing around again, 'I might know someone who knows someone... Heard whispers of a stash. Down by the storage units, outskirts of town. Friend of a friend, see? Name's Mick.' He scribbles a number on a scrap of paper, avoiding your gaze. 'Don't say you got it from me, alright?'",
      "choices": [
        {
          "content": "Try to get more information about the 'local music scene' from the stallholder.",
          "entry_id": "secret_storage_unit_entry_market_stall_chat"
        },
        {
          "content": "Casually check out the stall for anything that might hint at this 'stash'.",
          "entry_id": "secret_storage_unit_entry_inspect_stall"
        }
      ],
      "end": null
    },
    "storage_unit_stash_entry_storage_unit_02c": {
      "entry_id": "storage_unit_stash_entry_storage_unit_02c",
      "content": "Despite the mild weather, a shiver runs down your spine. The air inside the storage unit feels heavy, like a Wolverhampton fog, but thicker, laced with unspoken secrets and a palpable sense of wrongness. You can't shake the feeling that you're involved in something shady, like a dodgy market deal gone south.",
      "choices": [
        {
          "content": "Push down the guilt, reminding yourself that you're here for the album, whatever it takes.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02c2"
        },
        {
          "content": "Spot a glint of metal in the corner of the unit: a security camera, its unblinking eye fixed on you.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02c1"
        }
      ],
      "end": null
    },
    "e92f5": {
      "entry_id": "e92f5",
      "content": "While the volunteer rings up the album, you glance at the towering shelves crammed with yellowing paperbacks. Titles like 'Knitting with Cats' and 'The History of Wolverhampton's Canals' vie for your attention. The air hangs heavy with the scent of aged paper and a faint, indefinable mustiness.\n\nFinally, the volunteer calls you back. You hand over £2.99, the new Lionel Richie album now officially yours. A wave of satisfaction washes over you, but you are so eager to play the album that you consider checking it before you leave the shop.",
      "choices": [
        {
          "content": "Whip out your phone and quickly check if the CD is legit.",
          "entry_id": "ebfaf"
        },
        {
          "content": "Donate the spare change jingling in your pocket to the charity.",
          "entry_id": "charity_shop_win_entry_donate"
        },
        {
          "content": "Give the cover one last, meticulous examination.",
          "entry_id": "ee61c"
        }
      ],
      "end": null
    },
    "eaf44": {
      "entry_id": "eaf44",
      "content": "You ask him to sing a few lines from his favourite song. Barry throws his head back and obliges, belting out 'Oh, what a feeling, when we're dancing on the ceiling!' slightly off-key but with unrestrained enthusiasm. His face is beaming.",
      "choices": [
        {
          "content": "Tell Barry that his love of Lionel Richie is inspiring.",
          "entry_id": "e4bfd"
        },
        {
          "content": "Ask if he's always been such a big fan.",
          "entry_id": "e50ae"
        }
      ],
      "end": null
    },
    "e1bec": {
      "entry_id": "e1bec",
      "content": "The thought of giving up flickers momentarily. You're disheartened by the lack of Lionel Richie's new album. But then, 'Dancing on the Ceiling' begins to play in your head, a defiant earworm reminding you why you started this quest. You won't be defeated! Just then, as you stand on the pavement in Wolverhampton, you overhear two people chatting nearby. \"...apparently, the Age UK on Broad Street got a whole box of new CDs by mistake,\" one says. \"New CDs? In a charity shop?\" the other replies, incredulous. Could this be the answer?",
      "choices": [
        {
          "content": "Edge closer to the pair to eavesdrop on their conversation about Age UK.",
          "entry_id": "e72b5"
        },
        {
          "content": "Consider the charity shop rumour, but remain sceptical.",
          "entry_id": "e587c"
        }
      ],
      "end": null
    },
    "ee7bd": {
      "entry_id": "ee7bd",
      "content": "You lean closer to the poster outside 'Dancing on the Ceiling'. The words 'Lionel Richie Album Release Party' are emblazoned in glittery lettering, and beneath, in smaller print, you see the crucial detail: 'TODAY!'. A surge of adrenaline courses through you. This could be it! You push open the door, the familiar strains of 'Dancing on the Ceiling' washing over you.\n\nInside, a barman with a neatly trimmed moustache polishes glasses, humming along to the music. You approach the bar, trying to sound casual. \"Excuse me,\" you say, \"do you happen to know where a person might find the new Lionel Richie album?\"\n\nThe barman stops polishing, a wide grin spreading across his face. \"Lionel, eh? You've come to the right place! Barry, the owner, is a *massive* fan. Pre-ordered loads of copies, he did.\"",
      "choices": [
        {
          "content": "Ask the barman if *he's* a big Lionel Richie fan.",
          "entry_id": "the_superfan's_secret_entry_1a"
        },
        {
          "content": "Ask the barman if you can speak to Barry.",
          "entry_id": "the_superfan's_secret_entry_1b"
        }
      ],
      "end": null
    },
    "dusty_depths_entry_dusty_start": {
      "entry_id": "dusty_depths_entry_dusty_start",
      "content": "Leaving 'Vinyl Vortex', you find yourself standing in a narrow alleyway, the air thick with the smell of damp brick and discarded chips. A sign, barely legible through the grime, points to 'Vinyl Paradise', a second-hand record shop promising 'Hidden Gems'. Two record stores have turned up empty, but you're determined to continue the hunt for Lionel. The shop's doorway is ajar, beckoning you into its shadowy depths.",
      "choices": [
        {
          "content": "Admit defeat and head home to stream the album, resolving to pre-order next time.",
          "entry_id": "e2d56"
        },
        {
          "content": "Consult your phone for other record stores in Wolverhampton, clinging to the hope of finding a physical copy.",
          "entry_id": "e83cb"
        }
      ],
      "end": null
    },
    "storage_unit_stash_entry_storage_unit_02c2": {
      "entry_id": "storage_unit_stash_entry_storage_unit_02c2",
      "content": "A pang of guilt hits you. You're potentially supporting something dodgy just to get your hands on a record. But the desire for the new Lionel Richie album overpowers your conscience. You're in too deep now, the die is cast.",
      "choices": [
        {
          "content": "Ruminate on the implications of so many albums being stored here.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02b"
        },
        {
          "content": "Sniff the air, trying to identify that strange smell in the storage unit.",
          "entry_id": "storage_unit_stash_entry_storage_unit_02a"
        }
      ],
      "end": null
    },
    "e587c": {
      "entry_id": "e587c",
      "content": "A charity shop selling new albums seems far-fetched. You can't shake the feeling this is some kind of prank, perhaps orchestrated by a rival Lionel fan trying to throw you off the scent. But the desperation is setting in, and the thought of hearing Lionel's smooth vocals is too tempting to ignore.\n\nThe rumour of the charity shop stash feels like the only lead you have left. You are still in Wolverhampton, and despite the unlikelihood of it all, the Age UK on Broad Street is now your best bet. You must decide whether to pursue this strange tip-off, or try another record shop first.",
      "choices": [
        {
          "content": "Try a different record shop, even though the others have failed you.",
          "entry_id": "ec52b"
        },
        {
          "content": "Head to Broad Street, ready to sift through the charity shop's unlikely treasure trove.",
          "entry_id": "eae1a"
        }
      ],
      "end": null
    },
    "e66e7": {
      "entry_id": "e66e7",
      "content": "You stretch, feeling the Wolverhampton sun warm your face through the window. A true Lionel Richie fan deserves to feel relaxed before embarking on this quest. But the DJ's words echo in your mind: 'Spin City' record store, special promotion! You need to get moving. Quickly now! The thought of securing that new album is all that matters.\n\nYou are now fully awake, fueled by a mixture of panic and excitement. Your mission is clear: secure a copy of Lionel Richie's new album. You hurriedly throw on some clothes, ready to begin your quest. The large chain record store in the city centre seems like the most obvious starting point.",
      "choices": [
        {
          "content": "Hop in the shower; smelling nice for this occasion is important.",
          "entry_id": "chain_store_letdown_entry_1a"
        },
        {
          "content": "Stumble into the kitchen and brew some coffee, fortification is essential.",
          "entry_id": "chain_store_letdown_entry_1b"
        }
      ],
      "end": null
    }
  },
  "title": "Richie Retrieval",
  "description": "A quest to find the elusive new Lionel Richie album in the heart of Wolverhampton.",
  "date": "2025-03-11",
  "order": 999,
  "tags": [
    "gemini/gemini-2.0-flash",
    "Wolverhampton",
    "music",
    "vinyl"
  ],
  "layout": "layouts/game.njk",
  "prompt": "N/A"
}